{"title":"WoW-3.0.9-to-3.1.0-enGB-Win-patch","uid":4776199,"size":623167569,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:006271733b130590ef330a4f05f5ff147ea85b99&amp;dn=WoW-3.0.9-to-3.1.0-enGB-Win-patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ajcrossy","files":1,"time":1237222620,"description":"WoW-3.0.9-to-3.1.0-enGB-Win-patch\n\n\n\nWorld of Warcraft PTR Patch 3.1.0\n\nGeneral\n\n    * All Ground Mounts may now swim without dismounting the rider. Flying Mounts still may NOT, and will dismount the rider upon entering water.\n\n    * Ulduar is now available for limited testing. Please visit the Public Test Realms for more details. \n\n    * Players at maximum level will now be able to visit their trainer to pay a one-time fee and access the dual talent specialization feature.\n\n    * A new Gear Manager feature has been added. Players will now be able to save gear sets for easy gear switching.\n\n    * New high-resolution player textures for Northrend armor sets have been added. Players can enable this feature by setting Player Textures to High in the Effects Panel of the Video Options.\n\n    * Players can now return items purchased with an alternate currency back to the original vendor within 2 hours of the purchase time for the original cost of the item. Stackable items (such as Frozen Orbs and gems) and charged items that can be purchased with an alternate currency are not eligible.\n\n    * Confirmation boxes have been added to purchases over 150 gold.\n\n    * The achievement Brew of the Year has been removed from the Brewmaster meta-achievement. The achievement Brew of the Month has been added in its place.\n\n    * Noblegarden has been redesigned into a week-long holiday with new items, quests, and more. Various achievements have been added, including the meta-achievement Noble Gardener, which is now required for the meta-achievement What A Long, Strange Trip It's Been.\n\n    * Copied Test Realm characters will no longer be copied with their achievement history in order to better facilitate the character copy process.\n","torrent":{"xt":"urn:btih:006271733b130590ef330a4f05f5ff147ea85b99","amp;dn":"WoW-3.0.9-to-3.1.0-enGB-Win-patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"006271733b130590ef330a4f05f5ff147ea85b99","infoHashBuffer":{"type":"Buffer","data":[0,98,113,115,59,19,5,144,239,51,10,79,5,245,255,20,126,168,91,153]},"announce":[],"urlList":[]}}