{"title":"Dames (1934) DVD5 - Musical Comedy Classic [DDR]","uid":9294083,"size":4060143616,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0108ac4c4c35343057d58e2a8bcbe98be6401f09&amp;dn=Dames+%281934%29+DVD5+-+Musical+Comedy+Classic+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1386134521,"description":"Dames (1934) DVD5 - Musical Comedy Classic [DDR]\n\nDames is a 1934 Warner Bros. musical comedy film directed by Ray Enright with dance numbers created by Busby Berkeley. \nThe film stars Ruby Keeler, Dick Powell, Joan Blondell, Guy Kibbee, ZaSu Pitts, and Hugh Herbert. \nProduction numbers and songs include &quot;When You Were a Smile on Your Mother's Lips (and a Twinkle in Your Daddy's Eye)&quot;, &quot;The Girl at the Ironing Board&quot;, &quot;I Only Have Eyes for You&quot;, &quot;Dames&quot; and &quot;Try to See It My Way&quot;.\n\nCAST:-\nDick Powell as Jimmy Higgens\nRuby Keeler as Barbara Hemingway\nJoan Blondell as Mabel Anderson\nZaSu Pitts as Matilda Ounce Hemingway\nGuy Kibbee as Horace Peter Hemingway\nHugh Herbert as Ezra Ounce\n\nDirected by Ray Enright, Busby Berkeley (musical numbers)\nProduced by Hal B. Wallis\nWritten by Robert Lord, Delmer Daves\n\nMUSICAL NUMBERS:-\nThe musical sequences in Dames were designed, staged and directed by Busby Berkeley - the Warner Bros. publicity office invented the phrase &quot;cinematerpsichorean&quot; to describe Berkeley's creations. \nBy this time, after the success of 42nd Street, Footlight Parade and Gold Diggers of 1933, Berkeley had his own unit at Warners, under his total control as supervised by producer Hal Wallis.\n\n    &quot;Dames&quot; - by Harry Warren (music) and Al Dubin (lyrics)\n\n    &quot;I Only Have Eyes for You&quot; - by Harry Warren (music) and Al Dubin (lyrics). \nAt one point in this number, sung by Dick Powell to Ruby Keeler, all the girls in the chorus wear Ruby Keeler masks as they move around the stage, but in just about every shot, the real Keeler passes by the camera briefly. \nIn 1989, this song won an ASCAP Award as the &quot;Most Performed Feature Film Standard&quot;.\n\n    &quot;The Girl at the Ironing Board&quot; - by Harry Warren (music) and Al Dubin (lyrics). Joan Blondell was seven months pregnant at the time this number was filmed, and care had to be aken by her husband, cinematographer George Barnes, not to show her condition. Also, at one point in the number, a property man can be seen in the background, hanging up clotheslines.\n\n    &quot;When You Were a Smile on Your Mother's Lips and a Twinkle in Your Daddy's Eye&quot; by Sammy Fain (music) and Irving Kahal lyrics\n\n    &quot;Try to See It My Way&quot; - by Allie Wrubel (music) and Mort Dixon (lyrics)[4]\n\nOne of the effects of the Production Code on this film is a musical number that never made it to the screen. Berkeley had planned one featuring Joan Blondell about a fight between a cat and a mouse that ended with Blondell inviting everyone to &quot;come up and see my pussy sometime.&quot; Producer Hal Wallis removed this number from the script before it even got to the censors of the Hays Office.\n\nSYNOPSIS:- Dames (1934)\nEccentric multimillionaire Ezra Ounce (Hugh Herbert), whose main purpose in life is raising American morals through a nationwide campaign, wants to be assured that his fortune will be inherited by upstanding relatives, so he visits his cousin, Matilda Hemingway (Zasu Pitts) in New York City, in Horace's view the center of immorality in America. What Ounce finds most offensive are musical comedy shows and the people who put them on, and it just so happens that Matilda's daughter, Barbara (Ruby Keeler), is a dancer and singer in love with a struggling singer and songwriter, her 13th cousin, Jimmy Higgens (Dick Powell). On Ezra's instructions, Jimmy the &quot;black sheep&quot; has been ostracized by the family, on pain of not receiving their inheritance.\n\nMatilda's husband, Horace (Guy Kibbee) meets a showgirl named Mabel (Joan Blondell), who's been stranded in Troy when her show folds, and connives her way into sleeping in Horace's train compartment as a way to get back home. Terrified of scandal, he leaves her some money and his business card, along with a note telling her to not mention their meeting to anyone; but when Mabel discovers that Horace is Barbara's father, she blackmails him into backing Jimmy's show.\n\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 91 mins\nSubtitles: English, Francais, Espanol\nRipped by: Trinidad [DDR]\nDuration: 91 mins","torrent":{"xt":"urn:btih:0108ac4c4c35343057d58e2a8bcbe98be6401f09","amp;dn":"Dames+%281934%29+DVD5+-+Musical+Comedy+Classic+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0108ac4c4c35343057d58e2a8bcbe98be6401f09","infoHashBuffer":{"type":"Buffer","data":[1,8,172,76,76,53,52,48,87,213,142,42,139,203,233,139,230,64,31,9]},"announce":[],"urlList":[]}}