{"title":"Sanitarium_","uid":4715523,"size":1840852992,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0ab9b27affc35409270c54dcd4aaece4dbe4da80&amp;dn=Sanitarium_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Martinfv","files":-1,"time":1234258762,"description":"From wikipedia:\n\nSanitarium is a point-and-click adventure game released in 1998 by ASC Games. A psychological thriller often praised for its atmosphere and originality, Sanitarium tells the story of a man named Max Laughton who is suffering from amnesia due to a car accident as he frantically tries to unveil the details of his institutionalization inside a bizarre medieval-styled asylum. The search for his own identity - and &quot;the truth&quot; - takes place within the grounds of the sanitarium and inside his own delusions and flashbacks, as he confronts the ghosts of his past. The dark mood and graphics of the game are matched by an equally ominous musical background.\nThe game uses a bird's-eye view perspective and a non-tiled 2D navigational system. Each world and setting carries a distinct atmosphere that presents either the real world, the imaginary world, or a mix of both of the main protagonist. In many cases, it is unclear to the player if the world the character is currently in is real or a product of Max's own imagination. This indistinction underlines much of the horror portrayed in the game\n\nIt's very old but I had no problem running it on vista on win 95 compatibility mode.","torrent":{"xt":"urn:btih:0ab9b27affc35409270c54dcd4aaece4dbe4da80","amp;dn":"Sanitarium_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab9b27affc35409270c54dcd4aaece4dbe4da80","infoHashBuffer":{"type":"Buffer","data":[10,185,178,122,255,195,84,9,39,12,84,220,212,170,236,228,219,228,218,128]},"announce":[],"urlList":[]}}