{"title":"The Power Within","uid":5200899,"size":3711827968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c0947ff824fdbe0f5e01cb0e9bf4c3a572e2caa&amp;dn=The+Power+Within&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"algini","files":1,"time":1260155929,"description":"I am the only one I believe offering this for free. I dont believe our cultural film heritage should be held hostage for a high cost on a film this old if it was made for TV. This, plus my gratitude for the quality items I have gotten from this site, has led me to upload it.\n\n   It is a 1979 movie pilot, by Aaron Spelling called the Power Within.  Another name considered was Power Man. It is an ISO made from a video captured VCR tape.  The quality is 1979 video, and there may be an initial sound problem with a burned DVD that requires the DVD to be re-inserted for the sound to come in.  It was the best version ISO that could be done, however. All in all though, it is good quality, even if it might require re-insertion.\n\n   The story goes that a young stunt pilot, who's mother had been in a nuclear accident while he was in the womb, gets struck by lightning while changing a car tire.  (they should have struck him in the air to jazz it up a bit).  Anyway, he now has abnormal strength, and can now shoot lightning bolts out of his fingertips.  He must regulate the electrical usage, courtesy of a wrist watch from NASA. Cause if he runs out, he will croak.  That is if you yourself dont croak from the bad acting.  Lets face it. You are as dated as the movie itself if you were a bright eyed 14 year old when you saw this in 1979 and thought it was better than Star Wars. Anyway if our hero with the Partridge Family haircut, runs outta juice, he must recharge in a wacky old star trek looking device (ironically using old trek sound effects)\n\nProduced by Aaron Spelling, starring Art Hindle, Edward Burns, Joe Rassulo, and Susan Howard and other actors that you never heard of again.  The story line is good,if your suspension of disbelief is great enough on Government security. But the premise is innovative. Sort of Superman meets Boy in the Plastic Bubble.  For the time, you have to wonder why it never became a series.","torrent":{"xt":"urn:btih:0c0947ff824fdbe0f5e01cb0e9bf4c3a572e2caa","amp;dn":"The+Power+Within","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c0947ff824fdbe0f5e01cb0e9bf4c3a572e2caa","infoHashBuffer":{"type":"Buffer","data":[12,9,71,255,130,79,219,224,245,224,28,176,233,191,76,58,87,46,44,170]},"announce":[],"urlList":[]}}