{"title":"Robin Hood","uid":5816838,"size":4681482240,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0d2aa70328d6f30604e1be797ceb8b8873f38842&amp;dn=Robin+Hood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiagofavi2612","files":1,"time":1283881755,"description":"Robin Hood conta a histÃƒÂ³ria de um exÃƒÂ­mio arqueiro, anteriormente interessado somente em sua auto-preservaÃƒÂ§ÃƒÂ£o, a serviÃƒÂ§o do exÃƒÂ©rcito do Rei Ricardo contra a FranÃƒÂ§a. Depois da morte de Ricardo, Robin segue para Nottingham, uma cidade que sofre por causa da corrupÃƒÂ§ÃƒÂ£o de um xerife tirÃƒÂ¢nico e da cobranÃƒÂ§a exorbitante de impostos, onde se apaixona pela impetuosa viÃƒÂºva Lady Marion (a ganhadora do OscarÃ‚Â® Cate Blanchett), uma mulher desconfiada da identidade e dos motivos deste guerreiro da floresta. Esperando conquistar Lady Marion e salvar o vilarejo, Robin reÃƒÂºne um bando cujas habilidades mercenÃƒÂ¡rias letais sÃƒÂ£o igualadas somente por seu desejo aproveitar a vida. Juntos, eles comeÃƒÂ§am a saquear os ricos indulgentes para corrigir as injustiÃƒÂ§as cometidas pelo xerife. Com o enfraquecimento de seu paÃƒÂ­s depois de dÃƒÂ©cadas de guerra, sofrendo com as regras ineficientes do novo rei e vulnerÃƒÂ¡veis por causa das revoltas locais e das ameaÃƒÂ§as vindas de longe, Robin e seus homens partem para uma aventura ainda maior. Estes improvÃƒÂ¡veis herÃƒÂ³is e seus amigos pretendem proteger seu paÃƒÂ­s de uma guerra civil sangrenta e devolver a glÃƒÂ³ria para a Inglaterra uma vez mais.","torrent":{"xt":"urn:btih:0d2aa70328d6f30604e1be797ceb8b8873f38842","amp;dn":"Robin+Hood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d2aa70328d6f30604e1be797ceb8b8873f38842","infoHashBuffer":{"type":"Buffer","data":[13,42,167,3,40,214,243,6,4,225,190,121,124,235,139,136,115,243,136,66]},"announce":[],"urlList":[]}}