{"title":"Gambale, Hamm, Smith - Show Me What You Can Do [FLAC]","uid":4374021,"size":411151608,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0e6e40aac60751615e3d10e8f1c6be4623d8ce98&amp;dn=Gambale%2C+Hamm%2C+Smith+-+Show+Me+What+You+Can+Do+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"downup","files":9,"time":1220309857,"description":"Review\tby John W. Patterson\n\nGambale and the gang tear it up! Stu Hamm is Levinesque-thundering, Stanley Clarke-kicking bass. Vital Information's Steve Smith's drumming keeps right up when it gets wild and hold things together during spacy chordal splurges. These pros got pumped watching old Mahavishnu Orchestra videos and cranked up the old fusion fires. Gambale surprised me on this one. So many of his other releases exhibit more of that bouncy jazz with clean, fast, sweep picking and an obvious structured disciplined approach. This album shows he can get mean, edgy, overdriven, and raw, and be a downright awesome riff monster. Hamm is an earthquake, Smith a splinter-slingin' tornado.\n\nI heard McLaughlin's odd modes and moods clearly influencing &quot;The Promise&quot; and &quot;Dangerous Curves.&quot; Tasteful harp-plucked chord progressions build in a Summers/Metheny/Holdsworth meshwork. Everyone gets space to stretch on &quot;Beyond The Bridge&quot; and &quot;Sink.&quot; Hamm goes bassman crazy on &quot;Wrong and Strong.&quot; Watch out Manring. On &quot;Astral Traveler,&quot; Gambale does the Eric Johnson/Satriani dance, throws in a dose of his own machine gun bullet notes in a Scott Hendersonian bluesy-rock raunch, and deftly so at full throttle. &quot;Tanya's Touch&quot; sets you soul-travelin' the rain-slick, empty streets, wandering thru whispering snows, and then over the earth's glowing, blue-fired atmosphere. Find out for yourself what other nice surprises await you here. Pick this one up for end-of-the-millenium fusion finesse. Highly recommended.\n\n\nRip has been made by Sound Juicer version 2.22.0.\nEncoding has been executed by FLAC version 1.2.1.\n","torrent":{"xt":"urn:btih:0e6e40aac60751615e3d10e8f1c6be4623d8ce98","amp;dn":"Gambale%2C+Hamm%2C+Smith+-+Show+Me+What+You+Can+Do+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e6e40aac60751615e3d10e8f1c6be4623d8ce98","infoHashBuffer":{"type":"Buffer","data":[14,110,64,170,198,7,81,97,94,61,16,232,241,198,190,70,35,216,206,152]},"announce":[],"urlList":[]}}