{"title":"Todd Morris - A Gun for Jennifer (1996)","uid":4513797,"size":4658526208,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1428cf158ec20c4ac3328bf2d2cb53211a3fcdc6&amp;dn=Todd+Morris+-+A+Gun+for+Jennifer+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"monotoni","files":12,"time":1226888818,"description":"I managed to see this at a rare screening during the Fantasia Festival a few years back and I was very impressed. Reminded me of early Abel Ferrara (Ms. 45), Wes Craven (Last House on the Left) or even John Cassavetes (Killing of a Chinese Bookie). The basic story involves a young woman (Deborah Twiss), new to NYC, that is saved from being raped by a feminist vigilante gang. The guerillas take her in and give her a job at their front business, a divey strip club, and introduce her to their night-time revenge raids. It gets pretty intense and twisted from there. Political, creepy and sexy. See this if you get the chance, because I don't think it'll make it to your local Blockbusters. \n(from IMDB) \nyou probably know what to expect...\n\n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\n","torrent":{"xt":"urn:btih:1428cf158ec20c4ac3328bf2d2cb53211a3fcdc6","amp;dn":"Todd+Morris+-+A+Gun+for+Jennifer+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1428cf158ec20c4ac3328bf2d2cb53211a3fcdc6","infoHashBuffer":{"type":"Buffer","data":[20,40,207,21,142,194,12,74,195,50,139,242,210,203,83,33,26,63,205,198]},"announce":[],"urlList":[]}}