{"title":"Arrested Development Entire Series .ISO Format","uid":4866310,"size":37451954223,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:142d6aea908380b34c6ddeca592ea2fc2169aba3&amp;dn=Arrested+Development+Entire+Series+.ISO+Format&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Renkse","files":9,"time":1240530307,"description":"How FOX could allow this smart, hilarious, multiple-emmy-winning show to die is truly beyond me.\n\nIt had a great ensemble cast and some brilliant writing but for some reason no one was watching. Perhaps the ever-shifting time slot had something to do with it, who knows?\n\nWhen the patriarch of the wealthy Bluth family (Jeffrey Tambor) is arrested and jailed for embezzlement, Michael Bluth (Jason Bateman) attempts to keep his self-absorbed, entitled-but-now-penniless family together - despite the fact that he hates them all. \n\nHis over controlling mother Lucille (Jessica Walter) who is also a bit of a high society lush; his older brother Gob (pronounced 'johb', Will Arnett) fancies himself as a stage magician, but is actually just a con man and a mooch; his sister Lindsay (Portia de Rossi) always seems to be championing causes she doesn't quite understand and is married to former-doctor-turned-layabout Tobias Funke (David Cross) who always seems to come across as a little gay.\n\nOh, and the series narrator is none other than Ron Howard.\n\nThese are .ISO files of the DVD sets produced for the series, so this torrent is pretty massive, but that means that all menus, commentaries, subtitles, deleted scenes and other extras are all intact.\n\nCheers!","torrent":{"xt":"urn:btih:142d6aea908380b34c6ddeca592ea2fc2169aba3","amp;dn":"Arrested+Development+Entire+Series+.ISO+Format","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"142d6aea908380b34c6ddeca592ea2fc2169aba3","infoHashBuffer":{"type":"Buffer","data":[20,45,106,234,144,131,128,179,76,109,222,202,89,46,162,252,33,105,171,163]},"announce":[],"urlList":[]}}