{"title":"BitComet 0.78","uid":3567367,"size":3837852,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:14d9ed44974373ea1f3359caf705af800dcaa2b3&amp;dn=BitComet+0.78&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NickUS","files":1,"time":1164827227,"description":"BitComet is a p2p file-sharing freeware fully compatible with Bittorrent, which is one of the most popular p2p protocol designed for high-speed distribution of 100MB or GB sized files. BitComet is a powerful, clean, fast, and easy-to-use bittorrent client. It supports simultaneous downloads, download queue, selected downloads in torrent package, fast-resume, chatting, disk cache, speed limits, port mapping, proxy, ip-filter, etc.\n\nWhat&amp;#039;s New:\n\nGUI Improved: change the display font in Statistics View to monospaced font\nGUI Improved: improve the task delete confirm dialog\nGUI Improved: add a button to rename download file by serverval rules in HTTP task properties dialog\nGUI Improved: new proxy setting page in preferences dialog\nGUI Improved: now can select which columns to display in task list by right click task list header\nGUI Improved: now can import Flash files (.swf) when select download all links or download videos in webpage\nGUI Improved: change the default operation for close button on main window to minimize main window\nGUI Bugfix: fix the focous switch order when press Tab key in the HTTP task properties dialog\nGUI Bugfix: fix the problem that the redownload button does not work when import a new task but a exist task with the same URL is detected\nGUI Bugfix: fix the problem that the download left time is displayed as zero when download rate is zero\nCore Improved: add support for connection via HTTP, SOCK4, SOCK5 proxy server\nCore Improved: enhance the function of download videos in webpage, optimize for mainstream video websites\nCore Improved: improved Rmvb file version and Real codec version detection algorithm, avoid most crash when play rmev files\nCore Bugfix: fix the problem that unable to download file from certain FTP server\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nCodec Packs &amp; P2P Downloads :     &lt;a href=&quot;\nhttp://kppfree.altervista.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kppfree.altervista.org/&lt;/a&gt;\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++","torrent":{"xt":"urn:btih:14d9ed44974373ea1f3359caf705af800dcaa2b3","amp;dn":"BitComet+0.78","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d9ed44974373ea1f3359caf705af800dcaa2b3","infoHashBuffer":{"type":"Buffer","data":[20,217,237,68,151,67,115,234,31,51,89,202,247,5,175,128,13,202,162,179]},"announce":[],"urlList":[]}}