{"title":"BBC Radio Documentary - In our Time (Complete 2007 Season)","uid":4601349,"size":772335679,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:14f68e5a3599ba44189cfea7443facf48c6c35e1&amp;dn=BBC+Radio+Documentary+-+In+our+Time+%28Complete+2007+Season%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eddie1969","files":47,"time":1230228126,"description":"In Our Time - 2007 \n\nBBC Radio 4\nMP3: 56 and 64 kbps (mono); 44 kHz\n29 hours 10 mins (42 episodes of approx 42 mins each)\n\nIn Our Time is a long-running, live BBC radio programme where Melvyn Bragg guides three expert guests through a 40 minute discussion of the weeks' subject. The show's tag-line is &quot;exploring the history of ideas&quot; and subject matter jumps eclectically from science to history, literature, religion and philosophy. \n\nThe experts are almost always erudite and able to explain the sometimes-complex material so as to be understandable to the reasonably educated layman. There is none of the competitive one-upmanship often found in topical discussion shows.\n\nThis show is one of BBC Radio Four's flagship &quot;high-brow&quot; productions. If you haven't heard it before then try one of these episodes and see what you think. \n\nThis torrent includes all 42 episodes of In Our Time that were broadcast in 2007.\n\n\n\n\nNotes: \n\nThese are not radio recordings. With two exceptions, all audio files are the MP3 downloads that the BBC makes available for one week only. The exceptions are the William Wilberforce special (2007-02-22) which was never available as MP3; and the Madame Bovary episode (2007-07-05) which aired while I was moving house and without an internet connection. Both of these files were recorded from the RealAudio &quot;Listen Again&quot; stream and so the quality is lower than for other episodes.\n\nFrom the start of the 2007/08 season the BBC increased the bitrate of the MP3 downloads from 56 to 64kbps, hence the different bitrates in this torrent.\n\n\n\n\nProgrammes:\n\n2007-01-04 Borges - the life and work of Argentina's best loved short story writer\n2007-01-11 Mars - the search for life on the Red Planet\n2007-01-18 The Jesuits - the school masters of Europe\n2007-01-25 Archimedes - the Greek mathematician and his Eureka moments\n2007-02-01 Genghis Khan - founder of one of the world's largest ever land-based empires\n2007-02-08 Karl Popper - his ideas challenged our approach to the philosophy of science\n2007-02-15 Heart of Darkness - one of the most influential novels of the 20th century\n2007-02-22 William Wilberforce - the man and his legacy\n2007-03-01 The History of Optics - from telescopes to microscopes, a new way of seeing the world\n2007-03-08 Microbiology - the story of the invisible masters of the universe\n2007-03-15 Epistolary Literature - great novels of fictional letters\n2007-03-22 Bismarck - the Iron Chancellor\n2007-03-29 Anaesthetics - from ether frolics to pain-free surgery\n2007-04-05 St Hilda - the life and times of the Abbess of Whitby\n2007-04-12 Opium Wars - a conflict that was to affect British-Chinese relations for generations\n2007-04-19 Symmetry - the pattern at the heart of our physical world\n2007-04-26 Greek and Roman Love Poetry - the pursuit of the Beloved from Sappho to Catullus\n2007-05-03 Spinoza - believed that God and Nature were the same thing\n2007-05-10 Victorian Pessimism - fear and loathing in the late 19th century\n2007-05-17 Gravitational Waves - a new window on the universe\n2007-05-24 The Siege of Orleans - did Joan of Arc really rescue France?\n2007-05-31 Ockham's Razor - cutting medieval philosophy down to size\n2007-06-07 Siegfried Sassoon - the poet who survived\n2007-06-14 Renaissance Astrology - &quot;we are merely the stars' tennis balls, struck and bandied which way please them&quot;\n2007-06-21 Common Sense Philosophy - &quot;There is no statement so absurd that no philosopher will make it&quot;\n2007-06-28 The Permian-Triassic Boundary - when 95% of life was killed off\n2007-07-05 The Pilgrim Fathers - the original American dream\n2007-07-12 The Trial of Madame Bovary - &quot;Madame Bovary, c'est moi!&quot;\n2007-09-27 Socrates - the man and the myth\n2007-10-04 Antimatter - where has it all gone?\n2007-10-11 Divine Right of Kings - &quot;there's such divinity doth hedge a king&quot;\n2007-10-18 The Arabian Nights - the art of story-telling\n2007-10-25 Taste - the good, the bad and the ugly in 18th century Britain\n2007-11-01 Guilt - what is it good for?\n2007-11-08 Avicenna - wine, women and philosophy\n2007-11-15 The Discovery of Oxygen - feuds and revolutions at the birth of modern chemistry\n2007-11-22 The Prelude - the greatest poem in the English language?\n2007-11-29 The Fibonacci Sequence - the numbers in nature\n2007-12-06 Genetic Mutation - the error-strewn secrets of life\n2007-12-13 The Sassanian Empire - in the shadow of Ancient Persia\n2007-12-20 The Four Humours - yellow bile, blood, choler and phlegm in the original theory of everything\n2007-12-27 The Nicene Creed - when Christ became God\n\n\nDownload the latest episode from the BBC website: http://www.bbc.co.uk/radio4/history/inourtime/index.shtml\n","torrent":{"xt":"urn:btih:14f68e5a3599ba44189cfea7443facf48c6c35e1","amp;dn":"BBC+Radio+Documentary+-+In+our+Time+%28Complete+2007+Season%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14f68e5a3599ba44189cfea7443facf48c6c35e1","infoHashBuffer":{"type":"Buffer","data":[20,246,142,90,53,153,186,68,24,156,254,167,68,63,172,244,140,108,53,225]},"announce":[],"urlList":[]}}