{"title":"US Intelligence planned to destroy WikiLeaks","uid":5452805,"size":566624,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:158514b80eac988185af0f7d711a7acdc8ac71b5&amp;dn=US+Intelligence+planned+to+destroy+WikiLeaks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zzoob","files":1,"time":1269244810,"description":"From wikileaks.org:\n\n15. Mar. 2010: U.S. Intelligence planned to destroy WikiLeaks, 18 Mar 2008\n\nThis document is a classifed (SECRET/NOFORN) 32 page U.S. counterintelligence investigation into WikiLeaks. ``The possibility that current employees or moles within DoD or elsewhere in the U.S. government are providing sensitive or classified information to Wikileaks.org cannot be ruled out''. It concocts a plan to fatally marginalize the organization.\n\nSince WikiLeaks uses ``trust as a center of gravity by protecting the anonymity and identity of the insiders, leakers or whisteblowers'', the report recommends ``The identification, exposure, termination of employment, criminal prosecution, legal action against current or former insiders, leakers, or whistlblowers could potentially damage or destroy this center of gravity and deter others considering similar actions from using the Wikileaks.org Web site''. [As two years have passed since the date of the report, with no WikiLeaks' source exposed, it appears that this plan was ineffective].\n\nAs an odd justificaton for the plan, the report claims that ``Several foreign countries including China, Israel, North Korea, Russia, Vietnam, and Zimbabwe have denounced or blocked access to the Wikileaks.org website''. The report provides further justification by enumerating embarrassing stories broken by WikiLeaks---U.S. equipment expenditure in Iraq, probable U.S. violations of the Chemical Warfare Convention Treaty in Iraq, the battle over the Iraqi town of Fallujah and human rights violations at Guantanamo Bay.","torrent":{"xt":"urn:btih:158514b80eac988185af0f7d711a7acdc8ac71b5","amp;dn":"US+Intelligence+planned+to+destroy+WikiLeaks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158514b80eac988185af0f7d711a7acdc8ac71b5","infoHashBuffer":{"type":"Buffer","data":[21,133,20,184,14,172,152,129,133,175,15,125,113,26,122,205,200,172,113,181]},"announce":[],"urlList":[]}}