{"title":"Big Picture: Missile Man (US Army Movie)","uid":5981957,"size":1402166032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1753e2bd481469fbd8dd393f232f1bc23f09a237&amp;dn=Big+Picture%3A+Missile+Man+%28US+Army+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freehist2","files":1,"time":1290619303,"description":"&quot;THE BIG PICTURE&quot; covers training of the Army's missile man -- In this era of both missiles and missile men, THE BIG PICTURE covers training activities at three of the major centers in which the Army's missile men receive their highly specialized training. The United States Army, as almost everyone knows, is placing an ever-increasing emphasis on guided missiles, projectiles which can deliver deadly conventional or atomic warheads to enemy targets hundreds or even thousands of miles away. Perhaps the most remarkable fact about these amazing weapons is that they have all been developed in little more than a decade. The combination of nuclear weapons and guided missiles have, in a very real sense, revolutionized our concepts of warfare. Although the nation has entered a new era, it is not an era of &quot;push button&quot; warfare. For to function, one of these new weapons requires more soldiers, better-trained and more highly-skilled, than any other weapon in the history of war. &quot;Missile Man&quot; dramatically tells the story behind the training of these young men who are taking their places in tomorrow's Army. It is a picture dedicated to this new kind of soldier -- the Army Missile Man.\n\n","torrent":{"xt":"urn:btih:1753e2bd481469fbd8dd393f232f1bc23f09a237","amp;dn":"Big+Picture%3A+Missile+Man+%28US+Army+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1753e2bd481469fbd8dd393f232f1bc23f09a237","infoHashBuffer":{"type":"Buffer","data":[23,83,226,189,72,20,105,251,216,221,57,63,35,47,27,194,63,9,162,55]},"announce":[],"urlList":[]}}