{"title":"}Legends of the Old West - Joaquin Murietta (23 of 39) [1954] ( ","uid":4351240,"size":262123834,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1a48fd7beabe15043f301399cd4c8bbf6c25b2c0&amp;dn=%7DLegends+of+the+Old+West+-+Joaquin+Murietta+%2823+of+39%29+%5B1954%5D+%28+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alien99","files":1,"time":1219167056,"description":"legends of the west better known by\n\n\n&quot;Stories of the Century&quot; was a half hour series and appeared in first run syndication during the &amp;#039;54-&amp;#039;55 television season. It was also the first western TV series to win an Emmy award. Starring veteran western actor Jim Davis as railroad detective Matt Clark, the series set Clark and his fellow railroad detective partners (Mary Castle as Frankie Adams for the first half of the season and Kristine Miller as &quot;Jonesy&quot; during the second half)against historic western outlaws of various periods ranging from the mid-1860&amp;#039;s to the early 1900&amp;#039;s. The series was very satisfying, easy to watch, and fairly realistic due mainly to the easygoing charm of Jim Davis in the lead role. He seemed like an actual western character. One other note. When Matt Clark would arrive in town after a long ride he actually looked like he had been on a long horse ride as he would be covered in dust.\n\n\nWhat separated this show from its contemporaries and much of what came later was the professionalism invested in the action scenes. Ace action directer William Witney directed 30 episodes. Franklin Adreon the rest. Both filmed the action with polish. Republic&amp;#039;s vast store of stock footage from serials and B&amp;#039;s was utilized to give scope. The level of individual episodes rose or fell with the quality of the guest stars brought in to the play the outlaws. Among the really good ones were Marie Windsor as Belle Starr, Lee Van Cleef as Jesse James, Fess Parker as Grat Dalton, Jean Parker as Cattle Kate, and Joe Sawyer and Slim Pickins as Butch Cassady and &quot;The Smilin&amp;#039; Kid&quot;. The cream of the western up and comers, Pickins, Parker, Denver Pyle, James Best, and Richard Jaeckel, honed their craft. B veterans with decades of experience under their belts, Harry Woods, Glenn Strange, Kenneth MacDonald, Earle Hodgkins, Steve Darrell, and Chief Yowlachie, provided the old leather feel of vintage westerns.\n\n","torrent":{"xt":"urn:btih:1a48fd7beabe15043f301399cd4c8bbf6c25b2c0","amp;dn":"%7DLegends+of+the+Old+West+-+Joaquin+Murietta+%2823+of+39%29+%5B1954%5D+%28+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a48fd7beabe15043f301399cd4c8bbf6c25b2c0","infoHashBuffer":{"type":"Buffer","data":[26,72,253,123,234,190,21,4,63,48,19,153,205,76,139,191,108,37,178,192]},"announce":[],"urlList":[]}}