{"title":"Sense - A View From A Vulnerable Place","uid":4412934,"size":118248323,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2296483aafd26bc963d95763c17dd22f9624e0cb&amp;dn=Sense+-+A+View+From+A+Vulnerable+Place&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pierzor","files":10,"time":1222359425,"description":"Sense - A View From A Vulnerable Place\n\n\n\n\nLabel: Neo Ouija\nCatalog#: NEO 10 CD\nFormat: CD\nCountry: UK\nReleased: Jul 2001\nGenre: Electronic\nStyle: Leftfield, IDM, Downtempo, Ambient\nNotes: &quot;All Around Me&quot;, &quot;Ear Of The Behearer&quot; and &quot;Eb Ni Twein&quot; licensed from Aural Industries.\nRating:  4.5/5 (39 votes)\n\n\n\n\n\n\n\nTracklisting:\n1   Elran (9:15)\n2   Choice (6:34)\n3   Starwalk v2 (6:49)\n4   All Is You (6:23)\n5   All Around Me (6:11)\n6   5-5 (3:29)\n7   Ear Of The Behearer (6:18)\n8   Lament (6:22)\n9   View From Another Place (12:16)\n10   Eb Ni Twein (7:25)\n\n\n\n\nReview\nAuthor: Sutemos\nSense and his album just enslaved me, i havent holded such a unifrom album in my hands ever since. I cant say that monotony is the thing that goes all along the album. No Way! The album simply consists of calm, yearning and melancholic dream, which makes you leave all the bouts of anger (which a a favoured thing among IDM artists in order nobody would call them &quot;sweetassess&quot;) all the way behind. All the experiments wear off (which i liked sooo much), they are nothing but a facile sound symphony, ice-cold beat conceptions are not important. One thing only remains important - the sound and its introduction. Everything can be rated with the highest grades. When you press play you start hearing monotonic, killing melodies which actually drown you, thinly falling rain drops, rare rays of light... wide and colourful world. I close my eyes and start to paint, to create my own space in the same manner as the sense does it. It is a intimate diary which slowly drowns you into its world... A View From Vulnerable Place is not a temporary fancy - I am writing about year after it was released. It still sounds, it still will be sounding tomorrow, I am not hoping to stop and to drown only in his sound but competition is still too little to take it from me..\n\n\nsynctank\nAdam Raisbeck has humbly lingered in the backdrop for many years now, bearing several scattered compilation tracks and sparse e.p. releases. In addition to Sense, Raisbeck also records under his original alias Soulenoid, both projects demonstrating the fresh and inventive composing talents of this native Australian. Carefully building each track like it was his first, Adam efficiently captivates the listener, revealing song after song of soaring synths and calculated beats. Sorrowful strings utter contempt while grumbling basslines pace angrily in the background. The lengthy tracks all seem to regard time as an imposition, building vigilantly with intent and magnetism. &amp;#039;Elran&amp;#039; starts it off with a drunken tone and accommodating sneaky beats. An adjoining melody seeps through, fluttering among the translucent clicks and creaks. A playful tune skips adequately among stammering beats and soon bores into a dreamy harmony of parting strings on &amp;#039;Choice&amp;#039;. A dirty disco beat picks up the lingering lullaby while cutting bass riffs permeate the fragile wall of sound. Dusty creases mar the popping whisks of &amp;#039;Starwalk v2&amp;#039;, while tantalizing strings invade the struggling accord. &amp;#039;All of You&amp;#039; stutters along, joining uplifting melodies and delicate keyboard work. A dreamy atmosphere encompasses a light beat as multi-layered synths ascend gracefully around each other. &amp;#039;View From Another Place&amp;#039; rains heavy synths and popping percussion. Surges of epic tones seal the warm envelope that slowly wraps around you. A lonely melody murmurs in the backdrop, rescued only by a wincing arpeggiator dribbling down the tepid groove. With mournful tones and adjoining caves of noise, &amp;#039;Eb Ni Twein&amp;#039; floats freely, beckoning visits of resonance and hollow filtering before drifting out of ear-shot to leave you with your decision. This is an adventure, wonderful and mysterious, as experienced only through intent consideration and a nice pair of headphones. Lovely and inviting, cold and satisfying, &amp;#039;A View From a Vulnerable Place&amp;#039; might seem like a wonderful place to be.","torrent":{"xt":"urn:btih:2296483aafd26bc963d95763c17dd22f9624e0cb","amp;dn":"Sense+-+A+View+From+A+Vulnerable+Place","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2296483aafd26bc963d95763c17dd22f9624e0cb","infoHashBuffer":{"type":"Buffer","data":[34,150,72,58,175,210,107,201,99,217,87,99,193,125,210,47,150,36,224,203]},"announce":[],"urlList":[]}}