{"title":"Eriq La Salle - Martyr Maker Series #0.5-2 ~ Maraya21","uid":11580675,"size":11229327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:239f33bf3c7fe7e676ee2b3e920b708b9f4d795a&amp;dn=Eriq+La+Salle+-+Martyr+Maker+Series+%230.5-2+%7E+Maraya21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Maraya2020","files":-1,"time":1417123535,"description":"Eriq La Salle - Martyr Maker Series #0.5-2 ~ Maraya21\n &lt;a href=&quot;\nhttp://i.imgur.com/sONRxYi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/sONRxYi.jpg&lt;/a&gt;\n\nAuthors: Eriq La Salle\nFormats: EPUB, MOBI, PDF, AZW3, LIT\nTags: Literature &amp; Fiction, Thriller &amp; Suspense, Crime\nPublisher: 4 Clay Productions; 1st editions\nLanguage: English\n\n\nOverview:\n#0.5 - Laws of Innocence: The Prequel\n10-year-old Joaquin adored and worshiped his mother, his grandfather, and God. His life was blissfully sheltered and filled with love until the day he was tragically robbed of his innocence. All of New York would soon discover that vengeance and justice sometimes come from the most horrific and unlikeliest of sources.\n\n#1 - Laws of Depravity\nNew York City. Fall 2011. A priest is found murdered in the most gruesome of crime scenes. The brutal slaying is the work of &quot;The Martyr Maker,&quot; a serial killer that for the past 30 years has left behind a legacy of torture and fear. Every ten years, he butchers 12 clergymen in twisted scenes reflecting the martyrdom of Jesus and his disciples. Detective Cavanaugh, along with his partner and an F.B.I. agent know that they have very little time to catch this monster before he completes his final cycle of killing and disappears forever. But the investigation is made even more difficult when they discover that the seemingly unrelated clergymen are anything but the symbols of godliness they would have their community believe.\n\n#2 - Laws of Wrath\n&quot;Eriq La Salle's LAWS OF WRATH is all thriller; no filler--a white-knuckled treat.&quot; -- James Patterson\nChinatown, New York - The butchered body of a transvestite is found in a dumpster. Nothing out of the ordinary for NYPD, except the victim just so happens to be the brother of Detective Phee Freeman. At first the slaying looks like the random act of a vicious killer, but when it is discovered that there are similar ritualistic murders throughout the city, Phee and his partner Quincy Cavanaugh, along with FBI Agent Janet Maclin, have no choice but to join forces with Dr. Daria Zibik, a brilliant but deranged cult leader. With the clock running down and bodies piling up, Phee and his partners must do everything they can to stop the bloodshed and determine if the evil they are hunting and the psychopath they are trusting could actually be one in the same.?\n\n\nNote:   I bought these..\n\n\nPlease be aware that i want to seed 24h/d, however with a really old laptop, a connection of U:80.0 kB/s and multiple seeds \nsimultaneously my contribution will not be enough. Therefore, please seed what you leeched. Fair-Share\nEnjoy!                                    Maraya21","torrent":{"xt":"urn:btih:239f33bf3c7fe7e676ee2b3e920b708b9f4d795a","amp;dn":"Eriq+La+Salle+-+Martyr+Maker+Series+%230.5-2+%7E+Maraya21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"239f33bf3c7fe7e676ee2b3e920b708b9f4d795a","infoHashBuffer":{"type":"Buffer","data":[35,159,51,191,60,127,231,230,118,238,43,62,146,11,112,139,159,77,121,90]},"announce":[],"urlList":[]}}