{"title":"Richard Benson - Madre Tortura (1999)","uid":4356611,"size":37864378,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:254983b1e308f58ed85f28fb75410581c7a621eb&amp;dn=Richard+Benson+-+Madre+Tortura+%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"GoS360","files":7,"time":1219439816,"description":"L&amp;#039;album che mi accingo a recensire ÃƒÂ¨ sicuramente meritevole d&amp;#039;attenzione vista la natura quantomeno bizzarra e paradossale del suo autore: Richard Benson. Per molti questo nome risulterÃƒÂ  sconosciuto, altri forse lo avranno sentito abbinato allo spettacolo piuttosto che a contesti musicali. Ebbene occorre fare una premessa sull&amp;#039;artista in questione prima di avventuraci ad esaminare la sua ultima fatica. Richard Benson (vero nome Riccardo Bensoni) ÃƒÂ¨ artista a tutto tondo: chitarrista, cantante, attore, doppiatore televisivo, intrattenitore, presentatore e critico in una trasmissione musicale su di una piccola emittente romana. La peculiaritÃƒÂ  intrinseca nel suo essere poliedrico ÃƒÂ¨ data dalla costante scarsezza di risultati che riesce ad ottenere in ognuna delle branche intraprese. In questa sede ci soffermeremo principalmente sul suo aspetto musicale ed, appunto, sul suo ultimo album : Madre Tortura. La title track si presenta come una ripetitiva e piuttosto sterile canzone di critica alla religione ed alla corruzione ecclesiastica. Benson qui si limita a cantare su di una base o poco piÃƒÂ¹, scandendo i suoi testi imitando palesemente il timbro di Renato Zero. Unica nota positiva in questa traccia ÃƒÂ¨ la recitazione dell&amp;#039;autore ( decisamente di stampo teatrale) e un riff di tastiera cupo e malinconico piuttosto azzeccato. Appena perÃƒÂ² Benson tenta l&amp;#039;assolo ci si accorge della sua estrema approssimazione come esecutore: scale sbagliate, sbavature, ritmiche non rispettate, suoni indesiderati pioveranno tra un arpeggio e l&amp;#039;altro per un&amp;#039;interminabile nenia di nove minuti e trentatrÃƒÂ¨ secondi. Seconda traccia: Benson si cimenta in un Blues dal titolo &quot;C&amp;#039;ÃƒÂ¨ ancora un colore nella notte&quot;. Sarebbe scorretto criticare a priori il suo tentativo di percorrere questa via: si nota infatti una certa intuizione nel trasporto che riesce a creare per pochi istanti grazie ad alcune sequenze piuttosto comuni ma gradevoli, prorogativa di questo genere musicale. La speranza svanisce quando Benson inserisce fiumi di note (di cui molte indistinguibili e fuori contesto), imitando in pessima maniera i &quot;blues&quot; con contaminazioni neoclassiche di Malmsteen. A questo punto si fa necessaria una ulteriore precisazione sulla tecnica di questo chitarrista. Per raggiungere un&amp;#039;elevata velocitÃƒÂ , Benson si dichiara inventore di un metodo di plettraggio ( mai opportunamente spiegato nei suoi video didattici) dal nome &quot;pick fall&quot; ( tradotto con : caduta del plettro). Dietro i suoi confusi e sconclusionati assoli troviamo quindi questa tecnica che consente rapiditÃƒÂ  a discapito della precisione. La terza traccia &quot; Gerarchie Inferali&quot; ÃƒÂ¨ forse quella in cui l&amp;#039;artista dimostra maggiore padronanza e sicurezza: si tratta in fatti di una brano da lui recitato in totale assenza di musica. Si nota subito una grande attenzione ai testi ( si tratta di una poesia di denuncia contro religione e ipocrisia in senso lato. Tuttavia, la natura ermetica delle sue parole lascia grandi dubbi su quale fosse l&amp;#039;intento principale, oltre allo shockare l&amp;#039;ascoltatore). Dopo questo inconsueto interludio eccoci ritornarnare nel vivo dell&amp;#039;opera di Benson: quarta traccia dal titolo &quot;Adagio in Re&quot;. Qui abbiamo la prova tangibile che il chitarrista ha serie difficoltÃƒÂ  anche a suonare mantenendo ritmiche elementari, che nulla hanno a che vedere col metal progressive che tanto spesso asserisce di suonare. La natura cacofonica del brano fa pensare a un chitarrista alle prime armi, non certo a un veterano sulla soglia dei quarant&amp;#039;anni con svariati video didattici alle spalle. Il riff orecchiabile viene eseguito spesso male e mascherato dalla velocitÃƒÂ  di un impacciato &quot;pick fall&quot; ( anche qui sporcature a profusione e suoni indesiderati guarniscono la banalitÃƒÂ  del pezzo, ancora una volta eccesivamente prolisso e ripetitivo). Le tracce cinque, sei e sette sono a mio avviso una dichiarazione di superbia e autocompiacimento nonchÃƒÂ¨ riempitivo dell&amp;#039;album: si tratta infatti di basi delle prime tre canzoni per suonare i brani di Benson , come se questi avesse realmente qualcosa da insegnare a dei chitarristi alle prime armi. Un album meno che mediocre, che dedica tuttavia una certa attenzione ai testi ed alla loro recitazione. Un&amp;#039;esecuzione pessima e qualche timida idea (anche se spesso banale ed non sviluppata oltre la mera intuizione) non giustificano a mio avviso l&amp;#039;acquisto di questo scarso prodotto.\n\nfonte: www.truemetal.it\n\n","torrent":{"xt":"urn:btih:254983b1e308f58ed85f28fb75410581c7a621eb","amp;dn":"Richard+Benson+-+Madre+Tortura+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254983b1e308f58ed85f28fb75410581c7a621eb","infoHashBuffer":{"type":"Buffer","data":[37,73,131,177,227,8,245,142,216,95,40,251,117,65,5,129,199,166,33,235]},"announce":[],"urlList":[]}}