{"title":"[DVD5 ITA-JAP] Full Metal Alchemist -Deluxe Edition 9-12[CR-Bt]","uid":4812037,"size":4674082816,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:265b6584dda5558cdc01d5bfbc9c801cb0671b59&amp;dn=%5BDVD5+ITA-JAP%5D+Full+Metal+Alchemist+-Deluxe+Edition+9-12%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CR-Bt","files":22,"time":1238372510,"description":"Edward e Alphonse finiscono in un villaggio maledetto da una strana malattia che sta lentamente pietrificando tutti gli abitanti. Un giovane medico riesce a stento a curare i suoi concittadini grazie ad una falsa Pietra Filosofale lasciatagli anni prima da Lust, ma che ora ÃƒÂ¨ ormai finita. Subito dopo i fratelli Elric iniziano a indagare su Ishbar per capire cosa successe veramente durante la guerra civile che portÃƒÂ² alla distruzione della cittÃƒÂ . Nel frattempo Winry viene a sapere la veritÃƒÂ  sulla morte dei suoi genitori e per saperne di piÃƒÂ¹ torna a Central City: qui, insieme a Sheska, si mette in una situazione pericolosa quando scopre un terribile segreto di uno dei piÃƒÂ¹ importanti membri dell'esercito!\n\nMaggiori info su http://colombo-reloaded.org\n\nAfter losing their mother, Alphonse and Edward Elric attempt to bring her back using the forbidden science of human alchemy. However, alchemy operates on the theory of equivalent trade, and breaking the human alchemy taboo carries a heavy price. Ed loses his leg, and Al loses his body. Ed is able to seal Al's soul inside of a huge suit of armor, at the cost of his arm. Years later, Ed (now with two mechanical limbs) and Al (still trapped in the armor) leave their childhood home, each brother concerned with the other's happiness. Ed, who has a natural talent and skill for alchemy, becomes nationally certified and is soon known everywhere as the &quot;Fullmetal Alchemist.&quot; Their true objective is to search for any information on the fabled Philosopher's Stone, hoping it will allow them to regain their old bodies. All of their hopes rest with this mythical stone, which may not even exist at all. However, the brothers soon learn that they are not the only ones after the powerful stone.\n\nMore info at http://colombo-reloaded.org","torrent":{"xt":"urn:btih:265b6584dda5558cdc01d5bfbc9c801cb0671b59","amp;dn":"%5BDVD5+ITA-JAP%5D+Full+Metal+Alchemist+-Deluxe+Edition+9-12%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"265b6584dda5558cdc01d5bfbc9c801cb0671b59","infoHashBuffer":{"type":"Buffer","data":[38,91,101,132,221,165,85,140,220,1,213,191,188,156,128,28,176,103,27,89]},"announce":[],"urlList":[]}}