{"title":"Rob-B-Hood (2006) Jackie Chan [VCD-RMVB] Chinese","uid":3532548,"size":403145266,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:278320a9e95d6f73f653f3227b70974442c6ee33&amp;dn=Rob-B-Hood+%282006%29+Jackie+Chan+%5BVCD-RMVB%5D+Chinese&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freeprogram","files":2,"time":1159789552,"description":"language: Chinese\nTexted Language: Chinese\n\nFor never-do-well compulsive gambler Slipper (Jacky Chan), there&amp;#039;s only one thing more fearsome than debtors at his doorstep-having to coax a crying baby. But what if the baby becomes his golden goose to fend off his debtors? Can he overcome his phobia of diapers, milk bottles and cloying lullabies?\n\nBrought up in impoverished family, and kicked out of school in his teens, Slipper found himself on the wrong side of the track despite being nimble-footed and neat-figured. Spurned by his family and hounded by debtors, he is goaded by his greedy landlord (Michael Hui) to collaborate in harebrained heists. Together with the agile and opportunistic Octopus (Louis Koo), the trio kidnaps BB, the grandson of a tycoon. However, due to some unexpected glitches, they fail to hand him over to the triads as planned.\n\nWith the assistance of an angelic nurse Melody (Gao Yuanyuan), the landlord&amp;#039;s baby-crazy wife (Teresa Carpio), and Octopus&amp;#039; teenage fan Pak Yin (Charlene Choi), the macho men discover the joys of &quot;Rob-B-Hood&quot;. When they realize that the triad is after both the ransom and BB&amp;#039;s life, they decide to make their hostage their protogee. Cornered by cops and threatened by ferocious gangsters, this trio of incorrigible merrymen embarks on a hair-raisingly dangerous and deliriously funny escapade to put BB safely back in his cradle.","torrent":{"xt":"urn:btih:278320a9e95d6f73f653f3227b70974442c6ee33","amp;dn":"Rob-B-Hood+%282006%29+Jackie+Chan+%5BVCD-RMVB%5D+Chinese","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"278320a9e95d6f73f653f3227b70974442c6ee33","infoHashBuffer":{"type":"Buffer","data":[39,131,32,169,233,93,111,115,246,83,243,34,123,112,151,68,66,198,238,51]},"announce":[],"urlList":[]}}