{"title":"All In with Chris Hayes 10-28-13.mp4","uid":9118981,"size":161106145,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2951529aa2f510b425e277422ddb270f0b78d530&amp;dn=All+In+with+Chris+Hayes+10-28-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1383087876,"description":"All In with Chris Hayes; October 28th, 2013.\n\nTo understand what's wrong with U.S. politics right now, look no further than South Carolina Senator Lindsey Graham's threat of gridlock unless his conspiracy theory demands are met. Graham said on Fox News Monday morning he plans to block every single presidential nomination requiring Senate approval until the survivors of last year's attack on the U.S. consulate in Benghazi are brought in front of Congress for questioning. David Brock, Founder of Media Matters for America, John Judis, Senior Editor at The New Republic, and Tim Pawlenty, former Governor of Minnesota and 2012 Republican presidential candidate, joined Chris Hayes to discuss how Senator Graham's temper tantrum could lead to miniature government shutdown.\n\nLorella Praeli, Director of Advocacy and Policy for United We Dream, also joined Chris Hayes to talk about Senator Marco Rubio's about-face on comprehensive immigration reform. Once the leading Republican voice on reform, Rubio has declared the bill he helped write and pass earlier this year dead on arrival.\n\nLater, Hayes discussed the dangers of losing control of intelligence gathering in light of reports that President Obama didn't know the NSA was spying on 35 world leaders.\n\nThen, Click 3.\n\nPlus: Jonathan Cohn, Senior Editor at The New Republic, Nancy Metcalf, Senior Editor at Consumer Reports, and Dr. Manisha Sharma, Medical Director at Evergreen Health Care and National Co-Director of Educator Training at Doctors for America, joined the table to talk about a new round of Obamacare fear-mongering. ","torrent":{"xt":"urn:btih:2951529aa2f510b425e277422ddb270f0b78d530","amp;dn":"All+In+with+Chris+Hayes+10-28-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2951529aa2f510b425e277422ddb270f0b78d530","infoHashBuffer":{"type":"Buffer","data":[41,81,82,154,162,245,16,180,37,226,119,66,45,219,39,15,11,120,213,48]},"announce":[],"urlList":[]}}