{"title":"Mayoko v1.12 Best Rapidshare Search Engine (Updated)","uid":4339207,"size":1908119,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2b7fb8b45d17bb5ae07dc3f604ea93282f556c34&amp;dn=Mayoko+v1.12+Best+Rapidshare+Search+Engine+%28Updated%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"scarless2","files":1,"time":1218493859,"description":"Welcome to the world&amp;#039;s largest file search engine!\nIf you have ever searched for, sent or received any files online, you&amp;#039;ve probably heard of RapidShare - the world&amp;#039;s premium site for uploading files. Literally millions of files are uploaded to RapidShare every day; from photos and movies, to music albums, to software packages. But there is onlyne one problem... RapidShare doesn&amp;#039;t allow you to search their files. So if you are looking for something specific, you don&amp;#039;t know where to go.\n\nAnd here&amp;#039;s our solution!\nWe have built a sophisticated software that locates RapidShare file links on the Web and allows you to search for them. Your only task is to enter your keywords, such as movie title, actress name, song or album title, and so on. Our software will browse through the Web looking for RapidShare links with your keywords in the title or description, and will present you a comprehensive list with results.\n\nThe whole RapidShare world - at your fingertips...\nOur software allows you to search the 3.5 Petabytes (yes, that&amp;#039;s 3,500,000,000,000,000 bytes!) of files that are stored on RapidShare servers. From now on, whatever file you want to find, you&amp;#039;ll get it there.\n\nCopyright information\nRapidShare is a registered trademark of RapidShare AG. This website is not affiliated with or endorsed by RapidShare AG\n\nNote: Previous versions 1.1.0 and 1.1.1 have ceased to work using the accompanying kegen due to the updated release. This .rar file packed by myself contains version 1.1.2 and a 100% working keygen. You must uninstall completely any previous Mayoko version before installing this one. Remember to remove registrey entrey also.","torrent":{"xt":"urn:btih:2b7fb8b45d17bb5ae07dc3f604ea93282f556c34","amp;dn":"Mayoko+v1.12+Best+Rapidshare+Search+Engine+%28Updated%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b7fb8b45d17bb5ae07dc3f604ea93282f556c34","infoHashBuffer":{"type":"Buffer","data":[43,127,184,180,93,23,187,90,224,125,195,246,4,234,147,40,47,85,108,52]},"announce":[],"urlList":[]}}