{"title":"Upbeat - June 1997 (gnv64)","uid":10625288,"size":29985780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30494759002afd053f9f798d430e2f267f729aac&amp;dn=Upbeat+-+June+1997+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":-1,"time":1406219258,"description":"Upbeat - June 1997\nEnglish | PDF | 58 pages | 26.8 mb\n\nThis is a monthly Indian entertainment magazine with stress on music. Its no longer in publication. I am sharing here one of the many old issues that are in my possession.\n\n12 SPECIAL FEATURE\nAfter a harrowing press conference following the disastrous match with Argentina's Gaston Etlis, in the Gold Flake Open Tennis Tournament in Chennai one would have little expected Leander Paes to sit down for chatty conversation with' UPBEAT.Â·But he did just that as he was raring to play the tournament, with the fire in his eyes not even a trifle faded, his hopes were high on the doubles match he was to play with India's Mahesh Bhupathi. And win he did the qold flake Open Doubles Title.\n\n20 COVER STORY\nOne of the hottest icons of non-filmi Hindi pop music, Anaida, is once again making a lot of 'Halla Hoo' with her new album '0 Malu Malu', which promises to set the Arabian deserts on fire as well as bust the Indian charts. Ever since she splashed the Indian pop scene three years ago, this exotic girl of Greek and Iranian parentage who has made India her home,'has been chuming out one album after another. It has been singing, singing all the way for Anaida wha.t with her albums and her non-stop live shows throughout the year. SO far she has done 70 shows in India as well as abroad in places like U.A.E., Sri Lanka and soon in Singapore.\n\n28 MUSIC SCENE\nSpice Girls are the rage all over Britain. They continue to top the UK singles and UK albums charts for the fifth time in their still-young career. 'Mama/who Do You ThinkYou Are' steals. a third week at the top of the singles chart. Meanwhile their 'Spice' album (HMV) increases its sales for the fourth week in a\nrow. Spice Girls sold twice as many copies as the number two album, the Bee Gees' 'Still Waters'. Read about them.\n\n57 SPOTLIGHT\nFeatured in this column is an interview with Shaan who has just released his solo album called 'Love-Ology' under the Magnasound label. Shaan, has been a very popular face on television and concert circuit ever since he released his first album 'Naujawan' with his sister Sagarika. The album which is all about love and consists of 8 tracks is targeted at all the youngsters. Shaan talks about the album, the Hindi pop scene, his future plans and much more with UPBEAT.\n\nPLUS\nLetters 1\nQuiz 4\nAsk Your Counsellor 6\nComputer Education  8\nSex Education  10\nLighter Side 17\nDale's Notebook 18\nBookshelf 25\nGlad Rags 28\nLyrics 40\nNew Albums 42\nCulturallY Yours 46\nIn The News 52\nVideowatch 54\nReaders Page\nGraffiti\nCrossed Vibes\nSound ","torrent":{"xt":"urn:btih:30494759002afd053f9f798d430e2f267f729aac","amp;dn":"Upbeat+-+June+1997+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30494759002afd053f9f798d430e2f267f729aac","infoHashBuffer":{"type":"Buffer","data":[48,73,71,89,0,42,253,5,63,159,121,141,67,14,47,38,127,114,154,172]},"announce":[],"urlList":[]}}