{"title":"2 Fast 2 Furious [2003] DVDRip","uid":5225735,"size":498532660,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3179bfbf27ace5a5a4d66effe81d9585768ffb66&amp;dn=2+Fast+2+Furious+%5B2003%5D+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Raymond-ryche","files":-1,"time":1261110548,"description":"2 Fast 2 Furious [2003] DVDRip\n\nBrian O'Conner, the disgraced cop from the first film, is on the run because he let Dominic Toretto escape. He goes to Miami to start a new life. Here he makes new friends with Tej Parker, an ex-street racer, and Jimmy, a well-known car tuner as well as Suki, also a street racer. O'Conner is now known by his street name &quot;Bullitt&quot;, and rules the streets with his Nissan Skyline, much like Toretto in the first film. He competes with fellow street racers in high stakes races to win money using the skills he learned as a member of Toretto's now disbanded team.\nOne night after winning a race, he is caught by U.S. Customs agents after his car is disabled by the fictional harpoon-like ESD (Electronic Disruption Device) that is deployed by Agent Markham. He is arrested and his former boss FBI Agent Bilkins makes a deal with him saying that if he accepts to take part in a mission, his criminal record will be wiped clean.\n\nO'Conner and Bilkins then travel to Barstow, California where O'Conner proposes the deal to his childhood friend and ex-con Roman Pearce. Together their mission involves working undercover as street racers for a South American (Argentine) drug lord - Carter Verone, with help from Monica Fuentes, a voluptuous undercover U.S. Customs agent who liaisons as Carter's love interest. They win a highly charged &quot;audition&quot; race and strike a deal with Verone.\nThis leads to several scuffs and car sequences throughout the film, along with car races. O'Conner and Pearce begin to realize the major trouble they are in and ask Tej to arrange a race for &quot;pink slips&quot; with two of the racers from the audition race earlier in the film; O'Conner and Pearce win Korpi's 1969 Yenko Camaro and Darden's 1970 Challenger R/T.\n\nLater on that night O'Conner and Pearce arrive at Verone's nightclub so Verone can torture a police detective named Whitworth into creating a &quot;15-minute window&quot; to keep the local police away from O'Conner and Pearce so they may transport the money. He uses a rat trapped in a heated container to scrape him. The next morning they embark on the mission in their Mitsubishis with Verone's money in the trunks and two of his henchmen riding along. During the transportation of Verone's money, Detective Whitworth decides to call in the army of police units he has waiting nearby. During the chase they lead the police to a warehouse complex. The police surround the front of the garage area so O'Conner's and Pearce's street racer friends create a &quot;scramble&quot; diversion allowing O'Conner and Pearce to sneak away in the Camaro and Challenger to continue their mission and Brian allow Tej to drive his Evo 7 and allow Suki to drive Roman's Mitsubishi Eclipse Spyder.\n\nFirst to be driven out from the garage were film Dodge Rams to ram the police cars, then dozens of cars, including O'Conner and Pearce. O'Conner drives in the Yenko Camaro he won in the race, and Pearce in the Challenger RT. As they approach their destination, Pearce rids himself of one of Verone's henchman by activating a home made ejector seat made with a bottle of nitrous oxide. When the henchman riding with Brian tells of a change in destination, Brian makes a fatal slip-up and reveals himself and Monica as undercovers. Verone tells the henchman to execute Brian, but Pearce saves him at the last second. Verone tries to escape aboard his yacht after informing Monica that he knew she was an undercover U.S. Customs agent. While aboard the yacht he scolds her on her slip-up for informing U.S. Customs agents about Verone's intention to flee the country via a secluded airfield. The finale occurs with O'Conner's Camaro jumping off of a nearby ramp and landing on the top of the yacht to save Monica. At the end Verone is arrested and the duffel bags carrying his drug money are recovered by the FBI, save for an undisclosed amount secretly stolen by Pearce. Brian surprisingly shows Pearce that he himself has stolen some of the money and then Pearce does the same. Pearce decides to stay in Miami with Brian and the latter suggests opening a garage with the stolen money.\n\nPLEASE SEED, Thanks.","torrent":{"xt":"urn:btih:3179bfbf27ace5a5a4d66effe81d9585768ffb66","amp;dn":"2+Fast+2+Furious+%5B2003%5D+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3179bfbf27ace5a5a4d66effe81d9585768ffb66","infoHashBuffer":{"type":"Buffer","data":[49,121,191,191,39,172,229,165,164,214,110,255,232,29,149,133,118,143,251,102]},"announce":[],"urlList":[]}}