{"title":"PSP SNES9XTYL0.4.2ME LATEST VERSION COMPLETE (U) [!] ROMSET","uid":4664837,"size":698773948,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:317dfa5404c6811ec022a170285750bc50fb04e7&amp;dn=PSP+SNES9XTYL0.4.2ME+LATEST+VERSION+COMPLETE+%28U%29+%5B%21%5D+ROMSET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"B2K24","files":941,"time":1232530411,"description":"Here is the latest SNES9X for PSP\nto run on PSP put folder in PSP/GAME\n\nEVERYTHINGS READY SETUP TO PLAY JUST DRAG AND DROP\n\nOK I FIGURED OUT THE PROBLEM\nTHE FOLDER HAS TO BE RENAMED\nTHE PSP DOESEN'T LIKE (U) [!] SO IT SHOWS CORRUPTED DATA\n\nSIMPLY RENAME THE FOLDER TO SNES9X OR W/E WHEN YOU PUT ON YOUR STICK IN PSP GAME.\n\nSORRY ABOUT THIS.\n\nWhats special about this torrent is the romset included\nI extracted only the good verified dumps (U) [!] from\ngoodSNES 2.0.4 GoodMerged then zipped the good dumps at BEST\ncompression using WinRar all manually at my PC so was sure not to miss any relying on some program. Damn im glad it's finished.\n\nI hope all enjoy this work and people will say this is the best SNES romset ever\n\nI also included the best jap to english translations roms about 20 or so\nplus EVERY RETAIL USA SUPER NINTENDO GAME RELEASED.\nwhich is over 750+ games.\n\nUnfortunately the emulator crashes when there's over 500+ roms in a folder so I had to make ROM1 and ROM2 folders so games can be launched without freezing/crashing the emulator.\nBy pressing triangle after LOAD ROM option you can point to either folder and load what you wish to.\n\nOH yeah there's cheats for some games also\n\n--------------- CHEATS------------------\nDepending on game person is running, once it's launched, press home and hit left or right arrow pad a few times\nyou will see a cheat option. I have named all the codes so you can easily see what effect it has on the game.\nIf the codes are enabled but don't seem to be working the trick is to toggle the option disable all codes option then,\npress X to go back in the game this &quot;refreshes&quot; things then press home and choose enable all codes or pick some that you like\nand they will work.\n\nFor EX chrono trigger has get level 99 after 1 battle, all weapons, all items, all techs, many other codes which make it alot of fun.\nOr if you don't wanna cheat simply disable them all and play legit.\n\nI hope everyone enjoys this work. Leave comments or questions and I will answer them HAVE FUN","torrent":{"xt":"urn:btih:317dfa5404c6811ec022a170285750bc50fb04e7","amp;dn":"PSP+SNES9XTYL0.4.2ME+LATEST+VERSION+COMPLETE+%28U%29+%5B%21%5D+ROMSET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"317dfa5404c6811ec022a170285750bc50fb04e7","infoHashBuffer":{"type":"Buffer","data":[49,125,250,84,4,198,129,30,192,34,161,112,40,87,80,188,80,251,4,231]},"announce":[],"urlList":[]}}