{"title":"In Thru The Back Door 5 [2008] - Shyla Stylez, anal","uid":4579075,"size":1466318715,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:35abdc00ec1cf239e9153324b62f11d98126d0a8&amp;dn=In+Thru+The+Back+Door+5+%5B2008%5D+-+Shyla+Stylez%2C+anal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"h0tspurred","files":4,"time":1229348715,"description":"In.Thru.The.Back.Door.5.XXX.DVDRip.XviD-NYMPHO\n\n\n\nscreens CD1 &amp; CD2 + DVD-covers:\n &lt;a href=&quot;\nhttp://pixxtpb.blogbugs.org/4416124/In-Thru-The-Back-Door-Vol.-5---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxtpb.blogbugs.org/4416124/In-Thru-The-Back-Door-Vol.-5---screens.html&lt;/a&gt;\n\n\n\n\n\nStarring:  \t \nAriel Summers, Charlotte Vale, Mina Leigh, Mya Nichole, Shyla Stylez\n\n\n\n   \nStory\nEver since AVN award winning director VINCE VOUYER captured one of SASHA GREY's first anal scenes two years ago for the original IN THRU THE BACK DOOR, this series has showcased some of the industry's finest talent in high-end scenes of sheer ass-obsession!\nThe latest installment, IN THRU THE BACK DOOR #5, continues Vouyer's proud tradition, showcasing four-time AVN nominee SHYLA STYLEZ in a fresh anal pounding that's certain become one of her most talked-about scenes! Black-haired MINA LEIGH delivers ample back up, letting Ralph Long and Pauly Harker take turns banging her ass right up to an explosive finish.\nNorthern California beauty CHARLOTTE VALE delivers another highlight, teaming up with Steven French for a nasty backdoor encounter featuring scads of nasty ATM action. Deep from the heart of Texas, cute blonde ARIEL SUMMERS turns in a rocking scene with Anthony Rosano. Not only is this a rare chance to see Ariel take it up the ass, but it was one of the last things she shot before going back to doing girls only.\nUltra-exotic MYA NICHOLE wraps things up nicely with Mike Adriano in a scene replete with passion, romantic kissing and some serious anal gaping. This scene is a stunner, with Mya's beautiful eyes lighting up with electricity with every long, deep pump inside her tight little tan ass!\nRevealing behind-the scenes action, an all-new bonus scene, and sexy cutting room floor footage combine to make IN THRU THE BACK DOOR #5 a three-hour marathon of high-octane anal sex you simply can't afford to miss.\n\n\t\nDirector: \tVonce Vouyer\nLanguage: \tEnglish \nStudio: \tVouyer Media\nSeries: \tIn Thru The Back Door\nRelease Date: \t12/09/2008\nGenre: \t        Anal, Busty (Big Breast) Nice Ass, Pretty Face, Doggy Style, Threesome, Beautiful Breast, Beautiful Pussy\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:35abdc00ec1cf239e9153324b62f11d98126d0a8","amp;dn":"In+Thru+The+Back+Door+5+%5B2008%5D+-+Shyla+Stylez%2C+anal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35abdc00ec1cf239e9153324b62f11d98126d0a8","infoHashBuffer":{"type":"Buffer","data":[53,171,220,0,236,28,242,57,233,21,51,36,182,47,17,217,129,38,208,168]},"announce":[],"urlList":[]}}