{"title":"undateable.s01e03.hour.3","uid":5631749,"size":367799596,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3a56c0451caef030f9c8e329ff54858dbf2f6fb7&amp;dn=undateable.s01e03.hour.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1276712575,"description":" &lt;a href=&quot; http://www.vh1.com/shows/undateable/series.jhtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.vh1.com/shows/undateable/series.jhtml&lt;/a&gt;\n\nThe show will take a fun look at the top 100 things guys do that make them Undateable.\n\n---\nDo you own more Ed Hardy clothing than Jon Gosselin? Do you proudly sport a mullet and explain to people the haircut as &quot;Business in the front and a party in the back&quot;? Have you been known to refer to your penis by a nickname? If you answered 'Yes' to any of these questions, you just might be Undateable\n\nUndateable is a new five-hour VH1 special airing over five nights which looks at all things men do wrong in the eyes of the opposite sex. The series is based on the book &quot;Undateable: 311 Things Guys Do That Guarantee They Won't be Dating or Having Sex&quot; written by Ellen Rakieten and Anne Coyle. Ellen Rakieten spent the last 23 years as a key force in creating The Oprah Winfrey Show and Anne Coyle is an award-winning advertising copywriter and owner of a nationally acclaimed interior design firm. The show will take a fun look at the top 100 things guys do that make them Undateable.\n\nUndateable shows men how to avoid wearing the wrong things, doing the wrong things, and of course, saying the wrong things that are all instant warning signs to women. Undateable will be invaluable in helping to teach men about their mistakes and women about what indiscretions are just &quot;Red Flags&quot; and which are the absolute &quot;Kiss of Death&quot;.\n\nCommenting and helping us sort through all things Undateable are stars like Bret Michaels, Nick Cannon, Ray J, Selita Banks, and the cast of Jersey Shore-- plus musical artists such as Morningwood, Fantasia, Kelly Rowland, and Brandy. Comedians, dating gurus, and fashion stylists also weigh in on what not to do, say, or wear.\n\nAmong the offenses discussed . . .\n\n&quot;JORTS... A.K.A. jean shorts... Committing this fashion affront will guarantee you many lonely nights\n&quot;LEATHER PANTS... Want to get in her pants? Then make sure yours aren't leather!\n&quot;&quot;STAR WARS&quot;... You're not trying to date Yoda, so spare her your profound knowledge of the ways of &quot;The Force&quot;\n&quot;&quot;BONER&quot;, &quot;Stiffy&quot;, &quot;Pitch a tent&quot;, etc... She'll know if you're excited, no need to give her a play-by-play\n&quot;&quot;GOING DUTCH&quot;... Offer to &quot;Go Dutch&quot; on the first date and you'll be going alone on your second.\n&quot;SPEEDO... Are you competing in a 200-meter freestyle medley? If not, leave the banana hammock at home.\n&quot;PLAY AIR GUITAR... Spend a lot of time playing air guitar and you will spend a lot of time having air sex with your air girlfriend.\n&quot;WINE-IN-A-BOX... Juice in a box-- awesome for kids; wine in a box is awesome for no one.\n&quot;THE BEN FRANKLIN (Bald on top, hair on sides)... Not all of Ben Franklin's inventions were genius.\n&quot;MOOBS, A.K.A &quot;Man Boobs&quot;... Pretty simple: She should be the one with the boobs.\n&quot;GIRLIE DRINKS... Cosmo, Appletini, etc... Does that drink come with a free pap smear? Be a man and order a real drink!\n&quot;MANDALS with SOCKS... There's a time and a place for everything-- except mandals with socks.\n\nSo put away the Bluetooth, shave that goatee, put the dad jeans in the closet and join VH1 to learn about the things men do that make them UNDATEABLE!!!\n---\t\t","torrent":{"xt":"urn:btih:3a56c0451caef030f9c8e329ff54858dbf2f6fb7","amp;dn":"undateable.s01e03.hour.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a56c0451caef030f9c8e329ff54858dbf2f6fb7","infoHashBuffer":{"type":"Buffer","data":[58,86,192,69,28,174,240,48,249,200,227,41,255,84,133,141,191,47,111,183]},"announce":[],"urlList":[]}}