{"title":"Home Plan Pro v5.2.18.17","uid":5206535,"size":3768018,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3b437c12d577210854a570ad663cde209af09b3a&amp;dn=Home+Plan+Pro+v5.2.18.17&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"google_Hell","files":4,"time":1260396224,"description":"Home Plan Pro is designed to quickly and easily draw high quality floor plans, site plans, and architectural designs. Home Plan Pro provides a full array of graphic tool buttons to let you easily pick a tool or action. Once you choose a tool, Home Plan Pro tells you how to use it. You may use the mouse or keyboard, or both, to create your plan. Home Plan Pro gives you many choices for printing your plans. You may select a specific scale, or elect to have your plan printed at the largest size that will fit on the paper you select. While there are a number of impressive and powerful CAD programs available, they are more difficult to learn and use than Home Plan Pro. To preserve its intuitive ease of use and low cost, Home Plan Pro is not designed to compete with full-fledged CAD programs.\n\nFeatures:\n You can begin using Home Plan Pro effectively within minutes\n Easy to use; work progresses swiftly\n The integrated on-line help assures quick answers to any questions that arise\n You can use the built-in fax driver to fax your plans anywhere in the world\n Attach plans to email messages and send them with the built-in email server\n Export plans to DXF or bitmap files\n Easily draw arcs, rectangles, circles, lines, and so forth\n Use the mouse, keyboard, or a combination of both\n Add scaled dimensions with two clicks\n Insert doors and windows with equal ease\n Zoom in or out with a click to work on detailed parts of the plan or to see the whole of it\n Create Layers that you can make invisible or visible at a click\n Draw a plot plan using metes &amp; bounds\n Adjust thickness with a couple of clicks\n Set the frame spacing with a click\n Automatically fill walls with studs or a floor with joists\n Cover walls with any of dozens of patterns or solid colors\n Rotate and resize any figure with the mouse\n Insert BMP,GIF,WMF,ICO,JPG images","torrent":{"xt":"urn:btih:3b437c12d577210854a570ad663cde209af09b3a","amp;dn":"Home+Plan+Pro+v5.2.18.17","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b437c12d577210854a570ad663cde209af09b3a","infoHashBuffer":{"type":"Buffer","data":[59,67,124,18,213,119,33,8,84,165,112,173,102,60,222,32,154,240,155,58]},"announce":[],"urlList":[]}}