{"title":"Los Abrazos Rotos TS-Screener Spanish Calidad-Media Line-Dubbed ","uid":4860166,"size":1008540593,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b64f2016cdf70ab1157092be5ef9a23233eb297&amp;dn=Los+Abrazos+Rotos+TS-Screener+Spanish+Calidad-Media+Line-Dubbed+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":7,"time":1240240780,"description":"Un hombre (LluÃƒÂ­s Homar) escribe, vive y ama en la oscuridad. Catorce aÃƒÂ±os antes sufriÃƒÂ³ junto a Lena (PenÃƒÂ©lope Cruz), la mujer de su vida, un brutal accidente de coche en la isla de Lanzarote que lo dejÃƒÂ³ ciego. Este hombre usa dos nombres, Harry Caine, lÃƒÂºdico seudÃƒÂ³nimo bajo el que firma sus trabajos literarios, relatos y guiones y Mateo Blanco, su nombre de pila real, con el que vive y firma las pelÃƒÂ­culas que dirige. En la actualidad, Harry Caine vive gracias a los guiones que escribe y a la ayuda de su antigua y fiel directora de producciÃƒÂ³n, Judit GarcÃƒÂ­a (Blanca Portillo), y de Diego (Tamar Novas), el hijo de ÃƒÂ©sta, secretario, mecanÃƒÂ³grafo y lazarillo. Desde que decidiera vivir y contar historias, Harry es un ciego activo y atractivo que ha desarrollado todos sus otros sentidos para disfrutar de la vida, a base de ironÃƒÂ­a y una amnesia autoinducida. Ha borrado de su biografÃƒÂ­a toda sombra de su primera identidad, Mateo Blanco. La historia de Mateo, Lena, Judit y Ernesto Martel es una historia de amour fou, dominada por la fatalidad, los celos, el abuso de poder, la traiciÃƒÂ³n y el complejo de culpa...         ","torrent":{"xt":"urn:btih:3b64f2016cdf70ab1157092be5ef9a23233eb297","amp;dn":"Los+Abrazos+Rotos+TS-Screener+Spanish+Calidad-Media+Line-Dubbed+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b64f2016cdf70ab1157092be5ef9a23233eb297","infoHashBuffer":{"type":"Buffer","data":[59,100,242,1,108,223,112,171,17,87,9,43,229,239,154,35,35,62,178,151]},"announce":[],"urlList":[]}}