{"title":"I-Doser - White Crosses - Apple Lossless","uid":4622595,"size":181403195,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3c722aa07876e2c3ac14785dc27327d96ca9e10b&amp;dn=I-Doser+-+White+Crosses+-+Apple+Lossless&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alvinacres4848","files":1,"time":1231093160,"description":"I-Doser White Crosses. Highest Quality. Dose converted from .drg to .wav &amp; saved in Apple Lossless format. Read or play from iTunes convert to your favorite format from there. Keep your bitrate up!\n\nIf you prefer another format let me know. (FLAC is BS, IMO)\n\nI'll do one at a time and keep the quality up. Coming from Mac. No virus.\n\n\nWhite Crosses\nRecreational (VERY STRONG)\n30 Minutes\n\nWhite Crosses is a strange one. When the team that invented this dose showed it at our monthy dose meeting, it was greeted with a bunch of confused faces. Describe it, we said. OK. White Crosses is a simple stimulant that brings a sense of euphoria, openness, and intellectual expansion. There can be a mild psychedelic component as the new user feels they see the world a little differently. The sensation of mind-expansion and openness quickly fade after the first few uses and physical and mental stimulation dominate the experiential effects. It is a hybrid designer dose for experienced users. Fine. When we put on the headphones, and White Crosses finished, we couldn't believe it. This underground bastard-dose that has been talked about in the halls of I-Doser Labs turned out to blow the minds of everyone who tried it. THAT says a lot for White Crosses.","torrent":{"xt":"urn:btih:3c722aa07876e2c3ac14785dc27327d96ca9e10b","amp;dn":"I-Doser+-+White+Crosses+-+Apple+Lossless","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c722aa07876e2c3ac14785dc27327d96ca9e10b","infoHashBuffer":{"type":"Buffer","data":[60,114,42,160,120,118,226,195,172,20,120,93,194,115,39,217,108,169,225,11]},"announce":[],"urlList":[]}}