{"title":"Civilization IV Beyond the Sword.Demo+gameplay vids","uid":4287495,"size":1806385825,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3d114403d38d18e1cd5de16047d3792b0428520b&amp;dn=Civilization+IV+Beyond+the+Sword.Demo%2Bgameplay+vids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"actorrentwizard7","files":32,"time":1215782235,"description":"Civilization IV: Beyond the Sword\n\nSid Meier&amp;#039;s Civilization IV: Beyond the Sword is the second expansion pack for Civilization IV. The expansion focuses on the \nlate-game time periods after the invention of gunpowder and includes 12 different scenarios, ten new civilizations, 16 new \nleaders, five new wonders, and a variety of new units that offer more ways for players to expand their civilization?s power \nas they strive for world domination.\n\nSpecial Features\n\n# New units, buildings, and technologies to the epic game with additional focus on the late-game time periods.\n\n# 12 new scenarios, many containing themes never before included in the Civilization series\n\n# Ten new civilizations, such as Portugal, Babylon and Netherlands\n\n# Sixteen new leaders including leaders for the ten new civilizations, as well as additional leaders for existing \n  civilizations\n\n# A gameplay feature that allows players to create corporations and spread them throughout the world. Each corporation \n  provides benefits in exchange for certain resources\n\n# Now available much earlier in the game, this expanded feature offers players many new ways to spy on opponents, stir \n  citizen unrest and defend their government?s secrets\n\n# New random events such as natural disasters, pleas for help, or demands from their citizens will challenge players to \n  overcome obstacles in order for their civilizations to prosper\n\n# Five new wonders await discovery including the Statue of Zeus, Cristo Redentor, Shwedagon Paya, the Mausoleum of \n  Maussollos, and the Moai Statues\n\n# Winning the race to Alpha Centauri will now require more strategic planning and tactical decision making\n\n# The United Nations will become available earlier in the game, providing a way for players to win a diplomatic victory \n  earlier. New resolutions will also be added which will expand the available diplomatic options\n\n# The Advanced Starts feature enables players to buy components of a custom-tailored empire and begin play in the later part \n  of the game, allowing them to experience many of the new features of the expansion pack in a shorter amount of time\n\n# The AI has received many enhancements, making it tougher to beat on the higher difficulty levels!","torrent":{"xt":"urn:btih:3d114403d38d18e1cd5de16047d3792b0428520b","amp;dn":"Civilization+IV+Beyond+the+Sword.Demo%2Bgameplay+vids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d114403d38d18e1cd5de16047d3792b0428520b","infoHashBuffer":{"type":"Buffer","data":[61,17,68,3,211,141,24,225,205,93,225,96,71,211,121,43,4,40,82,11]},"announce":[],"urlList":[]}}