{"title":"Accepted DvDRip[Eng]5.1AC3.AMX","uid":5635844,"size":1601717482,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e310628fe665459519ae6432923345613aff663&amp;dn=Accepted+DvDRip%5BEng%5D5.1AC3.AMX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AMX1494","files":-1,"time":1276886700,"description":"Graduating high school senior Bartleby &quot;B&quot; Gaines (Justin Long) finds himself without a college to attend. He has been able to talk and con his way out of every problem he encounters, but he hasn't been able to charm his way pass the college admissions board of eight colleges. His mom and dad are very disappointed that Bartleby hasn't been accepted into college. His parents think that if Bartleby doesn't go to college, he will have no future. Several of Bartleby's friends are in the same situation of being rejected by all the colleges they applied to. To satisfy their parents, Bartleby comes up with an idea to start his own college with an internet site. They convert an abandoned psychiatric facility into the South Harmon Institute of Technology. They will be the only students. However, the web site states that we accept anyone. On the first day of school, they unexpectedly have a large number of accepted students that were also rejected by all colleges. With a million dollars in tuition money, Bartleby must make his fake college into a functioning one. He hires Uncle Ben (Lewis Black) as the College Dean. The fun begins when they design their own curriculum, make their own rules, and party all night. The fun will eventually end when the South Hamon jocks will ruin all the work that B and his friends have accomplished, Douglas Young (the-movie-guy)","torrent":{"xt":"urn:btih:3e310628fe665459519ae6432923345613aff663","amp;dn":"Accepted+DvDRip%5BEng%5D5.1AC3.AMX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e310628fe665459519ae6432923345613aff663","infoHashBuffer":{"type":"Buffer","data":[62,49,6,40,254,102,84,89,81,154,230,67,41,35,52,86,19,175,246,99]},"announce":[],"urlList":[]}}