{"title":"Tommyknockers (1993) [hiest]","uid":5540615,"size":1468319791,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4117a049b4518e5da15c6eb1672f1800ceab5802&amp;dn=Tommyknockers+%281993%29+%5Bhiest%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hiest","files":3,"time":1273214282,"description":"This is a new DVD Rip of this classic film starring Sissy Spacek and Anne Bancroft. Incredibly hard to find 'til now, the film has just been released on Region 2 DVD (anamorphic widescreen), and was previously available only on a grainy VHS. The new transfer looks awesome and this incredible film can finally be seen as intended. \n\nThe DVD contains no extras or subtitles, but it's great just to finally have such a nice transfer of the film itself. \n\nPlot synopsis: \nNight, Mother was adapted by Marsha Norman from her own harrowing Pulitzer Prize-winning play. Outwardly normal Sissy Spacek calmly informs her mother Anne Bancroft that she's about to commit suicide. Thus the stage is set for a war of nerves between the determined Spacek and the distraught Bancroft, who uses every emotional and psychological device at her disposal to stave off the inevitable. The film's tension grows not from its plot development--we know from the outset how it's going to end--but from whether or not we're going to learn all the reasons for Spacek's decision. She's an epileptic, an alcoholic, and supremely miserable, but she always holds a little something back, prompting the viewer to lean closer to the screen in hopes of ferreting out more answers. In the original play, the outcome was never predictable; perhaps understandably, there are many who prefer the staged 'Night Mother to the screen version.","torrent":{"xt":"urn:btih:4117a049b4518e5da15c6eb1672f1800ceab5802","amp;dn":"Tommyknockers+%281993%29+%5Bhiest%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4117a049b4518e5da15c6eb1672f1800ceab5802","infoHashBuffer":{"type":"Buffer","data":[65,23,160,73,180,81,142,93,161,92,110,177,103,47,24,0,206,171,88,2]},"announce":[],"urlList":[]}}