{"title":"HITLER The Rise of Evil = 2Lions Team =","uid":4885512,"size":7582585892,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:411e293c921ff90feb0e7486af5e0f8e5fe14311&amp;dn=HITLER+The+Rise+of+Evil+%3D+2Lions+Team+%3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Vermeulen","files":-1,"time":1241716980,"description":"Hitler : The Rise Of Evil \n\n\n\n\n\n************************************************************************\n\n\nGenre(s): - Documentaire - Thriller \n\nLand: - Amerika\n\nKijkwijzer: - 12 jaar\n\nTaal/: - English\n\nOndertiteling: - Nederlands Dutch on/off\n\nSpeelduur: - Circa160 Min.\n\nDolby Digital: - 5.1 \n\nBeeld: - 16:9 \n\nCover: - Aanwezig\n\n\n\n************************************************************************\n\n\nKorte Omschrijving  \t\n\n\nTheir silence allowed evil to flourish...\n\nDit is het fascinerende portret van de gevaarlijkste man van de twintigste eeuw: Adolf Hitler, \nbriljant gespeeld door Robert Carlyle (Trainspotting). \nWe zien Hitler's liefdeloze opvoeding, zijn mislukte carriÃƒÂ¨re als kunstschilder en zijn perverse relatie met zijn nichtje. tegen de tijd dat hij in de Eerste Wereldoorlog vecht, heeft hij al zo'n ongelooflijke haat ontwikkeld tegen de wereld, de mensheid en de Joden in het bijzonder, dat hij door velen voor gek wordt versleten. maar deze gek weet zichzelf door manipulatie en bedrog op te werken tot de hoogste regionen van de Duitse politiek. \nDeze indrukwekkende film laat zien hoe Adolf Hitler normale, verstandige mensen wist mee te slepen in zijn krankzinnige ideeÃƒÂ«n. Met verschrikkelijke gevolgen...\n\n\n************************************************************************\n\nUitgebreide omschrijving\n\n\n\n\n\n     Adolf Hitler. Een naam die brengt direct beelden van de Tweede Wereldoorlog en de wreedheden die op miljoenen onschuldige mensen, met inbegrip van de miljoenen joden die geconfronteerd genocide in de nazi-leider van de uitvoering van &quot;The Final Solution&quot; in de dood kampen. Maar hoe heeft Hitler opgroeien tot een van de meest kwaad, gevreesd, gehaat en mannen in de geschiedenis? Dit maakte voor televisie mini-serie geeft aan kroniek hoe Hitler uit de gelederen van de mislukte kunstenaar en Wereldoorlog I soldaat tot leider van de machtige nazi-partij.\n\n     Geboren in Oostenrijk in 1889, is er zo weinig bekend over de jonge Adolf dat hij al 10 jaar oud als de opening credits beginnen en zijn moeder Alois (Stockard Channing) is dood voordat dezelfde kredieten einde, net zoals Adolf bochten 14. Een ziekelijke jongen die constant long problemen die voortijdig einde van zijn studie had hij een passie voor kunst, maar werd twee keer afgewezen door de Weense Academie voor Kunst omdat zijn tekeningen ontbraken passie. Hij gesloopt samen een schamele bestaan verkoop van zijn schilderijen alvorens naar MÃƒÂ¼nchen in 1913. Hij diende in de Grote Oorlog, oplopend tot de rang van Lance-korporaal, waar verblind door mosterdgas won hij twee ijzeren kruisen voor moed (ook al was hij daadwerkelijk alleen een bericht runner).\n\n     Het was na de Eerste Wereldoorlog dat Hitler begon aan te tonen zijn politieke vaardigheden. Hij trad Anton Drexler de Duitse Arbeiderspartij, en vond dat zijn aangeboren spreekvaardigheid hadden mensen luisteren naar hem. Binnen maanden Drexler hij afgezet als leider van de partij die werd omgedoopt tot de Nationalistische Socialistische Duitse Worker's Party of Nationalsozialistische Deutsche Arbeiterpartei (NSDAP). Deze partij werd natuurlijk veel beter bekend als de nazi-partij. Sprekend zijn gedachten over de sociale, economische en raciale kwesties met grote passie was het vanaf hier zijn macht groeide. Na een mislukte opstand en enkele maanden in de gevangenis voor verraad, had hij nog steeds veel rijke donateurs en sympathisanten. Bij zijn vrijlating uit de gevangenis hij campagne krachtig op de rug van een enorme en groeiende propaganda machine die newsreels en zijn eigen krant. Langzaam wint nummers in het Duitse parlement hij uiteindelijk eigenen de Duitse bondskanselier, Hindenburg (Peter O'Toole) en bleek Duitsland in een partij een totalitaire staat. Per 1938, het leger is weer in volle kracht, en met de invasie van Polen in 1939, de rest, zoals ze zeggen, is geschiedenis.\n\n     Deze mini-serie pogingen om kroniek Hitlers stijging aan de macht, uit zijn vroege jaren in het Duitse leger tot de dood van Hindenburg en zijn daaropvolgende tot leider van het land. De producenten hadden enige moeite lijkt vanaf het begin. Dit is een vrij gevoelig onderwerp voor vele mensen in Europa en natuurlijk het joodse volk. Het met howls van protest aan beide zijden van de Atlantische Oceaan, met veel mensen met vermelding van elke poging tot een beeld Hitler zou blijken dat hij meer mens dan velen willen geloven, en misschien zelfs met een zachte en leuke kant. De casting was ook lastig. Robert Carlyle was gekozen om te spelen Hitler in een rivaal BBC productie, maar dit werd geannuleerd. Hij was nog graag spelen Hitler en werd al snel bood de rol in deze productie, op voorwaarde dat zijn accent is authentiek (hij is een Schot na allemaal). Wanneer de donateurs gehoord zijn Oostenrijks-Duitse inspanningen die zij geacht dit te goed en vroeg dat hij toon neer te meer van een mid-Atlantische stijl (wat dat ook is). Dit zou moeten hebben alarmklokken beltoon voor de directeur. De volledige productie van een reeks &quot;wij willen niet beledigen iedereen met dit gevoelige materiaal&quot; mantra. De ondersteunende cast is groot in aantal, maar de meeste van de personages zijn zo eendimensionaal ze zijn zwart of wit in hun steun, en ze bitter weinig aan de plot.\n\nMoviemeter link &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/14950&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/14950&lt;/a&gt;\n\n************************************************************************\n\n\n\nEnglish\n\nPlot Synopsis\n\n\n\n\n\n    Adolf Hitler. A name that brings instant images of World War II and the atrocities brought upon millions of innocent people, including the millions of Jews who faced genocide in the Nazi leader's execution of &quot;The Final Solution&quot; in the death camps. But how did Hitler grow up to become one of the most evil, feared, and hated men in history? This made-for-television mini-series sets out to chronicle just how Hitler rose from the ranks of failed artist and World War I soldier to leader of the powerful Nazi party.\n\n    Born in Austria in 1889, there is so little known about the young Adolf that he is already 10 years old as the opening credits start and his mother Alois (Stockard Channing) is dead before the same credits end, just as Adolf turns 14. A sickly boy who had constant lung trouble that prematurely ended his studies, he had a passion for art but was twice rejected by the Vienna Academy of Art because his drawings lacked passion. He scrapped together a meagre existence selling his paintings before moving to Munich in 1913. He served in the Great War, rising to the rank of Lance-Corporal, where blinded by mustard gas he won two Iron Crosses for bravery (even though he was effectively just a message runner).\n\n    It was after World War I that Hitler started to show his political skills. He joined Anton Drexler's German Workers Party, and found that his innate speaking skills had people listening to him. Within months he deposed Drexler as leader of the party which was renamed the Nationalist Socialist German Worker's Party or Nationalsozialistische Deutsche Arbeiterpartei (NSDAP). This party of course became much better known as the Nazi Party. Speaking his mind on social, economic, and racial matters with great passion it was from here his power grew. After a failed uprising and some months in prison for treason, he still had many wealthy backers and supporters. On his release from prison he campaigned vigorously on the back of a vast and growing propaganda machine which include newsreels and his own newspaper. Slowly gaining numbers in the German parliament he eventually usurped the German Chancellor, Hindenburg (Peter O'Toole) and turned Germany into a one party totalitarian state. By 1938, the military was back in full force, and with the invasion of Poland in 1939, the rest, as they say, is history.\n\n    This mini-series attempts to chronicle Hitler's rise to power, from his early years in the German army through to the death of Hindenburg and his subsequent rise to leader of the country. The producers had some difficulty it seems right from the start. This is a pretty touchy subject for many people in Europe and of course the Jewish people. It met with howls of protest from both sides of the Atlantic, with many people stating any attempt at portraying Hitler's life would show him to be more human than many like to believe, and possibly even having a gentle and nice side. The casting was also troublesome. Robert Carlyle had been chosen to play Hitler in a rival BBC production, but this was cancelled. He was still keen to play Hitler and was soon offered the role in this production, on the proviso that his accent was authentic (he is a Scot after all). When the backers heard his Austro-German effort they deemed it too good and asked that he tone it down to more of a mid-Atlantic style (whatever that is). This should have set alarm bells ringing for the director. The whole production reeks of a 'we don't want to offend anyone with this sensitive material' mantra.  The supporting cast is large in number, but most of the characters are so one-dimensional they are either black or white in their support, and they add precious little to the plot. \n\n\nIMDB link &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0346293/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0346293/&lt;/a&gt;\n\n************************************************************************\n\n\nCast\n\n    * Robert Carlyle - Adolf Hitler\n    * Stockard Channing - Klara Hitler\n    * Jena Malone - Geli Raubal\n    * Julianna Margulies - Helene Hanfstaengel\n    * Matthew Modine - Fritz Gerlich\n    * Liev Schreiber - Ernst Hanfstaengel\n    * Peter Stormare - Ernst Rohm\n    * Frederick von Thun - Von Ludendorff\n    * Peter O'Toole - Von Hindenburg\n    * Zoe Telford - Eva Braun\n    * Terence Harvey - Gustav von Kahr\n    * Justin Salinger - Dr. Josef Goebbels\n    * Chris Larkin - Hermann Goering\n    * James Babson - Rudolph Hess\n    * Joel Kirby - Prosecutor Stenglein\n    * Patrizia Netzer - Sophie Gerlich\n    * Harvey Friedman - Friedrich Hollander\n    * Nicole Marischka - Blandine Erbinger\n    * Thomas Sangster - Adolf Hitler (age 10)\n    * Robert Glenister - Anton Drexler\n    * Ian Hogg - Alois Hitler\n    * Brendan Hughes - Lt. Guffman\n    * Howie Lotker - Hans\n    * Robert Russell - Von Papen\n    * David Fisher - Georg Bell\n    * Hana Frejkova - Frieda\n    * Wolfgang Muller - Gregory Strasser\n    * Christopher Ettridge - Gen. Von Schleicher\n    * David Calder - Dosch\n    * Marek Vasut - Max Amann\n    * Bruce Byron - Mueller\n    * George Pensotti - Judge Neithardt\n    * Julian Wadham - Capt. Mayr\n    * Richard Haas - Karl Lueger\n    * Richard Katz - Dr. Bloch\n    * Rod Grover - Friedrich Hoffman\n    * Jiri D. Novotny - Von Lussow\n    * Jiri M. Sieber - Ulrich Graf\n\nCrew\n\n    * Christian Duguay - Director\n    * John Ryan - Producer\n    * Ed Gernon - Executive Producer\n    * Peter Sussman - Executive Producer\n    * Benjamin Robin - Makeup, Hair Styles\n    * Diana Kerew - Co-Executive Producer\n    * G. Ross Parker - Teleplay By\n    * Henk van Eeghen - Editor\n    * Ian Kershaw - Book Author\n    * Ian McDougall - Supervising Producer\n    * John Pielmeier - Teleplay By\n    * Marek Dobrowoiski - Production Designer\n    * Maria Schicker - Costume Designer\n    * Normand Corbeil - Composer (Music Score)\n    * Philip Von Alvensleben - Supervising Producer\n    * Pierre Gill - Cinematographer\n    * Sylvain Lebel - Editor\n\n************************************************************************\n\n******************************************\n\nBrought to you by\nVermeulen.GmBh\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************","torrent":{"xt":"urn:btih:411e293c921ff90feb0e7486af5e0f8e5fe14311","amp;dn":"HITLER+The+Rise+of+Evil+%3D+2Lions+Team+%3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"411e293c921ff90feb0e7486af5e0f8e5fe14311","infoHashBuffer":{"type":"Buffer","data":[65,30,41,60,146,31,249,15,235,14,116,134,175,94,15,142,95,225,67,17]},"announce":[],"urlList":[]}}