{"title":"El ultimatum de Bourne (DVDScreener)(","uid":4349703,"size":727967744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:455e10df7fd0c9540f4413fbd3cce27f37eff083&amp;dn=El+ultimatum+de+Bourne+%28DVDScreener%29%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kukino","files":1,"time":1219085104,"description":"SegÃƒÂºn las palabras del propio director: El motor de las dos primeras pelÃƒÂ­culas son las preguntas: Ã‚Â¿QuiÃƒÂ©n soy? Ã‚Â¿QuiÃƒÂ©n matÃƒÂ³ a mi novia? Las respuestas que Bourne obtiene en ambas pelÃƒÂ­culas son satisfactorias, pero incompletas. La tercera pelÃƒÂ­cula debÃƒÂ­a tener todas las respuestas. Por fin se sabe cÃƒÂ³mo Jason Bourne se convirtiÃƒÂ³ en Jason Bourne. Bourne es un hombre sin paÃƒÂ­s y sin pasado. DespuÃƒÂ©s de ser sometido a un brutal entrenamiento del que no recuerda nada por personas a las que no consigue identificar, se convirtiÃƒÂ³ en una sofisticada arma humana, y ahora se ha convertido en el objetivo mÃƒÂ¡s escurridizo de la CIA. Desde que le encontraron flotando en el mar MediterrÃƒÂ¡neo italiano hace varios aÃƒÂ±os, iniciÃƒÂ³ una bÃƒÂºsqueda desesperada para saber quiÃƒÂ©n es y quiÃƒÂ©n le enseÃƒÂ±ÃƒÂ³ a matar. Cuando su novia Marie fue asesinada, a Bourne le pudo la sed de venganza. Cuando la aplacÃƒÂ³, sÃƒÂ³lo deseaba desaparecer para siempre y olvidar la vida que le habÃƒÂ­an robado. Pero el titular de un periÃƒÂ³dico londinense que especula sobre la posibilidad de que siga vivo acaba con sus esperanzas, convirtiÃƒÂ©ndole de nuevo en un objetivo. Treadstone, el programa de operaciones ultrasecretas que creÃƒÂ³ a este superasesino, ya no existe. Ha sido absorbido por el programa Blackbriar, del Departamento de Defensa, que ha lanzado a la calle una nueva generaciÃƒÂ³n de asesinos profesionales a disposiciÃƒÂ³n del Gobierno y cuya existencia es desconocida. Para ellos, Bourne representa un malfuncionamiento valorado en 30 millones de dÃƒÂ³lares que debe ser eliminado; para ÃƒÂ©l, ellos son el ÃƒÂºnico eslabÃƒÂ³n que le une a una vida que se ha esforzado en olvidar. Bourne ha llegado al final del camino. Esta vez no le bastarÃƒÂ¡n las promesas vacÃƒÂ­as de sus antiguos amos; tampoco se detendrÃƒÂ¡ al matar a los que le persiguen sin tregua. No le queda nada que perder y se servirÃƒÂ¡ de todo lo que le han enseÃƒÂ±ado, de todos sus instintos para llegar hasta sus creadores y acabar de una vez por todas. En su bÃƒÂºsqueda pasarÃƒÂ¡ por MoscÃƒÂº, ParÃƒÂ­s, Madrid, Londres y TÃƒÂ¡nger, intentando ir siempre un paso por delante de los agentes de Blackbriar, de los agentes federales y de la policÃƒÂ­a local, decidido a encontrar las respuestas a las preguntas que le torturan. Sus pesquisas le conducirÃƒÂ¡n al punto donde empezÃƒÂ³ todo y donde todo terminarÃƒÂ¡: las calles de Nueva York.","torrent":{"xt":"urn:btih:455e10df7fd0c9540f4413fbd3cce27f37eff083","amp;dn":"El+ultimatum+de+Bourne+%28DVDScreener%29%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"455e10df7fd0c9540f4413fbd3cce27f37eff083","infoHashBuffer":{"type":"Buffer","data":[69,94,16,223,127,208,201,84,15,68,19,251,211,204,226,127,55,239,240,131]},"announce":[],"urlList":[]}}