{"title":"Edukators","uid":4936196,"size":4508811264,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:456cd017033ba66fe0362d2cbd7cf9dfcbf3d12c&amp;dn=Edukators&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiagofavi2612","files":1,"time":1244256109,"description":"TrÃƒÂªs jovens idealistas realizam protestos pacÃƒÂ­ficos, invadindo a casa de pessoas ricas para trocar os mÃƒÂ³veis de lugar e deixar mensagens de protestos. Numa de suas aÃƒÂ§ÃƒÂµes um deles esquece um celular, o que faz com que tenham que retornar ao local no dia seguinte. PorÃƒÂ©m o que eles nÃƒÂ£o contavam era em encontrar presente o dono da casa. Com Daniel BrÃƒÂ¼hl.Jan (Daniel BrÃƒÂ¼hl) e Peter (Stipe Erceg) sÃƒÂ£o dois jovens que acreditam que podem mudar o mundo. Eles se auto-denominam &quot;Os Educadores&quot;, rebeldes contemporÃƒÂ¢neos que expressam sua indignaÃƒÂ§ÃƒÂ£o de forma pacÃƒÂ­fica: eles invadem mansÃƒÂµes, trocam mÃƒÂ³veis e objetos de lugar e espalham mensagens de protesto. Jule (Julia Jentsch) ÃƒÂ© a namorada de Peter, que estÃƒÂ¡ passando por problemas financeiros e, por causa deles, estÃƒÂ¡ saindo de seu apartamento alugado. Tempos atrÃƒÂ¡s Jule se envolveu em um acidente de carro, que destruiu o carro de um rico empresÃƒÂ¡rio. Condenada pela justiÃƒÂ§a, ela precisa pagar um novo carro no valor de 100 mil euros, o que praticamente faz com que trabalhe apenas para pagar a dÃƒÂ­vida que possui. Como Peter viaja para Barcelona, Jan vai ajudÃƒÂ¡-la na mudanÃƒÂ§a. Eles se conhecem melhor e Jan termina por contar a ela a verdade sobre os Educadores. Empolgada com a notÃƒÂ­cia, Jule insiste que ela e Jan invadam a casa de Hardenberg (Burghart Klaubner), o empresÃƒÂ¡rio que a processou. ApÃƒÂ³s uma certa resistÃƒÂªncia, Jan concorda. Na casa eles agem como os Educadores, mudando os mÃƒÂ³veis de lugar, mas cometem um grave erro: Jule esquece no local seu celular. No dia seguinte, com Peter jÃƒÂ¡ tendo retornado da viagem mas sem saber do ocorrido, Jan e Jule decidem invadir novamente a casa de Hardenberg, para recuperar o celular. PorÃƒÂ©m o que eles nÃƒÂ£o esperavam era que o empresÃƒÂ¡rio os surpreendesse dentro da casa, o que os forÃƒÂ§a a sequestrÃƒÂ¡-lo. ","torrent":{"xt":"urn:btih:456cd017033ba66fe0362d2cbd7cf9dfcbf3d12c","amp;dn":"Edukators","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456cd017033ba66fe0362d2cbd7cf9dfcbf3d12c","infoHashBuffer":{"type":"Buffer","data":[69,108,208,23,3,59,166,111,224,54,45,44,189,124,249,223,203,243,209,44]},"announce":[],"urlList":[]}}