{"title":"Living Colour - Elvis Is Dead (2nafish)","uid":5767429,"size":147200004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:46e4bfc9a36db2fe2060bc59b39dd5746039436f&amp;dn=Living+Colour+-+Elvis+Is+Dead+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1281964926,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Elvis Is Dead&quot; is a song by Living Colour featuring Little Richard off the album Time's Up. Before, during, and after Little Richard's spoken-word performance, many voices speak the song title, concluded by one announcing, &quot;Elvis has left the building!&quot; After, the band twisted the line &quot;Maybe I've a reason to believe we all will be received in Graceland&quot; from Paul Simon's &quot;Graceland&quot; to yield the refrain, &quot;I've got a reason to believe we all won't be received at Graceland.&quot; They also quote Public Enemy's &quot;Fight the Power&quot; in stating, &quot;Elvis was a hero to most,&quot; but diverge in adding, &quot;But that's beside the point.&quot;\n\nTime's Up is the second album by Living Colour, released on August 20, 1990. It was the follow-up to the successful Vivid. The album features a wide range of genres and also includes cameo appearances by Queen Latifah, Little Richard, Doug E. Fresh, Maceo Parker and James Earl Jones. After the album was released, it reached gold status, peaked at #13 on the Billboard 200 and later won a Grammy for best hard rock album of the year. It is the last album to feature Muzz Skillings on bass. As of 2009, the CD is out of print, but the album is available as an MP3 download.\n\nLiving Colour is an American funk metal band from New York, formed in 1984. Stylistically, the band's music is a creative fusion influenced by free jazz, funk, and hard rock. Their lyrics range from the personal to the political, in some of the latter cases attacking Eurocentrism and racism in America. The band were prominent members of the Black Rock Coalition during the late 1980s and early 1990s (a movement which also featured Fishbone, and 24-7 Spyz).\n\nLiving Colour rose to fame with their debut album Vivid in 1988. Although the band scored a number of hits, they are best remembered for their signature song &quot;Cult of Personality&quot;, which won a Grammy Award for Best Hard Rock Performance in 1989, and their highest charting single &quot;Type&quot;. They were also named Best New Artist at the 1989 MTV Video Music Awards. After disbanding in 1995, Living Colour reunited in late 2000.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:46e4bfc9a36db2fe2060bc59b39dd5746039436f","amp;dn":"Living+Colour+-+Elvis+Is+Dead+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e4bfc9a36db2fe2060bc59b39dd5746039436f","infoHashBuffer":{"type":"Buffer","data":[70,228,191,201,163,109,178,254,32,96,188,89,179,157,213,116,96,57,67,111]},"announce":[],"urlList":[]}}