{"title":"lost season 5 afl    16 en 17  dutch","uid":4903172,"size":748897318,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:47109facc2ed49142bff62c2f9513ff1c96e79c0&amp;dn=lost+season+5+afl++++16+en+17++dutch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"brillant","files":1,"time":1242758181,"description":"5-16 &amp; 5-17 (102-103) \t&quot;The Incident (deel I &amp; II) (en) &quot; \tJacob \tJack Bender \tDamon Lindelof &amp; Carlton Cuse \tVerenigde Staten 13 mei 2009\nIn 2007 zijn Locke, Ben en de Anderen nog altijd op weg naar Jacob. Jacob woont in de voet van de gigantisch kolos die ooit op het eiland stond en Richard leidt de groep ernaar toe. Locke wil nog altijd Jacob vermoorden en wil ook dat Ben die taak uitvoert. Als Ben vraagt waarom hij dat moet doen, vraagt Locke zich af waarom hij het niet zou doen: in 30 jaar tijd heeft hij altijd ten dienste gestaan van het eiland en toch is zijn dochter dood en werd hij verbannen.\n\nOndertussen zijn Ilana en haar handlangers de groep gevolgd. Ze ontmoeten de Anderen bij de kolos en laten hen zien wat ze gevonden hebben in het ruim van het vliegtuig: het lijk van John Locke. De levende 'Locke' en Ben zitten ondertussen bij Jacob. Die vraagt aan Ben om Locke's plan niet uit te voeren, maar de harde woorden van John zinderen nog na bij Ben en uiteindelijk vermoordt Ben Jacob.\nIn 1977 probeert Jack (samen met Sayid, Richard en Eloise) de waterstofbom te ontmantelen: ze moeten hem tot ontploffing brengen bij 'The Swan' als ze willen dat hun plan slaagt. Ondertussen kapen Juliet, Sawyer en Kate de duikboot en kunnen ze terugkeren naar het eiland. Jack en Sayid trekken naar 'The Swan', maar moeten daarvoor door het Dharma dorp. Ze worden opgemerkt en beschoten door de andere bewoners (Sayid wordt ook geraakt), maar kunnen dankzij de hulp van Hurley, Miles en Jin toch het dorp ontvluchten. Op weg naar 'The Swan' komen ze in de jungle Sawyer, Juliet en Kate tegen. Sawyer probeert Jack van zijn plan te doen afzien, maar Jack zet door. Met behulp van zijn vrienden slaagt Jack in zijn plan en kan hij de bom in de boorput gooien. Maar er gebeurt niet meteen iets. De boor zelf heeft ondertussen het elektromagnetisch veld geraakt en begint (zoals een magneet) metaal aan te trekken. Een losliggende ketting sleurt Juliet mee de put in. Sawyer probeert haar te redden, maar moet haar loslaten. Juliet valt, maar is niet onmiddellijk dood. Ze ligt vlak naast de bom en brengt hem met een steen toch tot ontploffing... \n\n\n\n","torrent":{"xt":"urn:btih:47109facc2ed49142bff62c2f9513ff1c96e79c0","amp;dn":"lost+season+5+afl++++16+en+17++dutch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47109facc2ed49142bff62c2f9513ff1c96e79c0","infoHashBuffer":{"type":"Buffer","data":[71,16,159,172,194,237,73,20,43,255,98,194,249,81,63,241,201,110,121,192]},"announce":[],"urlList":[]}}