{"title":"George Smoot: The design of the universe","uid":4569096,"size":60898592,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:475beb89f70f8136640673d22812fdb12d8f5fc2&amp;dn=George+Smoot%3A+The+design+of+the+universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1228992995,"description":"At Serious Play 2008, astrophysicist George Smoot shows stunning new images from deep-space surveys, and prods us to ponder how the cosmos -- with its giant webs of dark matter and mysterious gaping voids -- got built this way.\n\nAstrophysicist, cosmologist and Nobel Prize winner George Smoot studies the cosmic microwave background radiation -- the afterglow of the Big Bang. His pioneering research into deep space and time is uncovering the structure of the universe itself.\n\nGeorge Smoot looks into the farthest reaches of space to the oldest objects in the known universe: fluctuations in the remnants of creation. Using data collected from satellites such as COBE and WMAP, scanning the cosmic microwave background radiation (a relic of the heat unleashed after the Big Bang), he probes the shape of the universe. In 1992 he and his Berkeley team discovered that the universe, once thought to be smooth and uniform at the largest scale, is actually anisotropic -- or varied and lumpy.\n\nSmoot continues to investigate of the structure of the universe at the University of California at Berkeley, mapping billions of galaxies and filaments of dark matter in hope of uncovering the secrets of the universe's origins.\n\n    &quot;The very detailed observations that the Laureates have carried out from the COBE satellite have played a major role in the development of modern cosmology into a precise science.&quot;\n\nThe Royal Swedish Academy of Sciences, on Smoot's Nobel Prize\n\n\n\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law) &lt;a href=&quot;\nhttp://petitions.number10.gov.uk/shariastop/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://petitions.number10.gov.uk/shariastop/&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it... &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog... &lt;a href=&quot;\nhttp://thephyrexian.tk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thephyrexian.tk/&lt;/a&gt;","torrent":{"xt":"urn:btih:475beb89f70f8136640673d22812fdb12d8f5fc2","amp;dn":"George+Smoot%3A+The+design+of+the+universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475beb89f70f8136640673d22812fdb12d8f5fc2","infoHashBuffer":{"type":"Buffer","data":[71,91,235,137,247,15,129,54,100,6,115,210,40,18,253,177,45,143,95,194]},"announce":[],"urlList":[]}}