{"title":"Nate Silver: Picking apart the puzzle of racism in elections","uid":4878598,"size":37496881,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4c6f9a1513300ede422796cb2bc5d36d34adaaff&amp;dn=Nate+Silver%3A+Picking+apart+the+puzzle+of+racism+in+elections&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263485,"description":"Nate Silver: Picking apart the puzzle of racism in elections\n\nNate Silver has answers to controversial questions about race in politics: Did Obama's race hurt his votes in some places? Stats and myths collide in this fascinating talk that ends with a remarkable insight on how town planning can promote tolerance.\n\nIn the 2008 election season's closing weeks, throngs of wonks and laypeople alike were glued to FiveThirtyEight.com, a habitforming political blog. Red and blue bar charts crowded the scrollbars as the pulse of exit polls crept along the site's latest projections. It seemed almost miraculous: In a year of acute turns of favor, the site's owner and mouthpiece, Nate Silver (who blogged anonymously as &quot;Poblano&quot; until outing himself on May 30, 2008, as a baseball numberhead), managed to predict the winners of every U.S. Senate contest -- and the general Presidential election.\n\nBesides being just-damn-fascinating, Silver's analysis is a decidedly contrarian gauntlet thrown before an unrepentant, spectacle-driven media. The up-and-coming pundit, who cut his teeth forecasting the performance of Major League Baseball players, has a fairly direct explanation of why most projections fail: &quot;Polls are cherry-picked based on their brand name or shock value rather than their track record of accuracy.&quot;\n\nSilver's considerable smarts are already helping local campaigns build constituencies and strategize. Look for his two books from Penguin in 2009.","torrent":{"xt":"urn:btih:4c6f9a1513300ede422796cb2bc5d36d34adaaff","amp;dn":"Nate+Silver%3A+Picking+apart+the+puzzle+of+racism+in+elections","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6f9a1513300ede422796cb2bc5d36d34adaaff","infoHashBuffer":{"type":"Buffer","data":[76,111,154,21,19,48,14,222,66,39,150,203,43,197,211,109,52,173,170,255]},"announce":[],"urlList":[]}}