{"title":"Anatomy of t.A.T.u","uid":6439687,"size":1535088585,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4d260c04720236cb9be378151803f8ede6401d28&amp;dn=Anatomy+of+t.A.T.u&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tatuDowns","files":-1,"time":1306942982,"description":"!!!With English Subtitles!!!\n\nNFO: &lt;a href=&quot;\nhttp://nfomation.net/info/1306935395.Anatomy_of_t.A.T.u._by_tatuDowns.nfo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nfomation.net/info/1306935395.Anatomy_of_t.A.T.u._by_tatuDowns.nfo&lt;/a&gt;\n\nSpoken Language: Russian\n\nSubtitles: English\n\nContent:\n\nReleased on DVD Vitaly Mansky's documentary about group t.A.T.u.\n&quot;The Anatomy of t.A.T.u.&quot; which was aired on television via the STS channel. \n\nThe film was very anticipated and talked about. The interest in artists' lives and scandals behind the scenes never fails. The format of the film - a collection of monologues, dialogues and general scenes. The actions take place behind the scenes of the tours in the US, England and on the Eurovision contest. The film portrays the everyday lives of the t.A.T.u. girls. To name one, it suggests how Julia and Lena are not lesbians, that they've never been such and never thought about being that way before the project.\n\nIt's all just a myth, a clever image. Julia, for one, as it is implied, has a boyfriend named Pasha, who follows her everywhere. Both girls were baptized. \n\nLena visits church regularly and confesses her sins. Lena admits that most of the things she has to do are sins. Julia, on the other hand, is ready to do anything to be popular. She isn't afraid of anything apart from loneliness. Lena is shyer, and she says she would never have sex with anyone in front of the cameras. \n\nThe film tells that Julia had problems with her voice for a long period of time, which nearly killed the group. Besides this, Julia admitted that she also had an unwanted pregnancy, and she was forced to have an abortion. This is by far not all of what the girls and other people involved in Tatu have spoken about, and what the film showed. There are a lot more scenes and parts of the film, which I will not reveal!\n\t\t","torrent":{"xt":"urn:btih:4d260c04720236cb9be378151803f8ede6401d28","amp;dn":"Anatomy+of+t.A.T.u","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d260c04720236cb9be378151803f8ede6401d28","infoHashBuffer":{"type":"Buffer","data":[77,38,12,4,114,2,54,203,155,227,120,21,24,3,248,237,230,64,29,40]},"announce":[],"urlList":[]}}