{"title":"Supernatural - Season 4  Episodes 1-5","uid":4524037,"size":1617166961,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d4aa531bf44219f36113fa2689ee0fec8b0376e&amp;dn=Supernatural+-+Season+4++Episodes+1-5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"poppypoi","files":6,"time":1227284780,"description":"&amp;#039;SCARY JUST GOT SEXY!&amp;#039;\n\nHow true these words are!  This show follows the travels of the Winchester brothers, Dean and Sam, who search out the paranormal with a vengeance and help save many lives from vampires, werewolves, ghosts, you name it they&amp;#039;ve killed it!\n\nJensen Ackles (from Dawson&amp;#039;s Creek, Smallville and Dark Angel) is the older brother, Dean, who looks after his younger brother, Sam, played by Jared Padalecki (from The Gilmore Girls) who has psychic powers from his encounter with a demon when he was a baby and his mother was killed.  The brothers&amp;#039; father, John,played by Jeffrey Dean Morgan (P.S. I Love You, Grey&amp;#039;s Anatomy) trained them from an early age to be hunters but Sam left to begin a normal life at college and met Jessica, who he fell in love with.  When John went missing Dean turned to Sam for help, then when Jess was killed by the yellow-eyed demon who had killed their mother, Mary, the brothers went back on the road to seek vengeance and help others who were desperate.\n\nThis is the fourth season of the show and it keeps getting better and hotter, now the brothers have met other hunters who know of Sam&amp;#039;s powers and what the demon wants with Sam and the others like him,  they also have to deal with Dean&amp;#039;s escape from hell and the one who made it possible, what does this powerful being want and what is happening to Sam.  Horror, mystery, romance and humour make this show extremely enjoyable.","torrent":{"xt":"urn:btih:4d4aa531bf44219f36113fa2689ee0fec8b0376e","amp;dn":"Supernatural+-+Season+4++Episodes+1-5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d4aa531bf44219f36113fa2689ee0fec8b0376e","infoHashBuffer":{"type":"Buffer","data":[77,74,165,49,191,68,33,159,54,17,63,162,104,158,224,254,200,176,55,110]},"announce":[],"urlList":[]}}