{"title":"Glass Tiger - Someday","uid":4423944,"size":131350532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4d9fb217b7c7466957c7653c3c6e2bda0a8917b4&amp;dn=Glass+Tiger+-+Someday&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1222925760,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nGlass Tiger is a Canadian rock band formed in 1983, in Newmarket, Ontario.\n\nOriginally named 'Tokyo', the band produced several hit singles in Canada and placed two songs on Billboard magazine's top 10: &quot;Don't Forget Me (When I'm Gone)&quot; and &quot;Someday,&quot; both of which came from their debut album, The Thin Red Line (1986), produced by Jim Vallance.\n\nGlass Tiger won three Juno Awards in 1986 and two more in 1987. They were also nominated for a Grammy Award in 1987. After their third album Simple Mission and a brief Canadian tour in early 1993, the band went on a lengthy hiatus. Lead singer Alan Frew released two solo albums before the band reformed and began touring again around 2003.\n\nOn 6 November 2004 Glass Tiger hosted a Saturday night retro show on CIQB-FM in Barrie, Ontario under the direction of station program director Darren Stevens.\n\nIn 2005 the band released a new DVD collection No Turning Back. On June 23, 2005, they appeared on the NBC television show Hit Me Baby One More Time, performing their classic hit &quot;Don't Forget Me (When I'm Gone)&quot; and covering &quot;Everything You Want&quot; (originally recorded by Vertical Horizon). Although they lost the audience voting to Thelma Houston, Glass Tiger were judged the winners by online voters.\n\nIn a mid-2006 interview on Entertainment Tonight Canada, Glass Tiger hinted they were back in the studio to record new material. Meanwhile, the band continues to tour throughout Canada. A new DVD titled &quot;Glass Tiger Live in Concert&quot; featuring the band in concert from the 1980s was also released in 2006.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4d9fb217b7c7466957c7653c3c6e2bda0a8917b4","amp;dn":"Glass+Tiger+-+Someday","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d9fb217b7c7466957c7653c3c6e2bda0a8917b4","infoHashBuffer":{"type":"Buffer","data":[77,159,178,23,183,199,70,105,87,199,101,60,60,110,43,218,10,137,23,180]},"announce":[],"urlList":[]}}