{"title":"Groovatron - Live @ Lafayette Brewing Company","uid":4465416,"size":135361606,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:514c30b327749acac26fd6b2bad2b27c298c1b1f&amp;dn=Groovatron+-+Live+%40+Lafayette+Brewing+Company&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HippieMafia","files":15,"time":1224891637,"description":"Groovatron - Live @ Lafayette Brewing Company\n\nGroovatron will rock you, plain and simple. While total schizophrenia and blatant attention deficit disorder might seem like unwanted ailments in modern times, Groovatron embraces these so called disorders to create a form of music that is part funk, part progressive, and all rock. Powered by the thumping bass of Tony Qualls, the rhythmic intensity of Andy Dumaresq and Steve Pesich, the wailing guitars of Marc Quagliara and Nick Ferrer, and the soulful, sultry saxophone of Tony McCullough, this six-headed beast is sure to satisfy the most savage of musical lusts and entertain even the most discerning of fans.\n\nTo say a Groovatron concert is more like a kick ass rock show is accurate, but that is not the wholestory. Bringing together 6 attention hungry 20-somethings with twisted senses of humor has atendency to instigate some very outlandish theatrics. A Groovatron show is just that, a show. It is anexperience to behold, a veritable feast for both the ears and eyes. The members of Groovatron feel that it is important to entertain, as well as rock your socks off. \n\nPlaying off their desires to entertain, Groovatron has developed a stage show that is constantly evolving. Now, this isnÃƒÂ¢??t some sort of rehearsed play like your high schoolÃƒÂ¢??s version of the Music Man. The Groovatron stage show can take any number of forms, from synchronized dancing, matching (and sometimes non-matching) costumes, or full blown skits including pajama jammy jams, beach parties, interstellar robot fights, and 70ÃƒÂ¢??s funk parties. \n\nVoted the &quot;Best Breakthrough Performance&quot; of the 15,000 person Wakarusa Music Festival by Jambase.com in 2006, Groovatron has begun to be nationally recognized as a must see band. Their exploits have become a huge part of burgeoning summer festival scene. Additionally, members of The String Cheese Incident, moe., UmphreyÃƒÂ¢??s McGee, and more, have all appeared as guest musicians at a Groovatron show. With over 600 live performances under their belts, the Groovatron show continues to get stronger and stronger. This train is coming for you, whether you like it or not. So, come prepared; you will be rocked!\n-----------------------------------------------------------------------------------\nMy Review:\n\nI have seen these guys numerous times and met them a few other times.\nThis band is sick Schizo-Funk,Improv,and straight out rock band that don't stick to any particuliar genre.\nThey will leave you sideways after a live show ;)\nGroovatron is BIG in the Midwest american music scene and should be reconginzed world-wide.\nGive them a go and leave me a comment.\nLet's see what the world think's of this six head beast known as Groovatron.\n\nEnjoy this fine musical artwork.\n","torrent":{"xt":"urn:btih:514c30b327749acac26fd6b2bad2b27c298c1b1f","amp;dn":"Groovatron+-+Live+%40+Lafayette+Brewing+Company","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514c30b327749acac26fd6b2bad2b27c298c1b1f","infoHashBuffer":{"type":"Buffer","data":[81,76,48,179,39,116,154,202,194,111,214,178,186,210,178,124,41,140,27,31]},"announce":[],"urlList":[]}}