{"title":"Drop Dead, Gorgeous (Discography 2006-2009) [iTunes Plus]","uid":9114376,"size":300042486,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:53214c4424a6a906058357477e8d2252bc54bb3b&amp;dn=Drop+Dead%2C+Gorgeous+%28Discography+2006-2009%29+%5BiTunes+Plus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"phcm4a","files":-1,"time":1383000470,"description":"Artist: Drop Dead, Gorgeous\nYear: 2006-2009\nGenre: Metalcore / Post-Hardcore\nQuality: 256kbps AAC\nAlbums:\n2006 - Be Mine, Valentine\n2006 - In Vogue\n2007 - Worse Than A Fairy Tale\n2009 - The Hot N' Heavy\n\nDifferentiating themselves from the 1999 beauty pageant movie of the same name with the strategic placement of a comma, metal/post-hardcore outfit Drop Dead, Gorgeous came together in Denver during the mid-2000s. The group was comprised of Aaron Rothe (vocals/keyboards), Danny Stills (vocals), Danny Cooper (drums), Kyle Browning (guitar), Jake Hansen (bassist), and another Dan (guitar). Using the Internet to their advantage, they signed with Rise Records in September 2005 after being discovered by the label through songs posted on their MySpace and Purevolume web pages. With half of their members still in high school, Drop Dead, Gorgeous had yet to do any extensive touring before or soon after the January 2006 release of their EP, Be Mine, Valentine. The band's debut full-length was issued that May. Titled In Vogue, it was produced by Kris Crummett (Fear Before the March of Flames, Anatomy of a Ghost). Summer was then spent on an extensive nationwide tour, hooking up on various dates with bands like Scars of Tomorrow, Folly, and Calico System. By the year's end, Drop Dead (whose oldest member at the time was still only 20) had inked a deal with the Interscope imprint Suretone and began work on their sophomore effort with producer Ross Robinson. At this point, the band was also trimmed down to five members: two Dans were out (on guitar and drums) and another was in (Danny Passera on drums). The concept of their 2007 release, Worse Than a Fairy Tale, is a fictional account of a serial killer on the loose in a small town.","torrent":{"xt":"urn:btih:53214c4424a6a906058357477e8d2252bc54bb3b","amp;dn":"Drop+Dead%2C+Gorgeous+%28Discography+2006-2009%29+%5BiTunes+Plus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53214c4424a6a906058357477e8d2252bc54bb3b","infoHashBuffer":{"type":"Buffer","data":[83,33,76,68,36,166,169,6,5,131,87,71,126,141,34,82,188,84,187,59]},"announce":[],"urlList":[]}}