{"title":"SHOUT S/T 1997 80's Hard Rock","uid":5600520,"size":129237347,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5339c10ddb75285a472058894fd8d5198c2c8b42&amp;dn=SHOUT+S%2FT+1997+80%5C%27s+Hard+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":14,"time":1275280090,"description":"SHOUT - SHOUT (1997, ESCAPE MUSIC, ESM 014)\nJohn Levesque - vocals\nBrian Maher - guitars\nTommy Plevin - guitars\nMark Normand - bass\nDrew Ferrante - drums\n\nBackground\nNot to be confused with Ken Tamplin's Christian metal band of the same name, this lot came from the other side of the continent - Boston, and were formed around vocalist John Levesque. The band released an LP called 'Finger On The Trigger' which came out in 1987 on their own label Shout Enterprises. Many years later, the LP would receive a 10/10 review by AOR Classics magazine, which prompted many to go on a hunt for it. This must have 'triggered' the attention of the folks at Escape Music, because in 1997 the label released a CD by the band, strangely titled 'Shout' and containing some of the songs found on 'FOTT'. I think this is pretty reasonable hair-metal with a good grasp of the basics. Soundwise, they mix it up, with Gravedanger at one end of their musical spectrum, Sic Vikki in the middle with Kiss bringing up the rear, as is their usual night-time position.. lol! But generally, there are many influences here. You pick 'em! The album was produced by 38 Special staffie Tom Soares and the band's drummer Drew Ferrante.\n\nThe Songs\nThe opening duo of 'Breakin' All The Rules' and 'Love Is A Drug' sets the scene admirably, the latter is a mix of Icon and Keel. There are some nice moves on 'No More Lies' that takes on the appearance of Leatherwolf on heat! Changing pace is the ballad 'If It's Love', with big chant-along choruses, while 'Madness' is a big pumping and bass-pulsed effort. The lyrics include the phrase 'finger on the trigger'.. I am wondering where this fits in to the overall scheme of things.. Hmm. Elsewhere, my favorite tracks include 'Heartbeat', which is a huge 80's era Kiss soundalike, with big choruses and (I can imagine) big hair to boot. Then there's the hair-metal splendour of 'Bad Girls', plus the excellent 'Tonite Your Mine' which is so 80's!\n\nIn Summary\nThis 1997 CD is a retrospective effort undoubtedly, the band stuck in an 80's groove as if it were Groundhog Day! Of course, Levesque would go on to form Wild Horses (the American version) with two members of Kingdom Come in James Kottak and Rick Stier, though they would only last for one album.. 1991's 'Bareback'. Levesque would go on to join Legs Diamond, and would sing on their 2005 'Diamonds Are Forever'. Vinyl completists might be better advised to seek out the original vinyl LP of 'Finger On The Trigger' for posterity's sake, or if you really feel up to it, contact Sam at Retrospect Records and see what he can do..\n\nTrack Listing:\n01 Breakin' All The Rules\n02 Love Is A Drug\n03 No More Lies\n04 Stuck In The Middle\n05 If It's Love\n06 Rip It Out\n07 Heartbeat\n08 Rockin' In Stride\n09 Bad Girls\n10 Madness\n11 Tonite Your Mine\n12 Lady Ice\n13 The Riddle Song\n","torrent":{"xt":"urn:btih:5339c10ddb75285a472058894fd8d5198c2c8b42","amp;dn":"SHOUT+S%2FT+1997+80%5C%27s+Hard+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5339c10ddb75285a472058894fd8d5198c2c8b42","infoHashBuffer":{"type":"Buffer","data":[83,57,193,13,219,117,40,90,71,32,88,137,79,216,213,25,140,44,139,66]},"announce":[],"urlList":[]}}