{"title":"Montrose - 'Paper Money' [320k MP3]","uid":4646149,"size":84500660,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:564b0a0d4479810a0479d608f526e17a2195b055&amp;dn=Montrose+-+%5C%27Paper+Money%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smbdownload","files":-1,"time":1231887385,"description":"Paper Money is the second album by the band Montrose. It was released in 1974 and was the last album to feature Sammy Hagar as lead vocalist. Ronnie Montrose sang lead vocals on &quot;We're Going Home&quot;.\n\nOriginal bassist Bill Church left the band before this album was recorded and was replaced with Alan Fitzgerald.\n\nAlthough the liner notes for the CD edition of Paper Money said that Ronnie was offered to play lead guitar for Mott the Hoople when he left the Edgar Winter Group, Ronnie says that this never happened and was just a rumor.\n\n&quot;I Got the Fire&quot; was later covered by Iron Maiden.\n\n\nPAPER MONEY [320k MP3]\n\n   1. Underground \n   2. Connection  \n   3. The Dreamer \n   4. Starliner \n   5. I Got The Fire \n   6. Spaceage Sacrifice \n   7. We're Going Home \n   8. Paper Money \n\n---------------------------------------------------------------------------------\n\nMontrose was a Californian hard rock band. The band featured Ronnie Montrose on guitar and future solo star and Van Halen member Sammy Hagar. Rounding out the foursome on their Ted Templeman-produced debut, Montrose (Warner Bros., 1973), were bassist Bill Church and drummer Denny Carmassi. The original line-up lasted long enough to make just this one album. The first member to leave was Bill Church who was later replaced by Alan Fitzgerald for the band's second and final album with Hagar on vocals, Paper Money (Warner Bros., 1974). After departing, Hagar released a succession of solo albums in the mid-to-late 70s and early 80s (often with the remaining members of Montrose) as well as a one-off album with the band HSAS (Hagar Schon Aaronson Shrieve). He joined Van Halen in the mid 1980s. As a band Montrose released a further two albums on Warner Bros., Warner Brothers Presents... Montrose! (1975) and Jump On It, both featuring Bob James on vocals, and new member Jim Alcivar on keyboards. On Jump On It Fitzgerald was replaced on bass by Randy Jo Hobbs.\n\nPrior to forming the band Ronnie Montrose had been a successful session musician (playing, along with Bill Church on Van Morrison's 1971 Tupelo Honey album, also produced by Ted Templeman, and on albums by Beaver &amp; Krause and Herbie Hancock). He was also a member of the Edgar Winter Group, playing on such hit singles as 'Free Ride', which was from the best-selling album 'They Only Come Out at Night' (1972). The guitarist later formed another band in the hard rock mould in the early 1980s, named Gamma, who featured Denny Carmassi, of the original Montrose band and late of Sammy Hagar's band, Jim Alcivar from Montrose, and a Scottish singer named Davey Pattison.\n\nIn its original incarnation, Gamma released several albums on Elektra records ('Gamma 1', 'Gamma 2', and 'Gamma 3') before splitting.\n\nThe original Montrose line-up reunited on Sammy Hagar's Marching to Mars (1997) performing &quot;Leaving the Warmth of the Womb&quot; and on stage as an encore at a few Sammy concerts in 2003 and 2005\n\n","torrent":{"xt":"urn:btih:564b0a0d4479810a0479d608f526e17a2195b055","amp;dn":"Montrose+-+%5C%27Paper+Money%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"564b0a0d4479810a0479d608f526e17a2195b055","infoHashBuffer":{"type":"Buffer","data":[86,75,10,13,68,121,129,10,4,121,214,8,245,38,225,122,33,149,176,85]},"announce":[],"urlList":[]}}