{"title":"Nelly Furtado - Say It Right","uid":4562182,"size":134649860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:56d5e1baab2da69dfae4c936f980b412df956f46&amp;dn=Nelly+Furtado+-+Say+It+Right&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1228721619,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Say It Right&quot; is a single released by Canadian singer Nelly Furtado. It was written by Nelly Furtado, Timothy &quot;Timbaland&quot; Mosley and Nate &quot;Danja&quot; Hills for Furtado&amp;#039;s third album, Loose (2006). It was co-produced by Timbaland and Danja and released as the album&amp;#039;s third single in North America and Australia. The song served as the album&amp;#039;s fourth single in Europe and Asia, and it was released digitally in the United Kingdom in March 2007. It was the album&amp;#039;s fifth single in Latin America. The song reached number-one in more than twenty countries including Spain, France, New Zealand, Canada and the United States.\n\nThe music video for &quot;Say It Right&quot; was directed by British duo Rankin &amp; Chris and filmed in Los Angeles, California in late October 2006. It was shot back-to-back with the video for &quot;All Good Things (Come to an End)&quot;, the album&amp;#039;s third single in Europe. Furtado called the video her &quot;first action thing&quot; since the video for her 2000 single, &quot;I&amp;#039;m like a Bird&quot;, and said that it featured her experiencing what she called &quot;a total rock-star moment. It&amp;#039;s so iconic.&quot; The mini-feathered cocktail dress Furtado wears at the opening of the video was designed specifically for her by Australian designer Alex Perry, who said, &quot;It&amp;#039;s so cool because she&amp;#039;s just undergone a bit of a revamp from what her previous image was; she&amp;#039;s become a little more sexy and glamorous.&quot;\n\nThe clip starts with a helicopter landing on a black helipad bearing Furtado&amp;#039;s name on top of a building, and Furtado getting out. She is shown on the roof of the building throughout the video, with the Los Angeles skyline in the background. The video features mostly face shots of her and Timbaland intercut with shots of dancers. Furtado described the clip as &quot;a throwback to the &amp;#039;80s ... the more surreal side&quot; because the shots of her and Timbaland reminded her much of those of Annie Lennox and Dave Stewart in videos for Eurythmics&amp;#039; singles, and &quot;the strange relationship [they] had, where ... you get this intense vibe from it. And Tim and me, we&amp;#039;re partners, we vibe on a serious creative level, so the video captures that energy.&quot; The video ends with Furtado climbing back into the helicopter, which flies off.\n\nThe video debuted on MTV&amp;#039;s Total Request Live in the U.S. on November 6 and on Canada&amp;#039;s MuchMusic in the week ending November 16. It reached number nine on the Total Request Live top ten video countdown on November 8, its first day on the countdown; it returned to the countdown on December 14 and peaked at number one twice. The video reached number one on the MuchMusic series Countdown for the week ending February 16. The &quot;Say It Right&quot; video was retired from TRL after spending forty days on the countdown. At the 2007 MTV Video Music Awards, Furtado was nominated in the category of Female Artist of the Year for &quot;Say It Right&quot; and &quot;Maneater&quot;. &quot;Say It Right&quot; was nominated for the MuchMoreMusic Award and in the Best International Video by a Canadian category at the 2007 MuchMusic Video Awards. MTV International certified the &quot;Say It Right&quot; video platinum for more than 6,000 plays on the MTV network.\n\nIn the website YouTube, the video is ranked 28th in the most watched music videos in the world, having more than 37 million views and was Furtado&amp;#039;s most watched music video.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:56d5e1baab2da69dfae4c936f980b412df956f46","amp;dn":"Nelly+Furtado+-+Say+It+Right","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56d5e1baab2da69dfae4c936f980b412df956f46","infoHashBuffer":{"type":"Buffer","data":[86,213,225,186,171,45,166,157,250,228,201,54,249,128,180,18,223,149,111,70]},"announce":[],"urlList":[]}}