{"title":"StartisBack+ 1.0 -=[HajrullaH]=-","uid":9044232,"size":1195133,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:570970c03941c142b908fa06d9d7b13a35a8c9b6&amp;dn=StartisBack%2B+1.0+-%3D%5BHajrullaH%5D%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hajrullah","files":-1,"time":1381709159,"description":"Windows 8.1 upgrade\n\nDo I still need StartIsBack as Windows 8.1 has its own Start button?\n\nYes. The Windows 8.1 still does not have a proper Start menu.\n\nWill StartIsBack work on Windows 8.1 and Windows Server 2012 R2?\n\nYes! New version of StartIsBack, called StartIsBack+, is available for Windows 8.1.\n\nI have Windows 8 and StartIsBack. How do I upgrade to Windows 8.1?\n\nBefore upgrading to Windows 8.1, ensure you have StartIsBack version 2.0 or above. If you have earlier version you must update StartIsBack.\nOnce you upgrade Windows 8 to Windows 8.1 you must install StartIsBack+. You don't have to uninstall StartIsBack; your settings and license will be kept.\n\nWill I need to buy new key for the program on Windows 8.1?\n\nNo! Your license key will work for both StartIsBack and StartIsBack+.\nFeatures\n\nHow do I configure Start Menu?\n\nEither right-click Start button and click &quot;Properties&quot; or right-click opened Start Menu itself and choose &quot;Properties&quot; context menu item.\n\nHow do I invoke new Windows 8 Start Screen?\n\nEither press Ctrl+Win (configurable shortcut) or click Start button with mouse wheel. If mouse wheel click is not working, you may need to tweak your mouse driver.\n\nIf I turn my Start Screen into Apps Screen, will I be able to undo it?\n\nYes. You can disable this feature at any moment and your desktop shortcuts will return to their places.\n\nHow do I rearrange programs in All Programs list?\n\nYou can rearrange folders and programs in All Programs list, both in Windows 7 and Windows XP mode, if you uncheck &quot;Sort All Programs menu by name&quot; option.\n\nCan I integrate StartIsBack into my Windows installation?\n\nYes; the easiest way would be to create image of installation with StartIsBack installed, with tool like RecImg. Download Deployment Guide to find more.\n\nHow do I uninstall StartIsBack?\n\nAs expected: go to Control Panel - Programs and Features, find StartIsBack and click Uninstall.","torrent":{"xt":"urn:btih:570970c03941c142b908fa06d9d7b13a35a8c9b6","amp;dn":"StartisBack%2B+1.0+-%3D%5BHajrullaH%5D%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"570970c03941c142b908fa06d9d7b13a35a8c9b6","infoHashBuffer":{"type":"Buffer","data":[87,9,112,192,57,65,193,66,185,8,250,6,217,215,177,58,53,168,201,182]},"announce":[],"urlList":[]}}