{"title":"Castellari, Enzo G - Bronx Warriors (1982).avi","uid":3834118,"size":739273110,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:592a60e2f0d64ac6ba31bf7869ee6ee3422577c9&amp;dn=Castellari%2C+Enzo+G+-+Bronx+Warriors+%281982%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kottkvarn","files":1,"time":1191801812,"description":"From wikipedia:\n\n\n\\&quot;1990: The Bronx Warriors is a 1982 Italian exploitation movie by genre director Enzo G. Castellari.\n\nSimilar in theme to both John Carpenter\\&amp;#039;s Escape from New York and Walter Hill\\&amp;#039;s The Warriors, the film features a \\&quot;forbidden zone\\&quot; within New York\\&amp;#039;s Bronx district, abandoned by the police and controlled by various street gangs who maintain a fragile semblance of order through turf lines. When a young girl, about to inherit a vastly powerful arms company runs away into the territory, a psychotic mercenary is sent in to retrieve her, turning the Bronx into a war zone.\n\nAlthough fairly dated now, Bronx Warriors was ahead of the competition at its time of release in 1983 with a powerful synthesised music score, a highly innovative credits sequence (montage of various street gang paraphenalia) and a very effective opening scene involving a vicious fight between the Riders and the Zombies gangs while 17 year old Anne cowers in terror watching the carnage unfold, momentarily forgotten by the gang members before being given protection by the Riders\\&amp;#039; leader Trash.\n\nNumber one on the American Billboard charts for 3 weeks in 1983, the movie has retained a cult following spawning both a sequel in 1985 (Escape From the Bronx) and a fan website in 2004.\n\nThis was the penultimate movie of stalwart actor Vic Morrow who died the same year as Bronx Warrior\\&amp;#039;s release while filming The Twilight Zone movie. Because of his death somebody else had to dub his voice. It also stars Fred Williamson as \\&quot;King of the Bronx\\&quot; The Ogre, leader of the most powerful Bronx gang the Tigers who takes on the role with his usual charismatic flair.\\&quot;\n\nLength: 1:36:32","torrent":{"xt":"urn:btih:592a60e2f0d64ac6ba31bf7869ee6ee3422577c9","amp;dn":"Castellari%2C+Enzo+G+-+Bronx+Warriors+%281982%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"592a60e2f0d64ac6ba31bf7869ee6ee3422577c9","infoHashBuffer":{"type":"Buffer","data":[89,42,96,226,240,214,74,198,186,49,191,120,105,238,110,227,66,37,119,201]},"announce":[],"urlList":[]}}