{"title":"Nokia Offline maps 2.0 Asia","uid":4948229,"size":423676169,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:5a24e72d7dc9b7aa6de3e99fa522ab087bd20924&amp;dn=Nokia+Offline+maps+2.0+Asia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mirzasghar","files":2,"time":1244757278,"description":"Description\nThese are the direct download links for Nokia's worldwide maps - you can download each continent separately. Nokia encourages the use of Map Loader for this process but it has many frustrating issues. Firstly, it is hard to back up and transfer the maps to other computers - a problem in more remote locations or for people with slow internet connections. Also, downloading the Nokia maps directly tends to be quicker as you don't have to wait for the Nokia software to grind its way through the process - this is something you have to restart each time if there is a problem with the transfer.\n\nImportantly, downloading the maps directly can avoid the frustrating error: 'Connection to Storage Medium interrupted. Attach your storage medium and retry.' Also, when you upgrade your Nokia software, often it will wipe the contents of your phone, requiring you to start all over again and download the maps. The total size of all the files is over 3000MB, so it's not something you want to be doing on a regular basis.\n\nInstructions\nMake sure you have an unzipping program on your computer\nInstall Nokia Maps and run it while your phone is connected to your computer - this will create some important file structures on your Nokia phone. Exit the Maps application.\nIn a temporary folder on your PC, unzip the Nokia map files that you have downloaded and make sure you leave the file structure in tact. These will be a group of 16 folders with names 0, 1, 2, all the way to 9, then a, b, c, d, e, and f.\nCheck that your phone is connected and visible in Windows Explorer. Double click on the phone and look for the folder called diskcache. Typically it is [Phone model or Removable Disk]/cities/diskcache (see picture below). This may vary slightly betwen phone models. Open the diskcache folder.\nCopy all the unzipped contents over to the diskcache directory.\nRepeat for each continent.\nImportant note: these files are downloaded directly from Nokia's servers.\n\n\n\nThe usual location of the Nokia Map files\non a Nokia phone.\n\n\n\n\nYou are here: Download worldwide maps for Nokia Maps 2.0 via direct download - its faster, ideal for backups or offline and will avoid the Nokia Map Loader error: Connection to Storage Medium interrupted, Attach your storage medium and retry.\n\n\nPlease seeeeeeeeeeeeeeeed\n\n","torrent":{"xt":"urn:btih:5a24e72d7dc9b7aa6de3e99fa522ab087bd20924","amp;dn":"Nokia+Offline+maps+2.0+Asia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a24e72d7dc9b7aa6de3e99fa522ab087bd20924","infoHashBuffer":{"type":"Buffer","data":[90,36,231,45,125,201,183,170,109,227,233,159,165,34,171,8,123,210,9,36]},"announce":[],"urlList":[]}}