{"title":"Bloodwood Cannibals (2011) DVDRip {DragonTrG}","uid":6168071,"size":795979880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5aa6ccdeba92dd6a7e48d3ec2765d0d2e0ec42a5&amp;dn=Bloodwood+Cannibals+%282011%29+DVDRip+%7BDragonTrG%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Horrorspoke","files":-1,"time":1297459370,"description":"PLOT:\n\nThe crew of an internet reality series falls prey to a family of\nmurderous cannibals while hunting Bigfoot in the remote forest.\n'Hunting the Unknown' host Nigel Thorne isn't above faking evidence of the paranormal in order to get more hits on his website. When Nigel and his crew venture deep in the woods on a mission to find\nBigfoot, they're shocked to capture a feral woman who appears to\nhave recently given birth. Surmising that the rest of the clan could be close by, Nigel and his crew treads deeper into the woodlands in hopes of catching a glimpse of their captive's mate. But when the hunters become the hunted, the crew's only hope for survival rests in the hands of a wilderness guide and ex-military man whose\nhumanity has been slowly eroded by the horrors he has witnessed\nthroughout the years.\n\n\nREVIEW:\n\nAt first, I thought this movie was going to be so low budget that it'd be unwatchable, but I overcame the impulse to turn it off and soldiered on. Am I glad that I did? I suppose so. Some of the special effects were laughably bad (which kind of kills the appeal of watching a splatter movie), the acting was atrocious in a few scenes (I suppose they didn't have enough money to reshoot those scenes, unfortunately), and the whole virus/cannibal thing was pretty old ten years ago, but -- and here's the thing that saved the movie for me -- it was done with such enthusiasm, I couldn't help but like it. I can't really recommend this movie to anyone except Troma fans, who are likely to forgive the flaws in any movie that has nudity and gore. Just be forewarned that the nudity is fleeting and the gore very cheaply done.\n\nI hope that if the director does more movies, they won't be as stereotypical and uncreative, but, as a first effort, this really isn't so bad. Even James Cameron had to start with Piranha 2.\n\n\nNot much to do with this one as this is such a low budget movie. The video is acceptable, But it's what you expect from a B-Flick I think!\n\n\nSCREENS:\n &lt;a href=&quot;\nhttp://image.bayimg.com/padpfaadm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/padpfaadm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/padphaadm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/padphaadm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/padpiaadm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/padpiaadm.jpg&lt;/a&gt;\n\nSEED AND ENJOY!!","torrent":{"xt":"urn:btih:5aa6ccdeba92dd6a7e48d3ec2765d0d2e0ec42a5","amp;dn":"Bloodwood+Cannibals+%282011%29+DVDRip+%7BDragonTrG%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa6ccdeba92dd6a7e48d3ec2765d0d2e0ec42a5","infoHashBuffer":{"type":"Buffer","data":[90,166,204,222,186,146,221,106,126,72,211,236,39,101,208,210,224,236,66,165]},"announce":[],"urlList":[]}}