{"title":"The Living Daylights - DVD-rip - James bond","uid":5276423,"size":6819708066,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5b173980f6a47eac425a9577528e47e588af6c73&amp;dn=The+Living+Daylights+-+DVD-rip+-+James+bond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tim0611","files":-1,"time":1263393157,"description":"The Living Daylights (1987)\nLanguage: English\nSub: NL/ENG/GR/Dan/Fin/Norway/Swedish\nDuration: 125 min\n\nJames Bond 007's mission is to firstly, organise the defection of a top Soviet general. When the general is re-captured, Bond heads off to find why an ally of General Koskov was sent to murder him. Bond's mission continues to take him to Afghanistan, where he must confront an arms dealer known as Brad Whitaker. Everything eventually reveals its self to Bond. Written by simon \n\nJames Bond finds himself helping a Soviet general escape from the Iron Curtain only to see a cellist holding a rifle on his subject. When the general is recaptured, Bond decides to track him by finding out why a concert cello player would try and kill her benefactor. He escapes with her first to Vienna, then to Morocco, finally ending up in a prison in Soviet occupied Afghanistan as he tracks down the elements in this mystery. Written by John Vogel \n\nAfter Bond helps Russian officer Georgi Koskov make a daring defection to the West, the intelligence community is shocked when Koskov is abducted from his remote hiding place. Bond leaps into action, following a trail that leads to the gorgeous Kara, who plays Bond as easily as she plays her Stradivari cello. As they unravel a complex weapons scheme with global implications, they are forced into hair-raising chases, a riveting jailbreak and an epic battle in the Afghanistan desert with tanks, airplanes and a legion of freedom fighters on horseback.\n\nDuring a training operation, a &quot;00&quot; agent is unexpectedly murdered. When British agent James Bond organises the defection of a top ranking Soviet general, the general divulges a plan by the KGB to kill all its enemy agents. Bond is suspicious of the plot, but nevertheless is ordered to kill the KGB officer masterminding the operation. \n\n","torrent":{"xt":"urn:btih:5b173980f6a47eac425a9577528e47e588af6c73","amp;dn":"The+Living+Daylights+-+DVD-rip+-+James+bond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b173980f6a47eac425a9577528e47e588af6c73","infoHashBuffer":{"type":"Buffer","data":[91,23,57,128,246,164,126,172,66,90,149,119,82,142,71,229,136,175,108,115]},"announce":[],"urlList":[]}}