{"title":"Consenting Adults. TVRip. Excellent Digital Quality!","uid":3806726,"size":1754009600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:607c6280186ad39c6a16c34476d2d5ad22a4b389&amp;dn=Consenting+Adults.+TVRip.+Excellent+Digital+Quality%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"DejaVu2005","files":1,"time":1189803257,"description":"CONSENTING ADULTS\nSaturday 29 September 2007 12.50am-2.10am (Friday night)\n\n\nA 75-minute special transmitted to commemorate 50 years since a key moment in British social and cultural history: the publication of the Wolfenden Report, which led to the eventual decriminalisation of homosexuality.\n\nThe Wolfenden Committee was established to look into the law relating to Homosexual Offences and Prostitution in September 1954 and this documentary follows the diverse members of the committee as they struggle towards their radical conclusions. Its principal recommendation remains a turning point in British history, even though the legislation took another ten years to reach the statute book (and even longer in Scotland and Northern Ireland).\n\nThe film, written by Julian Mitchell, unravels the inherent drama of the situation by dramatising transcripts of the original committee hearings. A rich cast of committee members and witnesses is combined with fictionalised moments in the corridors of power.\n\nBut the public drama is mixed with the private personal conflict between Wolfenden and his son, Jeremy, then a brilliant undergraduate at Oxford. Committee chairman John Wolfenden, played by Charles Dance (Bleak House, Fingersmith), thought homosexuality &amp;#039;an abomination&amp;#039;, but he knew his own son, played by Sean Biggerstaff (Oliver Wood in the Harry Potter movies), was gay. Despite his personal views, Wolfenden led the committee to conclude that the law should not interfere in the private lives of consenting adults or enforce any particular pattern of behaviour. It was a triumph of reason over instinct.\n\n","torrent":{"xt":"urn:btih:607c6280186ad39c6a16c34476d2d5ad22a4b389","amp;dn":"Consenting+Adults.+TVRip.+Excellent+Digital+Quality%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"607c6280186ad39c6a16c34476d2d5ad22a4b389","infoHashBuffer":{"type":"Buffer","data":[96,124,98,128,24,106,211,156,106,22,195,68,118,210,213,173,34,164,179,137]},"announce":[],"urlList":[]}}