{"title":"Erik Hersman: How texting and GoogleMaps helped Kenyans survive ","uid":4878597,"size":13477672,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:60fb082668d454f5540572b74c2cf7bce2ed5b2f&amp;dn=Erik+Hersman%3A+How+texting+and+GoogleMaps+helped+Kenyans+survive+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263483,"description":"Erik Hersman: How texting and GoogleMaps helped Kenyans survive crisis\n\nAt TEDU 2009, Erik Hersman presents the remarkable story of Ushahidi, a GoogleMap mashup that allowed Kenyans to report and track violence via cell phone texts following the 2008 elections, and has evolved to continue saving lives in other countries.\n\nErik Hersman grew up in Kenya and Sudan and is, as he puts it, &quot;one of those guys who's much more 'at home' in Africa.&quot; From his home in the US, he keeps two influential blogs: WhiteAfrican, where he writes about technology on the African continent, and AfriGadget, a group blog that celebrates African ingenuity.\n\nDuring the Kenyan post-election crisis of 2007-2008, Hersman helped create the website Ushahidi, a place to report incidents of violence via the web and texts. The original Ushahidi tool was written in two days; later that year, it won the NetSquared Mashup Challenge (and a nice check to help further development). Now the Ushahidi team's next project is to build the Ushahidi Engine, a free and open-source tool for crowdsourcing information and seeing communities online. And you can help.\n\nErik Hersman is an alumnus of the TED Fellows program, having attended TEDGlobal 2007 in Arusha, Tanzania, and TED2009 in Long Beach, California. Find out more about the TED Fellows program.\n\n    &quot;The constant bridging of worlds (African and American) started at such a young age that it has become embedded in my character. I find it easy to switch between cultures and enjoy friends and associates on either side of the ocean.&quot;\n\nErik Hersman\n","torrent":{"xt":"urn:btih:60fb082668d454f5540572b74c2cf7bce2ed5b2f","amp;dn":"Erik+Hersman%3A+How+texting+and+GoogleMaps+helped+Kenyans+survive+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60fb082668d454f5540572b74c2cf7bce2ed5b2f","infoHashBuffer":{"type":"Buffer","data":[96,251,8,38,104,212,84,245,84,5,114,183,76,44,247,188,226,237,91,47]},"announce":[],"urlList":[]}}