{"title":"Thrashin DvDrip By Digitaljace.avi","uid":6458118,"size":735608832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:65cd3330d9d1aebb7203702966f2e0316502aef6&amp;dn=Thrashin+DvDrip+By+Digitaljace.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zukke","files":1,"time":1307655146,"description":"&quot;WEST SIDE STORY on skateboards, THRASHIN' is a tale of rivalry between two gangs in which one gang leader's sister falls in love with the opposing gang leader. The gangs this time are &quot;The Ramp Locals,&quot; some affluent Valley kids headed by clean-cut Corey Webster (Josh Brolin, son of James), and &quot;The Daggers,&quot; a gang of hardcore punk rockers in leather led by Tommy Hook (Robert Rusler). Hook's kid sister, the virginal, blonde Chrissy (Pamela Gidley), is visiting from Indiana and ends up falling for Corey, but Hook doesn't want his kid sister anywhere near someone from the Valley. It all builds up to a final competition--the &quot;LA Massacre,&quot; a dangerous 20-mile downhill race through a mountain road in which skateboarders can reach speeds of 60 mph, the winner of which gets a corporate sponsorship. While not very original or even very skillful, THRASHIN' (a skateboarding term for aggressive, gutsy skating) isn't nearly as bad as it sounds. The film takes a look--albeit a superficial one--at a strange subculture that began in Los Angeles and has since spread through the entire country, in which groups of youths identify themselves as skateboarders, much like the bikers and surfers of previous generations. Unfortunately, it doesn't get any deeper than that. There is some phenomenal camerawork, however, much of it shot from a camera attached to the front of a skateboard. While the actors perform their gymnastics in a cement &quot;pool,&quot; on a ramp, or racing down Hollywood Boulevard's sidewalks (at speeds up to 40 mph), the camera zooms along with them. Directed by David Winters, who had a fairly large part in WEST SIDE STORY as A-Rab.&quot;\n\n\nOne of my absolute favorite movies from the 80Ã‚Â´s,\nthis and Breakfast Club and so on...\n\nEnjoy, have been hard to find this one!\n\n/Zukke","torrent":{"xt":"urn:btih:65cd3330d9d1aebb7203702966f2e0316502aef6","amp;dn":"Thrashin+DvDrip+By+Digitaljace.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65cd3330d9d1aebb7203702966f2e0316502aef6","infoHashBuffer":{"type":"Buffer","data":[101,205,51,48,217,209,174,187,114,3,112,41,102,242,224,49,101,2,174,246]},"announce":[],"urlList":[]}}