{"title":"Hashem's Films Excerpts DISC 1","uid":4626696,"size":648289738,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:663cedda88953d6c81431ba2f0c70c6c3f089e72&amp;dn=Hashem%5C%27s+Films+Excerpts+DISC+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ricintoxin","files":1,"time":1231200539,"description":"Hashem`s Films -The Anti christ Dajjal will be a Reptilan Shapeshifter DISC 1 \n618Mb [2:24 hr]    &lt;a href=&quot; http://www.hashemsfilms.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hashemsfilms.com/&lt;/a&gt;\n\nThese are excerpts from Hashem's Films &quot;The Antichrist Dajjal will be a Reptilan Shapeshifter&quot; DVD 1.\nI removed 7 hours of crap from series 1, and encoded it into a single WMV.\n\n\n\n\n==END==\n\n             ___________\n\nHollywood Insiders: Fallen Angels &lt;a href=&quot; http://www.hollywoodinsiders.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hollywoodinsiders.net&lt;/a&gt;\n\nToday's minds are being programmed to accept a single world leader, and with Hollywood's help, they will. In each film lies layers upon layers of occultism, synchronicities, conditioning, programming, desensitization, and symbolism. A repeating story is being told, one whose purpose could only serve the dark elite. By binding together seemingly unconnected Hollywood films, Fallen Angels reveals a nefarious plan to deceive the world into worshiping a mere man; and on the way, exposes writers and producers like Matt Groening ( The Simpsons ), George Lucas ( Starwars ),Joanne Rowling ( Harry Potter ) and Larry/Andy Wachowski ( The Matrix ) as Illuminati insiders. Other movies like Stargate, The Road to El dorado, and Dogma are also part of this repeating story. All of these movies share a common thread, and reveals a storyline every Illuminati member is familiar with.\n             ___________\n\nhollywoods insider fallen angels Aleister Crowley eye all seeing pyramid 666 horus symbol symbolism man would be king symbology mi5 mi6 nazi hitler world portal Rothschild government world trade center 911 9/11 september eleventh alex jones david icke 2001 conspiracy new world order illuminati nwo nau rfid mark beast cia fbi nsa mason freemason occult satan satanism black magic war iraq bin laden lucas jesus devil worship secret society bohemian grove karl rove iran ron paul oil bush george islam opec rense red ice creations economy israel washington freedom fascism loose change terrorstorm endgame reptilian draco orion roswell dulce ufo alien bill rights amero internet2 united states eu euro martial law gmo monsanto nuclear truth rising david rockefeller china russia star wars revelation book bible daniel anti christ antichrist dajjal crisis dollar false flag cheney harry potter campaign liberty constitution show free terror terrorism religion magick subliminal programming mind control crop circles child abuse Psychic Ability Channelling Remote Viewing 2012 Mayan Calendar astrology Mysticism Tarot Numerology Alchemy shape shift shapeshifter astral genetic manipulation jesuit vatican catholic church Leozagami Annunaki wtc william bill cooper mars atlantis egypt history science mothman mothmen prophecy prophecies area 51 enoch quran kuran underground base bases denver airport grey abducted abduction flying sauser impeachment congressman obama christian left right wing Censor Censorship bill clinton hillary theory newage new age enlightenment lucifer iron mountain moon fluoride federal reserve trilateral bilderberg cfr freeman perspective tsarion michael","torrent":{"xt":"urn:btih:663cedda88953d6c81431ba2f0c70c6c3f089e72","amp;dn":"Hashem%5C%27s+Films+Excerpts+DISC+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663cedda88953d6c81431ba2f0c70c6c3f089e72","infoHashBuffer":{"type":"Buffer","data":[102,60,237,218,136,149,61,108,129,67,27,162,240,199,12,108,63,8,158,114]},"announce":[],"urlList":[]}}