{"title":"KOTOR Episode 2 by Kaydon Sentry (mcgreggers99 recode)","uid":5237508,"size":4287432312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67199702708f0d8f6f91d31dc8fcdcaa3239ab63&amp;dn=KOTOR+Episode+2+by+Kaydon+Sentry+%28mcgreggers99+recode%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mcgreggers99","files":2,"time":1261593426,"description":"STAR WARS: KNIGHTS OF THE OLD REPUBLIC\nEPISODE II: VEIL OF THE DARK SIDE\n\nby Kaydon Sentry\n(Mcgreggers99 Recode)\n\n\nSUMMARY\nKaydon Sentry's adaptation of the video game &quot;Star Wars: Knights of the Old Republic&quot; continues in this second installment of the film franchise.\n\nThe crew of the Ebon Hawk travel to Manaan and Tatooine in search of the next Star Maps - artifacts that will lead them to the Star Forge, the Sith Empire's center of power. As Logan and Bastila trace the paths of Revan and Malak, they discover more about each other, and the bond that connects them.\n\n\n\nLINKS\nYou can watch Episode I - or a quick recap - on the Video Site that Must Be Censored (Kaydon's profile is kevinsocal2k6).\nThe forums: http://www.kotormovieforum.co.cc/\n\n\n\nINSTRUCTIONS\nBurn the DVD image file (.iso) to disc, or mount it to a virtual drive. Watch and enjoy!\n\n\n\nDISCLAIMER\n&quot;Knights of the Old Republic: Episode II&quot; is NOT the game - it is a non-profit film - more a labor of love. &quot;Star Wars&quot; is a registered trademark of Lucasfilm LTD., and the KOTOR game and universe is a product of both LucasArts &amp; Bioware. Thank you George Lucas for letting filmmakers go explore in this world. \n\nThis work is to promote and share the lore of the Knights of the Old Republic game series, to those who otherwise wouldn't be able to, due to being either 'non-gamers', or fans who simply don't have the 40+ hours it is required to experience it all. \n\nThis film was not made for money. It was made to introduce to a new audience, as well as its faithful, a fresh and cinematic take on this fascinating era.","torrent":{"xt":"urn:btih:67199702708f0d8f6f91d31dc8fcdcaa3239ab63","amp;dn":"KOTOR+Episode+2+by+Kaydon+Sentry+%28mcgreggers99+recode%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67199702708f0d8f6f91d31dc8fcdcaa3239ab63","infoHashBuffer":{"type":"Buffer","data":[103,25,151,2,112,143,13,143,111,145,211,29,200,252,220,170,50,57,171,99]},"announce":[],"urlList":[]}}