{"title":"Avenged Sevenfold - Nightmare (2nafish)","uid":5794054,"size":192634884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:674a3e5c3b6de9699ef7ccdc8cf8ad658ecfe28e&amp;dn=Avenged+Sevenfold+-+Nightmare+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1282974321,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNightmare is a song by American rock band, Avenged Sevenfold, released as the lead single for their fifth studio album, Nightmare. It is also their first single released without former drummer &quot;The Rev&quot;, who died on December 28, 2009. The song was released digitally on May 18 and 21, 2010 on the US and worldwide, respectively, on iTunes as well as an animated lyric video onwhich received over 275,000 plays in 24 hours. A preview for the song was released on May 6, 2010 on Amazon.com, but was removed soon after for unknown reasons. However, on May 10, 2010, a 30-second audio uncensored sample was again revealed, but this time at SoundCloud.\n\n&quot;Nightmare&quot; was nominated for &quot;Best Single&quot; at &quot;The Kerrang! Awards&quot;, where fans were allowed to vote unlimited times for their desired song,but lost to Liquid Confidence by You Me At Six.. \n\nNightmare was released on July 27, 2010 as a downloadable track in Rock Band 2 along with Seize the Day and Scream.\n\nThe band has filmed a music video for &quot;Nightmare&quot;. To film the video, they hired the famed video director, Wayne Isham, who has worked with bands such as MÃƒÂ¶tley CrÃƒÂ¼e, Bon Jovi and Metallica. The music video premiered on July 17, 2010, on MTV2, at 11 AM EST, and on Avenged Sevenfold's website. An unedited version of the video premiered later on that day. The video can be seen on the band's officialpage.\n\nThe video depicts lead vocalist M. Shadows about to undergo surgery, when the surgeons take him out of the room on a gurney. Shadows then notices the torn-down former drum kit of the band's deceased drummer, The Rev, when he toured with them to support their record City of Evil. The surgeons move him through halls and he sees the members of Avenged Sevenfold acting mentally insane, such as lead guitarist Synyster Gates continually banging his bloody head against the window of a door, bassist Johnny Christ walking on the ceiling, and seeing rhythm guitarist Zacky Vengeance in a straitjacket, and later waltzing with a skeleton, as well as disturbing images of children playing and soaked in blood. The video shifts between this and the band performing in a black environment with a small bit of background light. Towards the end of the video, M. Shadows begins to fight the gurney, wanting to get off, as they wheel him toward a room being led by two young boys. He cannot get off because he is strapped to it. He is wheeled into a room, where the last drum set The Rev toured with Avenged Sevenfold with is set up. The video does not feature Mike Portnoy playing drums, this was decided by Mike himself as he wanted it to be all about Avenged Sevenfold and seeing as how The Rev wrote most of the drums for the album Mike thought it would be wrong to have himself in the film clip. The music video is based heavily on the infamous scene from Jacob's Ladder where Jacob Singer is being pulled on a stretcher through hell.\n\nMany homages and tributes are shown through the video. For instance, The Rev's City of Evil tour drum kit has spiders crawling on it, just like in the &quot;Afterlife&quot; video, except that the spiders were on The Rev's face. Additionally, while filming the music video for &quot;Afterlife&quot; The Rev stated his arachnophobia. Another example is during one of Zacky's scenes where he is waltzing with a skeleton. This is also shown in the &quot;Afterlife&quot; video, except that he is dancing with a woman. Other smaller references to Avenged Sevenfold's videos are The Priest from &quot;Seize the Day&quot; and patients faces stretching, like in the &quot;Bat Country&quot; video.\n\nSome lyrics in this video are censored.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:674a3e5c3b6de9699ef7ccdc8cf8ad658ecfe28e","amp;dn":"Avenged+Sevenfold+-+Nightmare+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"674a3e5c3b6de9699ef7ccdc8cf8ad658ecfe28e","infoHashBuffer":{"type":"Buffer","data":[103,74,62,92,59,109,233,105,158,247,204,220,140,248,173,101,142,207,226,142]},"announce":[],"urlList":[]}}