{"title":"the ILLUMINATUS trilogy 1.2.1 - radio free st*rfucker","uid":5324548,"size":147444613,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:67522d96465cb0a0de690caee8ad84fe4eb0291d&amp;dn=the+ILLUMINATUS+trilogy+1.2.1+-+radio+free+st%2Arfucker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rfsmojofilter","files":1,"time":1264972006,"description":"...Hopalong Horus Rides Again, prepare for some Metaphysics, rfsMojofilter are BACK with Books-at-Beat-Time, it's the ILLUMINATUS trilogy by Robert Anton Wilson and Robert Shea, book 1, chapter 2.1, it's the second trip, or chokmah, read by ken campbell and chris fairbank to beats supplied by enrique che pelligro for rfs...\n\n...CHOKMAH - Mach Management - George Prepared...\n\n    ...The Aneristic Principle is that of ORDER, the Eristic Principle is that of DISORDER. On the surface, the Universe seems (to the ignorant) to be ordered; this is the ANERISTIC ILLUSION. Actually, what order is &quot;there&quot; is imposed on primal chaos in the same sense that a person's name is draped over his actual self. It is the job of the scientist, for example, to implement this principle in a practical manner and some are quite brilliant at it. But on closer examination, order dissolves into disorder, which is the ERISTIC ILLUSION.\n\n\n-Malaclypse the Younger, K.S.C., Principia Discordia...\n\nThe titles of the three volumes or parts (the front covers were titled Illuminatus! Part I The Eye in the Pyramid, Illuminatus! Part II The Golden Apple and Illuminatus! Part III Leviathan) refer to recurring symbols of elements of the plot.\n\nThe Eye in the Pyramid refers to the Eye of Providence, which in the novel represents particularly the Bavarian Illuminati, and makes a number of appearances (for example, as an altar and a tattoo).\n\nThe Golden Apple refers to the Golden apple of discord, from the Greek myth of the Judgement of Paris. In the trilogy it is used as the symbol of the Legion of Dynamic Discord, a Discordian group; the golden apple makes a number of appearances, for example, on the cover, on a black flag, and as an emblem on a uniform.\n\nLeviathan refers to the Biblical sea monster Leviathan, which is a potential danger to Hagbard's submarine Leif Erickson (from the name of the Icelandic discoverer of America).\n\nThe three parts of the trilogy are subdivided into five &quot;books&quot; named after the five seasons of the Discordian calendar. These books are also subdivided into ten &quot;trips&quot; named after the ten Sephirot. The last trip's conclusion is followed by fourteen appendices named after letters of the Hebrew Alphabet, which share their names with paths on the Tree of Life. The first page of the Appendix includes this mysterious note: &quot;There were originally 22 appendices explaining the secrets of the Illuminati. Eight of the appendices were removed due to the paper shortage. They will be printed in heaven&quot;, while &quot;Appendix Mem&quot; states: &quot;Where are the missing eight appendices? Answer: Censored.&quot; This appears to be another of the authors' jokes, although it is true that eight letters of the Hebrew Alphabet are missing, and the publisher required the authors to cut 500 pages from the book.[3]\n\n...in memoriam Ken Campbell 1941-2008...\n\n...anotherQUATILYproduct...","torrent":{"xt":"urn:btih:67522d96465cb0a0de690caee8ad84fe4eb0291d","amp;dn":"the+ILLUMINATUS+trilogy+1.2.1+-+radio+free+st%2Arfucker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67522d96465cb0a0de690caee8ad84fe4eb0291d","infoHashBuffer":{"type":"Buffer","data":[103,82,45,150,70,92,176,160,222,105,12,174,232,173,132,254,78,176,41,29]},"announce":[],"urlList":[]}}