{"title":"ResScan_3.7.exe","uid":4644101,"size":65242606,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6a7d95fadf55b6b135d91e2d520514dc9e806831&amp;dn=ResScan_3.7.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Goofproof","files":1,"time":1231818727,"description":"ResScan v 3.7 XPAP Software\n\nVista Compatible and S8 II Platinum Series (Easy Breathe) Compatible\n\nThis is the latest version of the ResScan software, and like the heading says, it works with Microsoft Vista, and the latest series of S8 machines, plus previous S8 versions.\n\nResScan Version 3.7 software (Requires Data Card Reader or USB Adaptor - available separately) \n\nCPAP Data from the S8 AutoScore or S8 Autoset is downloaded onto the Data card supplied with the CPAP Machine. The Card is then inserted into the Data Card reader to be uploaded to the ResScan Software.\n\nAlternatively, using the USB Adaptor on your S8 or S8II Autoscore or Autoset, you can connect and download data directly to your computer, without needing to use the Data Card.\n\nResScan is a powerful WindowsÃ‚Â©-based software tool for managing patients' therapy. ResScan reports treatment and compliance data recorded by ResMed flow generators (see table below) and calculates statistics over a range of dates. This information to analyze usage trends and treatment effectiveness. \n\nResScan reports data in four main profiles. \n\nThe Usage Profile displays usage information for up to 365 nights, providing an objective record of compliance. Usage data features date and time stamp as well as mask-off events. \n\nThe Treatment Profile summarizes the nightly AHI, mask leak, and pressure requirements for up to 365 nights, enabling clinicians to analyze long-term treatment efficacy.\n\nThe Night Profile shows detailed graphs of individual apnea events, AHI, leak, and pressure requirements throughout each night for the last five sessions. \n\nThe Statistical Summary encapsulates the information reported in the Usage and Treatment Profiles, generating a summary report of median values over a range of dates specified by the clinician. \n\nIn addition to gathering usage and treatment information, ResScan enables clinicians to perform several additional functions. This flexibility makes it an ideal tool for managing all patients' therapy: \n\nExport data from ResScan to a spreadsheet, such as MicrosoftÃ‚Â® Excel, so that data can be analyzed across multi-patient research studies. ","torrent":{"xt":"urn:btih:6a7d95fadf55b6b135d91e2d520514dc9e806831","amp;dn":"ResScan_3.7.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a7d95fadf55b6b135d91e2d520514dc9e806831","infoHashBuffer":{"type":"Buffer","data":[106,125,149,250,223,85,182,177,53,217,30,45,82,5,20,220,158,128,104,49]},"announce":[],"urlList":[]}}