{"title":"Randy Newman - Randy Newman - a.k.a. Something New Under The Sun","uid":9330696,"size":143852703,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b7bf335b28c1144c858f0fc3a37c52a4fc8d245&amp;dn=Randy+Newman+-+Randy+Newman+-+a.k.a.+Something+New+Under+The+Sun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rucard","files":12,"time":1386723821,"description":"Randy Newman - Randy Newman - a.k.a. Something New Under The Sun (1968) FLAC\nRemastered - EAC Lossless FLAC\n\n01 Love Story\n02 Bet No One Ever Hurt This Bad\n03 Living Without You\n04 So Long Dad\n05 I Think He's Hiding\n06 Linda\n07 Laughing Boy\n08 Cowboy\n09 The Beehive State\n10 I Think It's Going To Rain Today\n11 Davey The Fat Boy\n\nRandy Newman is more well-known today for his plethora of film soundtracks than his album recording career, which was underway with this self-titled 1968 debut. But, after listening to this album, it's incredibly easy to see why he eventually began writing music for movies: He likes to write music that's very cinematic in nature. Instead of the usual 12-bar stuff or weirdo psychedelia that everyone else was recording at the time, Newman seemed to prefer writing music that's more rambly in nature with extra emphasis on complex, full orchestral arrangements. \n\nNaturally, Newman's famous as a piano player, and we get to hear some of that, also. There's also a little bit of guitar and drums. But the emphasis here is on the cinematic arrangements, which are very impressive indeed! Interestingly, he would abandon this style to produce more traditional singer-songwriter stuff in later albums. With that, comes a problem. Not all of these songs are 'catchy' in the way that most audiences would respond to. Nonetheless, this album is incredibly melodic, and it's still filled to the brim with his famous brand of lyrics, which range can be witty, morose, bittersweet and/or sweet. As far as singer-songwriters go, it doesn't get a whole lot better than Randy Newman. \n\nHe also comes off as so likable that you'll probably want him to join your family by the time the album's through. Sure, he gets depressed at times, but at least he's nice about it. He's not going to throw beer bottles at the wall. The album opens with the incredibly sweet &quot;Love Story,&quot; which is about a young man in love. The first lyrics are &quot;I like your brother / I like your mother / I like you and you like me too&quot;. The song begins with a light, simple piano before the fanciful string arrangements come in. The chorus brings in exciting, trembling violins with a heavy snare drum, which comes off as very cool. It must also be mentioned that these arrangements aren't just there to fill up space; they actually fit and accent the whirlwind of moods presented in the lyrics. \n\nThe Randy Newman that composed those sweet Pixar ditties will immediately recognize his style in &quot;Bet No One Ever Hurt This Bad.&quot; The lyrics are about a depressed guy, but the light guitar-and-piano led are oddly upbeat. Yes, he can make those sad times seem oddly bright! &quot;So Long Dad&quot; marks a return to the complex dramatic string arrangements, which do wonders to accent those utterly heartwarming lyrics. &quot;Linda&quot; is so beautiful and cinematic that I had to make sure that it wasn't, in fact, a part of a montage in a movie! At any rate, it should have been; it probably would have been a highlight of a film. Also featuring the heavy orchestral sections is &quot;Laughing Boy&quot; and &quot;Davy the Fat Boy,&quot; and both songs aren't so dramatic as they are richly comic. \n\nProbably the most famous song in this album is &quot;I Think It's Going to Rain Today,&quot; which has been covered by a variety of artists including a surprisingly nice version by Bette Midler for the Beaches soundtrack. But I find it to be a bit too bleak and low-key quality, which for me, isn't trumped by the thoughtful lyrics. I also have the same problem with &quot;Cowboy.&quot; While it's terribly sentimental, I can't fight the feeling that it's rather dull. Then again, it's impossible to get too bored with considering they're three-minutes long. In fact, none of these songs are longer than three-and-a-half minutes. \n\nWell, Randy Newman is awesome. What else can be said? If you didn't know that before, then you know it now. You seriously ought to listen to his albums! His albums aren't usually this heavily orchestrated, but these are terribly good orchestrations. If you want something more traditional, then I would listen to some of his other albums like Sail Away, but everyone eventually must hear this brilliant debut album!\n\nOriginally Released By Reprise Records RS 6286\n\n\n\n\n\n","torrent":{"xt":"urn:btih:6b7bf335b28c1144c858f0fc3a37c52a4fc8d245","amp;dn":"Randy+Newman+-+Randy+Newman+-+a.k.a.+Something+New+Under+The+Sun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b7bf335b28c1144c858f0fc3a37c52a4fc8d245","infoHashBuffer":{"type":"Buffer","data":[107,123,243,53,178,140,17,68,200,88,240,252,58,55,197,42,79,200,210,69]},"announce":[],"urlList":[]}}