{"title":"Democracy Now - 20 may 2011","uid":6408964,"size":452426420,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6f28284c98c86f6b5ccef672882ef15a72d92545&amp;dn=Democracy+Now+-+20+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1305909602,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 20, 2011\n\n- Obama Calls for Israeli-Palestinian Peace Deal Based on 1967 Borders\n- Israel Authorizes 1,500 New Settler Homes\n- NATO Strikes Libyan Ships\n- Family Believes Missing British Journalist Slain by Gaddafi Forces\n- 29 Killed in Iraq Bombing\n- Afghans Continue Protest Against NATO Raid\n- Bombing Strikes U.S. Convoy in Pakistan\n- Thousands Protest Austerity, Youth Unemployment in Spain\n- Ex-IMF Chief Allowed Free on $1 Million Bail\n- Tennessee State House Approves Teachers' Union Curbs\n- Probe Faults Massey for West Virginia Coal Mine Blast\n\n\nSpecial reports\n\n- Did Obama's Mideast Speech Signal U.S. Shift on Israel-Palestine? Democracy Now! Roundtable\n\nIn a major speech on the U.S. foreign policy in the Middle East and on the Arab Spring, President Obama said a Palestinian state must be based on the 1967 borders, the first time a U.S. president has explicitly taken this position. The Israeli government immediately rejected Obama's comments, calling the 1967 borders &quot;indefensible.&quot; Israeli Prime Minister Benjamin Netanyahu is in the United States today and will meet Obama at the White House. We host a roundtable with author Norman Finkelstein, Palestinian human rights lawyer Noura Erakat and Jeremy Ben-Ami, head of the lobby group J Street.\n\n\n- U.N. Gaza Inquiry Panelist Desmond Travers Challenges Goldstone's Recantation of Key Finding\n\nLast month Judge Richard Goldstone, the chair of the United Nations' inquiry into the Israel's 2008-2009 assault on the Gaza Strip, retracted his key finding that Israel deliberately targeted Palestinian civilians in its three-week assault. Israel, with backing of the United States, seized on Goldstone's comments and called for the United Nations to withdraw the report. Goldstone came under criticism from his co-panelists who co-authored the original report. We speak to one of those panelists, Col. Desmond Traver, a retired Irish soldier and peace-keeper.\n\n\n- In Historic Visit, Queen Elizabeth II Regrets Britain's &quot;Sad and Regrettable&quot; Legacy in Ireland\n\nQueen Elizabeth II has become the first British monarch in a century to visit Ireland. In an address to the Irish nation on Wednesday, Britain's Queen Elizabeth II expressed regret at the troubled history of England's relations with Ireland. We get reaction from retired Irish soldier and peace-keeper Col. Desmond Travers.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:6f28284c98c86f6b5ccef672882ef15a72d92545","amp;dn":"Democracy+Now+-+20+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f28284c98c86f6b5ccef672882ef15a72d92545","infoHashBuffer":{"type":"Buffer","data":[111,40,40,76,152,200,111,107,92,206,246,114,136,46,241,90,114,217,37,69]},"announce":[],"urlList":[]}}