{"title":"uTorrent 1.8.1 with DHT patch - Private patched","uid":4458504,"size":292466,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6fa1998060bd56729705950b0050b102a0417ac1&amp;dn=uTorrent+1.8.1+with+DHT+patch+-+Private+patched&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"utorrent112","files":2,"time":1224549924,"description":"uTorrent 1.8.1 with DHT patch\nuTorrent 1.8.1 w/ DHT patch\n\nCAUTION:  If you use private torrent sites make sure to disable DHT and Peer Exchange for those torrents to avoid getting banned.\n\nThis version of uTorrent 1.8.1 will ignore the 'private' flag on any new torrents it opens.  This will enable Peer Exchange and DHT on such torrents.  I made this last time Demonoid went down when I noticed half my torrents were set to private and couldn't get any more peers.  By patching up uTorrent I was able to finish my downloads.\n\nAny private torrents currently on your list will need to be removed and re-added for them to be unlocked.  Downloaded data will remain.\n\nNote:  If you run normal uTorrent after running this one it will re-lock all the private torrents.\n\n\nIf you -only- use private trackers then you don't need this, why are you here at TPB?\n\nIf you use -only- public trackers then you have nothing to lose and some of your downloads will be much faster.\n\nIf you use both private -and- public like I do, just remember to disable DHT and Peer Exchange for your private torrents.\n\n\nalso rapid link:\nr a p i d s h a r e . c o m / f i l e s / 1 5 6 0 9 5 3 0 8 / u T o r r e n t _ 1 . 8 . 1 _ w i t h _ D H T _ p a t c h . r a r . h t m l\n\n\nThis is for torrents that are mistakenly or purposely set to 'private' during torrent creation, but then are uploaded to public trackers.  There are many private torrents on public trackers and this patched version of uTorrent allows you to download those much faster.\n\n\n","torrent":{"xt":"urn:btih:6fa1998060bd56729705950b0050b102a0417ac1","amp;dn":"uTorrent+1.8.1+with+DHT+patch+-+Private+patched","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fa1998060bd56729705950b0050b102a0417ac1","infoHashBuffer":{"type":"Buffer","data":[111,161,153,128,96,189,86,114,151,5,149,11,0,80,177,2,160,65,122,193]},"announce":[],"urlList":[]}}