{"title":"Leo4Allv5_Server_AMD_Intel","uid":4404485,"size":3671883706,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7058a398c04f880a493e2f915b71f895162bd864&amp;dn=Leo4Allv5_Server_AMD_Intel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ilxMirageilx","files":76,"time":1221871355,"description":"So after eddie11c had things come up I started to make a new version of Leo4All\nI want to take this time to thank eddie11c, Jas , Zef, Zethyroth, Dense, HotBreeze, fleebailey33, netkas, Diabolik, Kabyl, StageXNU Crew for the kernel, Chun-Nan \n\nLike I said a BIG thank you to eddie11c with out him this would not have happened, with all of his hard work starting \nleo4all.\n\nSo on to the info\nThis is for Intel/AMD.\n\nMD5 is fb025befca300c21c87259308ccc4f05\n\nPPF is included for GMA900 people so they can boot up the dvd and install it\n\nInstall Notes:\nFirst and most importantly is a totally rebuilt filesystem. I still left the the ./options script\nIf you boot with -s at the Darwin prompt and mount your drive with\n/sbin/fsck -fy\n/sbin/mount -uw /\n./options\nyou will see options to remove video drivers, account loop fix, and extensions repair. These are the most common issues so I have just automated them. If you do the account loop fix be sure to setup a proper account once booted into Leopard.\n\nFrom inside the installer you will notice a lot of new options\nFirst and for-most it boots with chameleon so it is efi and non efi boot.\n\nThis ISO has been built with the Server Retail disc.\n\nACPIPlatform:\n\nYou now have a choice between ACPIPlatforms, version 1.1.0 is the default install if nothing else is selected. This is needed for the laptop Power Management bundle to function, but if you have an older system you can choose 1.0.3 from Tiger. Alternately you can choose the stock version 1.2.1. Included inside version 1.1.0 and 1.2.1 is ACPIPS2Nub(proper version) for your PS2 support. There should be no more PS2 issues! There is a non-efi Old AppleACPIPlatform-1.0.3 and matching AppleAPIC, fixes some ACPI crashes, must be used for NO-EFI installs.\n\nAppleSMBIOS:\n\nI put in lots of choices for different versions based on bus speed if you want it to show your proper memory speed, or if you want your hack to look like a real mac. By default it installs Vanilla and SMBIOS Enabler.\nOptions are:\nVanilla SMBIOS\nSMBIOS Enabler\nDDR667\nDDR800\nDDR1066\nDDR1333\niMac\nMacBook\nMacPro\nSMBIOS for NON-EFI\nSMBIOS Resolver\n\nBootloader:\nChameleon Bootloader\nThere is EFI v8 Bootloader \nNon EFI bootloader, only workd on MBR partition types\n\nKernel:\nSince this is only AMD there is only the 9.4.0 StageXNU kernel for efi\nthere is also non-efi kernel 9.2.0, 9.2.2 SSE3. 9.2.0-Sleep\n\nRemoveFireWire:\n\nFor those that have issues with FireWire, or those that just want to speed their boot time a little. This moves all of the IOFireWire kext&amp;#039;s to /FireWire folder in the root of your install drive.\n\nAbout This Mac:\n\nThis is my own little installer to customize &quot;About this Mac&quot; with your processor info. No it does not fix memory speed, you have to do that with AppleSMBIOS. It should work for all languages and should report overclocked CPU&amp;#039;s properly.\n\nPower Management:\n\nBy popular demand I added the laptop power management bundle to the install. You will still need to set it up in system preferences. This is known to have a few minor bugs. It may not report the proper time remaining or any time remaining for that matter, so use at your own risk. If you select this please do not select an ACPIPlatform, as this requires version 1.1.0.\n\nChipset Drivers:\n\n(NOTE- JMicron is the only driver that always installs so please choose at least 1 option, some will have to choose 2 [if you have Marvell IDE and Intel SATA for example]) If your not sure you can click all but 1 Nforce, as they will overwrite each other.\n\nNforce Old - This is the older version of Medevils Nforce(1.0.2) driver. Install this if you have issues with SATA enabled causing a panic. Known to work for some Nforce3 users.\n\nNforce Test- If you have a SATA DVD or do not have issues booting the DVD normally choose the NforceTest.\n\nNforce 67- IF you have MCP67 Chipset this is the one you want to use.\n\nSiliconImage3132 - I have not found anyone that uses this specific chipset to confirm if it works.\n\nVIA, SiS, Marvell and SB - Please install this if you are using any of these chipsets. If you have a Marvell IDE drive please install this as they should be supported. I have added many ID&amp;#039;s here so I hope they all work! This choice installs AppleVIAATA, AppleOnboardPCATA and AppleGenericPCATA. Confirmed working for SiS!\n\nSAS - By request I added support for this, as of my writing this its untested. Hopefully it works.\n\nIntel ICHx- This is in there but this iso is only for AMD so it isn&amp;#039;t much use. I added it for the intel release coming soon.\n\nAudio:\n\nThese choices have not changed much, only added support for STAC9271 by request. If your not sure what chipset you have, please choose AzaliaAudio(for most HD) or AC97Audio.\nChoices are:\nALC850/882/883/888/889\nAC97Audio\nADI1988\nSTAC9271\nAzaliaAudio\n\nGraphics Drivers:\n\nI have updated many of these packages.\nATI- there are options for:\n3850\n3870\n2600XT(PCIE)\n2600XT(AGP)\n3870X2\n2600PRO(PCIE)\n2600PRO(AGP)\nX1600(PCIE)\nX1600(AGP)\nX19X0\nX1400 Mobility\n\nNVIDIA- I have updated the drivers to the latest available from the Mac Pro&amp;#039;s and edited to include all Device ID&amp;#039;s I could verify. This should cover mostly all 6XXX/7XXX/8XXX series cards. Here are the ID&amp;#039;s supported(not all confirmed working yet) Feel free to search for yours on the list.\n0x033310de 0x033010de 0x033110de 0x030110de 0x030210de 0x034410de 0x034310de 0x034110de 0x034210de 0x031410de 0x031110de 0x031210de 0x032610de 0x032310de 0x032110de 0x032210de 0x014f10de 0x00f310de 0x022110de 0x016310de 0x016210de 0x016110de 0x016210de 0x016010de 0x014110de 0x00f210de 0x014010de 0x00f110de 0x014210de 0x00f410de 0x014310de 0x014710de 0x004110de 0x00c110de 0x004710de 0x00f610de 0x00C010de 0x004510de 0x00f910de 0x00c210de 0x004010de 0x00f910de 0x004310de 0x004810de 0x021810de 0x00c310de 0x016710de 0x016810de 0x014810de 0x00c810de 0x00c910de 0x03d010de 0x03d110de 0x03d210de 0x024110de 0x024210de 0x01df10de 0x039310de 0x01d110de 0x01d310de 0x01dd10de 0x039210de 0x02e110de 0x039110de 0x039410de 0x00f510de 0x009210de 0x009110de 0x029110de 0x029010de 0x029310de 0x029410de 0x009810de 0x009910de 0x029810de 0x029910de 0x029510de 0x042310de 0x042210de 0x042110de 0x040210de 0x040010de 0x061110de 0x019310de 0x019110de 0x060010de 0x040710de 0x039810de 0x022210de\n\nNVkush- this is by Diabolik and in my mind the best nvidia enabler. Supports cards from 256MB to 1024MB\n\nNVinject- If NVkush doesn&amp;#039;t work for you. You can pick this one it supports cards from 64MB to 1024MB.\n\nNetwork Drivers:\n\nForceDeth- This is compatible with most Nforce LAN.\nForceDeth-V - This is compatible with most Nforce LAN(recommended version)\nSkge - Driver for most Marvell LAN cards.\nRTL8187- Just as it says for Realtek 8187\nZydas USB- For the USB Wireless LAN adapter\nTiger IO80211- Some Atheros cards require this Tiger version to work. Default install is IO80211 from 10.5.2\nBroadcom- WLAN driver for BCM4306/4309/4318/4320/4324\nRT2500- Suppose to support Dlink WMP54G v4.0, may support some others.\nViaRhine- Just as it says, for ViaRhine chipsets\nIntel 100Pro VE- Just as it says, for the Intel 100Pro VE chipset\nRT2860- Driver for some chipsets like WL-181, may also work on some others.\nRTL1000- This is an open source drive that supports network controllers RTL8168, RTL8111, RTL8169, RTL8101.\n\nPS/2Fix:\n\nApplePS2Controller: Fix some dead keys on non-standard PS2 Keyboards, like / and ? on ABNT2\n\nABNT2: Keyboard Layout for Portuguese ABNT2. For PS2 Keyboards need ApplePS2Controller fix to work with all keys. Can be used with USB Keyboards too.\n\nPCICard Support:\nPCICard install for laptops with Texas Instruments PCI slots.\n\nUSB 2.0 Fix:\nHigh Speed USB 2.0 fix for some people, don&amp;#039;t install if your not sure. May cause issues auto mounting drives.\n\nPower Mangement App:\nThis is a app and kext to control power management on Inte Machines only.\n\nAppleIntelCPU Power Management Disabler:\nThis is installed and selected by default you must not deselect it or system will not boot up. I don&amp;#039;t know who made\nThis.\n\nGood Applications:\n\nYou can choose to install or not, but I do recommend many of these useful programs. They include:\n\nASU-AMD Software Update\nGumby\nKextHelper\nOSX86Tools\nPackageMaker\nStuffit\nMainMenu\nTextMate\n\nAMD Patch:\n Does what it says it patches the system for AMD machines.\n\nfor support go to fusion.osx86.hu channel #leo4all\nforum is\nand you can get support at theflee.nfshost.com \n\nThanks for the help everyone with beta testing it\nClient version will be next week and will be 10.5.5!!\n\nNow get that Hackint0sh fired up!!!!!\n\nbhast2","torrent":{"xt":"urn:btih:7058a398c04f880a493e2f915b71f895162bd864","amp;dn":"Leo4Allv5_Server_AMD_Intel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7058a398c04f880a493e2f915b71f895162bd864","infoHashBuffer":{"type":"Buffer","data":[112,88,163,152,192,79,136,10,73,62,47,145,91,113,248,149,22,43,216,100]},"announce":[],"urlList":[]}}