{"title":"Billie Holiday - The Complete Billie Holiday CD 8 of 10 (1945-19","uid":4960772,"size":168036512,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:714ee3b2900768c60924cf14c2841d16c93b31c0&amp;dn=Billie+Holiday+-+The+Complete+Billie+Holiday+CD+8+of+10+%281945-19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"schon55","files":36,"time":1245294615,"description":"Billie Holiday - The Complete Billie Holiday On Verve CD 8 of 10\nOriginal Release Date: Feb 02, 1945 - Mar 01, 1959 \nAudio CD: Mar 9, 1993 \nNumber of Discs: 10 \nLabel: Polygram Records \nBitrate: VBR 250-320 kbps\n\nTen CDs with everything Billie Holiday recorded on Verve Records between 1945 and her death in 1959 - not only the songs, but concert introductions, some of the rehearsals, and between-take studio chatter, too.  All of which makes for a definitive portrait of Lady Day in her final years.  For a long time these recordings were disparaged because it was said her voice was no longer fine and mellow, &quot;ravaged&quot; by hard living, jail time, booze, and drugs.  And there's no question that her later tone is darker, more brittle and unstable than it had been in the '30s - but somehow I find myself listening to this music more often than those Brunswick/Columbia or Decca sides, anyway.  Like Frank Sinatra, who so often paid tribute to her influence, Holiday's artistry was never based on virtuosity; it was about interpretation, bringing out the emotions in a song and giving a personal reading.  She never stopped doing that, and for all the &quot;strange fruit&quot; you'll find in this collection, it's a gold mine. ~ Jim Emerson \n\nHoliday's brilliance, in spite of and in synch with the circumstance of her life does something religious, transcends, translates and transforms everyday existence.\n\nThis box set is a great gift to those of us wishing to understand better our love for Lady.  The insight into her musical journeys in the final years of her life is fascinating.  Although many critics have contended that Holiday's genius lay, for the most part, in her earlier Columbia recordings I feel this box set nullifies that argument.  Not because Holiday's Columbia recordings weren't brilliant, but because the Lady we here in her Verve Days is almost a different artist. \n\nHere we have a Billie of resillience as we witness in the recordings of her 1954 Jazz Club USA performance on Dics 2 &amp; 3.  We have an artist choosing new (for her) material and revitalized while nearing the end of her life in the 1957 Norman Granz run sessions. We are given a look into the recording world of Holiday will rehearsal tapes from Artie Shapiro's home in 1955.  These are particularly interesting as we are given a chance to hear her in both the process of crafting each song.  A step from this to the 1955 August 25th recording session tapes allows into the reminiscient dialogue of Billie and her band while reshaping Holiday classics like &quot;Strange Fruit&quot;.\n\nMy personal highlights hit in the Jazz Club USA jam session of &quot;Billie's Blues&quot;, discussion in the '55 studio session over &quot;Nice Work If You Can Get&quot; where Holiday explains why she feels she can never sing a song the same twice.  ( This is eroneous in actuality - in some ways this being because of the limitations of her substance abuse, but we'll let her have it because we love her. )   And finally the final Verve Recordings of Holiday for MGM in 1959 in the &quot;Lady In Satin&quot; tradition with Ellis.  Although not as tightly emotionally moving as &quot;Lady In Satin&quot;, a beautiful extension of the sentiment nonetheless.\n\nThe liner notes are extensive, informative and fascinating - could be a book themself, but by length so could this review.  Special graces to Phil Schaap for his precise discography and session notes.  This is a whole lot of expensive, this box set.  But it's worth it.  It allows a brief insight into the studio of a genius, an extensive retrospective of one of the most important American artists EVER and a whole lot of joy, pain, beauty and magic all rolled into a tiny square box. ~ Joshua\n\nMost critics believe Billie's early years were her best years. They are wrong.  Although I am a fan of her early work, it is the recordings she made later in life that grip me by the throat.  In those years, her dreams were becoming nightmares, the grey clouds darker.  Yet, a glimmer of hope managed to emerge from her voice, even as she sang the most heart-wrenching ballads.  I've heard many say that she couldn't sing.  They fail to realize that she does much more than sing.  Sure, she stetches and folds notes, but in saying that, you loose the magic.  Billie let her soul sing.  The strength in her frail voice during those later years is enormous.  Listen to Tenderly, You Go to My Head and I Cover the Waterfront.  Whether you are still moarning the loss of an old love or celebrating a new one, her voice will say it all. ~ Jake Gonzalez\n\nBillie Holiday - The Complete Billie Holiday On Verve CD 8 of 10 Tracks:\n01  Lady Sings The Blues (With Reading From Lady Sings The Blues)\n02  Lady Sings The Blues\n03  Ain't Nobody's Business If I Do\n04  Travelin' Light (With Reading From Lady Sings The Blues)\n05  Reading From Lady Sings The Blues\n06  Billie's Blues\n07  Body And Soul\n08  Reading From Lady Sings The Blues\n09  Don't Explain\n10  Yesterdays\n11  Please Don't Talk About Me When I'm Gone\n12  I'll Be Seeing You\n13  Reading From Lady Sings The Blues\n14  My Man\n15  I Cried For You\n16  Fine And Mellow\n17  I Cover The Waterfront\n18  What A Little Moonlight Can Do\n19  I Wished On The Moon\n20  Moonlight In Vermont\n21  A Foggy Day\n22  I Didn't Know What Time It Was\n23  Just One Of Those Things\n24  Studio Talk\n25  Just One Of Those Things\n26  Studio Talk\n27  Comes Love - (take 1, alternate)\n28  Comes Love - (take 2, false start)\n29  Comes Love - (take 3, false start)\n30  Comes Love - (take 4, master take)\n\n","torrent":{"xt":"urn:btih:714ee3b2900768c60924cf14c2841d16c93b31c0","amp;dn":"Billie+Holiday+-+The+Complete+Billie+Holiday+CD+8+of+10+%281945-19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"714ee3b2900768c60924cf14c2841d16c93b31c0","infoHashBuffer":{"type":"Buffer","data":[113,78,227,178,144,7,104,198,9,36,207,20,194,132,29,22,201,59,49,192]},"announce":[],"urlList":[]}}