{"title":"CorkScrew_StarCraft","uid":6095620,"size":1374397926,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:729b0a66d1bd047c66965f6a0240db253a8b3b14&amp;dn=CorkScrew_StarCraft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"evilgold","files":3,"time":1294761097,"description":"CorkScrews are prepackaged wine prefixes inspired by the &quot;Wine bottle&quot; of\nCrossover (cxgames.). This package was built using ArchLinux and also tested on Ubuntu 10.04, it should work properly on any Linux distribution with wine installed.\n\nThis package contains StarCraft and The BroodWar expansion. \n\nTo install the game run InstallerStarcraft.sh. This will extract the archive to ~/.wine/wineprefixes/Starcraft\n\nTo launch the game you can either use the desktop icon or execute the script located in ~/bin, either by double clikcing on it, or from a terminal enter: ~/bin/StarCraftLauncher.sh\n\nIn addition to the game launcher a CD Key changer is included for those who might want it for playing on battle.net. \n\nThere are some issues with running the game in full screen mode on newer monitors which don't support 640x480. To ensure the game works for the most amount of people, I've set it to run in a virtual desktop by default. If you wish to try running in full screen run the script StarCraft-config.sh located in ~/bin and turn off the virtual desktop under the graphics tab. \n\nTo uninstall delete the Starcraft folder in ~/.wine/wineprefixes.\n\nI encourage you to package, test, and distribute CorkScrews of other games.\n\nI also encourage you to repackage CorkScrews into distro specific packages\nor add Desktop Environment friendly buttons or whatever other frilly shit you\nlike.\n","torrent":{"xt":"urn:btih:729b0a66d1bd047c66965f6a0240db253a8b3b14","amp;dn":"CorkScrew_StarCraft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729b0a66d1bd047c66965f6a0240db253a8b3b14","infoHashBuffer":{"type":"Buffer","data":[114,155,10,102,209,189,4,124,102,150,95,106,2,64,219,37,58,139,59,20]},"announce":[],"urlList":[]}}