{"title":"Cimarosa - L'Italiana in Londra","uid":10686215,"size":168309822,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:739b330ad77f9cb676309e161c0aae510e93632a&amp;dn=Cimarosa+-+L%27Italiana+in+Londra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OmniaVincit","files":39,"time":1407081430,"description":"Staying in a London hostelry run by Madama Brillante are:\n\n    a morose English Milord with the unlikely name of Arespingh\n    a middle-class and eminently sensible Dutch merchant, Sumers\n    a flamboyant, gullible and homesick Neapolitan, Don Polidoro.\n\nThe Italian girl is Livia, who comes from Genoa but claims to be from Marseilles. She has been jilted by Arespingh who is being forced by his father to marry someone else.\n\nMeanwhile Madama Brillante has designs on Polidoro, but Polidoro fancies Livia.\n\nThe action unfolds through a single day of arguments and misunderstandings, but all is happily resolved by the end.\n\nPart of the plot concerns a magic heliotrope or bloodstone which makes a person invisible, a story Petrosellini derived from a chapter of Boccaccio's Decameron.\n\n\n\nBetween 1778 &amp; 1781, no less than 18 operas had been staged by Cimarosa including &quot;L'Italiana in Londra&quot; that were objects of great applause. &quot;L'Italiana in Londra&quot; was the 1st opera of Cimarosa to be performed in Milan, at La Scala, then at Dresden, and, at the start of 1780, followin 4 performances of 4 different Cimarosa operas, all were translated into German. The opera &quot;Il Matrimonio Segreto&quot; was a still greater success acknowledged by Joseph 2nd himself with a request for a personal repeat performance.\n\nAnna Trombetta e Luca Bianchini - Figaro: L'Aria della Contessa","torrent":{"xt":"urn:btih:739b330ad77f9cb676309e161c0aae510e93632a","amp;dn":"Cimarosa+-+L%27Italiana+in+Londra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"739b330ad77f9cb676309e161c0aae510e93632a","infoHashBuffer":{"type":"Buffer","data":[115,155,51,10,215,127,156,182,118,48,158,22,28,10,174,81,14,147,99,42]},"announce":[],"urlList":[]}}