{"title":"Polymer and Polymer-Hybrid Nanoparticles - From Synthesis to Bio","uid":12428550,"size":40586291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75856841390399623c4b1b2f29c4c89e20261bf7&amp;dn=Polymer+and+Polymer-Hybrid+Nanoparticles+-+From+Synthesis+to+Bio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1442422365,"description":"Polymer and Polymer-Hybrid Nanoparticles - From Synthesis to Biomedical Applications (CRC, 2014).pdf\n\nISBN 978-1-4398-6909-3\n\nPolymeric and hybrid nanoparticles have received increased scientific interest in terms of basic research as well as commercial applications, promising a variety of uses for nanostructures in fields including bionanotechnology and medicine. Condensing the relevant research into a comprehensive reference, Polymer and Polymer-Hybrid Nanoparticles: From Synthesis to Biomedical Applications covers an array of topics from synthetic procedures and macromolecular design to possible biomedical applications of nanoparticles and materials based on original and unique polymers. The book presents a well-rounded picture of objects ranging from simple polymeric micelles to complex hybrid polymer-based nanostructures, detailing synthetic procedures, techniques for characterization and analysis, properties, and behavior in selective solvents and dispersions. Each chapter contains background and introductory information, summarizing generalities on the nanosystems being discussed. The chapters also describe representative works of experts and provide in-depth, focused discussions.The authors present current knowledge on the following topics: Designed synthesis of functional polymers Construction of block copolymer micellar and nonmicellar self-assembled structures Construction of organic-organic hybrid nanosized particles Construction of organic-inorganic hybrid nanoparticles and nanoassemblies The final chapter addresses biological applications of polymeric nanoparticles, including delivery of low-molecular-weight drugs, macromolecular drugs, imaging and diagnostics, and photodynamic therapy. Summarizing important developments in the field, the authors condense relevant research into a comprehensive resource","torrent":{"xt":"urn:btih:75856841390399623c4b1b2f29c4c89e20261bf7","amp;dn":"Polymer+and+Polymer-Hybrid+Nanoparticles+-+From+Synthesis+to+Bio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75856841390399623c4b1b2f29c4c89e20261bf7","infoHashBuffer":{"type":"Buffer","data":[117,133,104,65,57,3,153,98,60,75,27,47,41,196,200,158,32,38,27,247]},"announce":[],"urlList":[]}}