{"title":"Indiana Jones 4 [HDRip][AC3.HDRip][Torrentmas.com]","uid":4886536,"size":1451073536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7772d314aff0855251513542578485645b1ced97&amp;dn=Indiana+Jones+4+%5BHDRip%5D%5BAC3.HDRip%5D%5BTorrentmas.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nahla","files":1,"time":1241741192,"description":"TÃƒÂ­tulo: Indiana Jones Y El Reino De La Calavera De Cristal\n\nTÃƒÂ­tulo Original: Indiana Jones And The Kingdom Of The Crystal Skull\n\nGÃƒÂ©nero: Aventuras\n\nNacionalidad: USA\n\nAÃƒÂ±o: 2007\n\nDirector: Steven Spielberg\n\nGuiÃƒÂ³n: Jeff Nathanson\n\nReparto: Harrison Ford, Shia LaBeouf, Cate Blanchett, Ray Winstone, Karen Allen, John Hurt, Jim Broadbent\n\nSinopsis:   La ÃƒÂºltima aventura de Indiana Jones (Harrison Ford) empieza en el desierto del suroeste Estados Unidos en 1957, en plena Guerra FrÃƒÂ­a. Indy y su amigo Mac (Ray Winstone) acaban de escapar por los pelos de las garras de unos infames agentes soviÃƒÂ©ticos en un remoto aeropuerto.\n\nEl profesor Jones regresa a casa y se entera de que las cosas van de mal en peor. Su mejor amigo, el decano de la Universidad (Jim Broadbent), le dice que muchos sospechan de las ÃƒÂºltimas actuaciones de Indy y que el gobierno presiona a la Universidad para que le despidan. Indiana, a punto de irse, conoce a un joven rebelde llamado Mutt (Shia LaBeouf), que le propone un trato. Si el arqueÃƒÂ³logo le ayuda a resolver un problema personal, podrÃƒÂ­a hacer uno de los descubrimientos mÃƒÂ¡s espectaculares de la historia; se trata de la Calavera de Cristal de Akator, un objeto legendario que despierta la fascinaciÃƒÂ³n, la supersticiÃƒÂ³n y el miedo.\n\nIndy y Mutt viajan al rincÃƒÂ³n mÃƒÂ¡s perdido de PerÃƒÂº, tierra de antiguas tumbas, exploradores olvidados y rumores de una ciudad de oro. Pero no tardan en descubrir que no estÃƒÂ¡n solos; los agentes soviÃƒÂ©ticos tambiÃƒÂ©n quieren apoderarse de la Calavera de Cristal. Los miembros de una unidad militar de ÃƒÂ©lite, dirigidos por la frÃƒÂ­a, calculadora y letalmente bella Irina Spalko (Cate Blanchett), quieren apoderarse de la Calavera, convencidos de que ayudarÃƒÂ¡ a los soviÃƒÂ©ticos a dominar el mundo... si consiguen descifrar su secreto.\n\nIndy y Mutt deberÃƒÂ¡n despistar a los despiadados soviÃƒÂ©ticos, seguir la pista de un misterio insondable, sortear a enemigos y amigos dudosos y, sobre todo, impedir que la Calavera de Cristal caiga en las manos equivocadas.\n\nFecha de Estreno:   Jueves, 22 de Mayo de 2008","torrent":{"xt":"urn:btih:7772d314aff0855251513542578485645b1ced97","amp;dn":"Indiana+Jones+4+%5BHDRip%5D%5BAC3.HDRip%5D%5BTorrentmas.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7772d314aff0855251513542578485645b1ced97","infoHashBuffer":{"type":"Buffer","data":[119,114,211,20,175,240,133,82,81,81,53,66,87,132,133,100,91,28,237,151]},"announce":[],"urlList":[]}}