{"title":"Queen of Langkasuka - Eng Sub [Thai Movie]","uid":4898055,"size":1471100794,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7b2f4ea6ca71b055527be8372abdb065c1597d1a&amp;dn=Queen+of+Langkasuka+-+Eng+Sub+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"poothaijaa","files":-1,"time":1242455612,"description":"Title: Queens of Langkasuka\nAKA: Puen yai jom salad\nYear: 2008\nDirector : Nonzee Nimibutr\nGenre: Action / Adventure\nRuntime: 133 mins\nCountry: Thailand\nLanguage: Thai\nSubtitle: English (soft subbed)\n\nLead Actors:\nJarunee Suksawat ... Prince Heejoa\nJakrit Panichpatikam... Limkiem\n\nSupporting Actors:\nAnanda Everingham... Paree\nAnna Hambowreese ... Au-ngu\nJessadaporn Pholdee ... Prince Pahung\nChupong Changprong... Yarung\n\nIMDB: http://www.imdb.com/title/tt1262945/ &lt;a href=&quot;\nhttp://www.ethaicd.com/show.php?pid=43461&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ethaicd.com/show.php?pid=43461&lt;/a&gt; &lt;a href=&quot;\nhttp://www.queensoflangkasuka.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.queensoflangkasuka.com/&lt;/a&gt;\n\nSource: DVD\nFile Format: AVI\n\nStory :\n\nQueen Hijau of Pattani faces overthrow by the rebel Prince Rawai, who is allied with pirate captain Black Raven. The pirates attempt to capture some giant cannon invented by Dutchman Janis Bree and Chinese inventor Lim Kium, but the Dutch ship carrying the cannon blows up and the cannons sink into the sea.\n\nMeanwhile, an orphan sea gypsy boy named Pari is raised in a fishing village, which is constantly under attack by Black Raven's raiding parties. The boy, gifted in the magical art of Du Lum, is taken by his uncle Anjar to learn more of the magical ways of the ocean from White Ray, but the sage refuses to teach the boy. Nonetheless, Pari is soon communicating with the marine life. He grows into manhood and becomes a fighter against Black Raven's pirates.\n\nBlack Raven, also a practitioner in the Du Lum ocean magical arts, has been trying to raise the cannons from the depths of the sea.\n\nQueen Hijau wants her own large cannons and seeks the inventor Lim Kium, who has been living in the sea gypsy fishing village. She sends away her daughters, Princess Ungu and Princess Biru. They will be under the protection of the queen's loyal commander, the fierce martial artist Lord Jarang.\n\nAt the fishing village, Lord Jarang comes under attack. Pari aids Jarang in fighting off the pirates, and Jarang makes his escape. In the confusion, Princess Ungu is believed to have been killed, but she has actually been rescued by Pari and taken to White Ray's remote island.\n\nThere, a romance develops between Ungu and Pari, but neither are able to commit. Ungu is due to marry Prince Pahang, an important ally of Langkasuka. And Pari is still tortured by the death of his childhood sweetheart at the hands of Black Raven's men.\n\nIn a cave on the island, Pari encounters Black Ray, an evil, unstable alter ego of White Ray, and Pari begins to learn more about Du Lum and the conflict between the black and white sides of the practice.\n\nEventually, all the forces - the rebel prince, the pirates, the ocean sorcerers, the queen and the princesses - will battle for the big cannon.\n","torrent":{"xt":"urn:btih:7b2f4ea6ca71b055527be8372abdb065c1597d1a","amp;dn":"Queen+of+Langkasuka+-+Eng+Sub+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b2f4ea6ca71b055527be8372abdb065c1597d1a","infoHashBuffer":{"type":"Buffer","data":[123,47,78,166,202,113,176,85,82,123,232,55,42,189,176,101,193,89,125,26]},"announce":[],"urlList":[]}}