{"title":"Vietcong 2","uid":8434950,"size":3090009750,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c0ef0725b22f8230372702b5a70550bee129351&amp;dn=Vietcong+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rtyuer","files":10,"time":1367599675,"description":"Vietcong 2 [2005]:\nGiven the dubious results of the Vietnam War, it was a bit surprising when publishers, after having exhausted World War II for stories, started to turn out Vietnam War games a few years ago. This resulted in a wave of Vietnam games, with the majority of them being utterly forgettable. A few did make distinct impressions, including Vietcong, an immersive first-person shooter developed by Pterodon, a Czech Republic studio (of all places). Well, it's time to get back to the jungle with Vietcong 2, the follow-up to 2003's original, which picks up almost exactly where its predecessor left off.\t That's because Vietcong 2, like its predecessor, exhibits some great qualities but still suffers from technical issues that affect its performance. Furthermore, it's a game that hasn't aged as well as you might hope.\n\nVietcong 2 shifts gears from the actual jungle to the urban jungle, as the story this time centers around the brutal fighting in and around the city of Hue in the days leading up to and after the infamous Tet Offensive of 1968. The sequel actually boasts two campaigns, and this time you can play from either the perspective of a US officer or a Vietcong guerilla. Though in truth, the VC campaign is all but a vignette, as it's a fraction of the length of the US campaign. In addition to the campaigns, you still retain the ability to play any completed single-player mission in quick play against a host of enemies, and there's also a full-fledged, if rudimentary, multiplayer suite at your disposal.\n","torrent":{"xt":"urn:btih:7c0ef0725b22f8230372702b5a70550bee129351","amp;dn":"Vietcong+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c0ef0725b22f8230372702b5a70550bee129351","infoHashBuffer":{"type":"Buffer","data":[124,14,240,114,91,34,248,35,3,114,112,43,90,112,85,11,238,18,147,81]},"announce":[],"urlList":[]}}