{"title":"Hell's Bells 2 CD1 (Christian Documentary)","uid":4541448,"size":734171531,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e67291f5bc6018376fd3c9022e55de59e8d8cab&amp;dn=Hell%5C%27s+Bells+2+CD1+%28Christian+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IndianChristian","files":3,"time":1227919118,"description":"Hell&amp;#039;s Bells 2: The Dangers of Rock &amp;#039;n&amp;#039; Roll CD 1 (Christian Documentary)\n\nHells Bells is one of the most in depth documentarys ever produced and is in fact a must see for any person who has ever heard music. Over three years in the making, this much-anticipated sequel to the original Hell&amp;#039;s Bells weaves together science, satire, testimonies, parables, interviews, expansive research, and a vibrant Christian perspective to create a video series that is as fascinating as it is educational and evangelistic. Far more than just a commentary on the dangers of rock music, this six-and-a-half hour, up-to-the-minute documentary uncovers the &quot;war of the worldviews&quot; - the epic struggle between good and evil, sin and redemption for the souls of men and the destiny of culture. \n\nKindly note that this documentary is not to be shown to kids below 10 years of age. It contains a large number of occultic scenes. Nudity and slang words are hidden using smokescreens/voice cuts. A must watch for every teenage and adult Christian.\n\nThis is a 6 cd pack of approx. 6 hours, 40 minutes. Due to my low upload speed I have uploaded only the cd 1. I will be uploading the rest in due course.\n\nThe cds are internally divided into the following sections. \n\n- INTRODUCTION - Foundations for Cultural Analysis\n- SOUND &amp; FURY - An Examination of the Power of Music\n- HEARTBEATS - Music&amp;#039;s Spiritual Connection\n- NOTES FROM THE UNDERGROUND - The Occult History of Rock\n- HEARTS OF DARKNESS - Rebellion, Nihilism and Death\n- MOJO RISING - Satanic Sex &amp; Rock-N-Roll\n- ANTICHRIST SUPERSTARS - Rocks Ultimate Rebellion\n- KNOCKIN&amp;#039;ON HEAVEN&amp;#039;S DOOR - Music and Life at the &quot;Cross&quot; Roads \n\nLanguage: English\nSubtitles: None\nRun Time: 73 minutes\nMy Rating: 9.5/10\nQuality: 9.0/10 \n\nIf financially possible, please buy this documentary to keep Christian documentaries in business. If Christians won&amp;#039;t buy Christian media then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God&amp;#039;s word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don&amp;#039;t ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:7e67291f5bc6018376fd3c9022e55de59e8d8cab","amp;dn":"Hell%5C%27s+Bells+2+CD1+%28Christian+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e67291f5bc6018376fd3c9022e55de59e8d8cab","infoHashBuffer":{"type":"Buffer","data":[126,103,41,31,91,198,1,131,118,253,60,144,34,229,93,229,158,141,140,171]},"announce":[],"urlList":[]}}