{"title":"Flashpoint 0202 Fight or Flight","uid":4818437,"size":365948975,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:80853ba3c8ce57f7aef14e3fe8739133c02e6063&amp;dn=Flashpoint+0202+Fight+or+Flight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TempleGault","files":2,"time":1238647114,"description":"When the Strategic Response Unit arrives, the rules change. The bad guy's caught - he just doesn't know it yet. The SRU, inspired by Toronto's Emergency Task Force, is a handpicked team of elite cops. High risk is their business and these men and women do it all: rescue hostages, bust gangs, defuse bombs. Talk down suicidal teens. Protect the Pope. They handle state-of-the-art weapons - sniper rifles, flash-bang grenades, tasers. They climb the sides of buildings. See through walls. But they're different from other SWAT teams. Because their arsenal also includes a gift for words. A knowledge of human intuition. An instinct for when it's time to negotiate - and when the 'solution' calls for something more. On the scene, they're in charge. No one knows their job better. SRU Constables outrank senior Inspectors - and the Inspectors don't like it. Regular uniforms grumble when pushed aside by the SRU 'prima donnas.' While secretly wishing they were in their place. It's a tough job. A job that carries the kind of pressure only your teammates - your band of brothers - can really understand. It's a stress that shades all your choices and can take a heavy toll on families, friends, lovers... These people are A-types and risk-takers. On the job, they play by the rules, bend them if they have to. But off the job, all bets are off... ","torrent":{"xt":"urn:btih:80853ba3c8ce57f7aef14e3fe8739133c02e6063","amp;dn":"Flashpoint+0202+Fight+or+Flight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80853ba3c8ce57f7aef14e3fe8739133c02e6063","infoHashBuffer":{"type":"Buffer","data":[128,133,59,163,200,206,87,247,174,241,78,63,232,115,145,51,192,46,96,99]},"announce":[],"urlList":[]}}