{"title":"Advanced Defrag v4.2","uid":5150215,"size":5670691,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:814befd9e12ea128d238decec9b79cbf256f4211&amp;dn=Advanced+Defrag+v4.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fcjunkie","files":4,"time":1257516044,"description":"Advanced Defrag - Complete Care for the health of your computer hard drive and Performance. Defrag the computer hard drive effectively and speed up you PC within minutes! Defragmentation is really important for your system's optimization. As your hard disk may be badly fragmented in the course of time, it would eventually cause negative problems to your computer like system slowdowns, PC crashes, slow startup and shutdown; it would even shorten the disk life span. Advanced Defrag is a professional program which is designed to cure system sluggishness and crashes. Program applies the most advanced defrag technology which enables you to completely and thoroughly analyze the disks and clean up all the fragmentation found in the computer disk with a very pleasant speed, effectively maximum the system performance and improve your working efficiency.\n\nMain features:\n In-depth analyze computer hard drive and defrag quickly &amp; thoroughly\n Portable, succinct and easy to use, straightforward interface\n Auto-pilot schedule task, keep your computer optimized everyday\n Detailed web-report for every analyze and defrag action\n External USB device defrag support, all Windows-base systems compatible\n Advanced multithreading and sharing design\n Filtration setting support","torrent":{"xt":"urn:btih:814befd9e12ea128d238decec9b79cbf256f4211","amp;dn":"Advanced+Defrag+v4.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"814befd9e12ea128d238decec9b79cbf256f4211","infoHashBuffer":{"type":"Buffer","data":[129,75,239,217,225,46,161,40,210,56,222,206,201,183,156,191,37,111,66,17]},"announce":[],"urlList":[]}}