{"title":"Hers to hold.avi","uid":6383877,"size":734013440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82ba2b629336fe2e1d81ed61b0a580eb1e7b26b6&amp;dn=Hers+to+hold.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"maureenmo1","files":1,"time":1305126668,"description":"Originally intended as a sequel to Deanna Durbin's smash hit Three Smart Girls movies, the original title was Three Girls Join up, Hers To Hold is a delightful Academy Award nominated wartime romantic comedy. Deanna returns to the role of penny craig the part that made her an international box office sesation. Now penny is all grown up and determined to do her bit for america as war clouds loom over the nation. she proudly signs up to work in an aircraft factory. However, penny being penny, she also has another reson for signing on at that particular factory.she's set her sights on a rather charming and handsome young pilot Bill Morley (Joseph Cotten) attatched to the factory and desperatly wants to be close to him. just as young love starts to bloom, Bill is called away to fight and serve overseas and penny is left behind fearing for his safty and dreaming of their future together. Enchanting moving and evocative, HERS TO HOLD sees Deanna performing four musical numbers, the Academy Award nominated &quot;say a prayer for the boys over there&quot; &quot;Begine the Beguine&quot;, &quot;Pale Hands Kashmiri Song&quot; and &quot;The seguidilla&quot;.","torrent":{"xt":"urn:btih:82ba2b629336fe2e1d81ed61b0a580eb1e7b26b6","amp;dn":"Hers+to+hold.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ba2b629336fe2e1d81ed61b0a580eb1e7b26b6","infoHashBuffer":{"type":"Buffer","data":[130,186,43,98,147,54,254,46,29,129,237,97,176,165,128,235,30,123,38,182]},"announce":[],"urlList":[]}}