{"title":"Backup2009 Pro v6.1.251 cracked","uid":4448519,"size":12296461,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:865aedeafbdefd2ce5db6e51a041e91d97f9baaa&amp;dn=Backup2009+Pro+v6.1.251+cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vibept","files":4,"time":1224162757,"description":"Backup2009 Pro supports unlimited zip file size (Pkware Deflate64). You can backup any folder to any destination (network lan, any removable media including CD and DVD). Backup2009 Pro comes with its own burner driver. It can span archive files over multiple media. It supports also direct write to CD/DVD. You can schedule any job, upload to one or two FTP servers. For security purpose Backup2009 Pro allows you to define a second copy and an alternate destination folder.\nIt offers catalog, log files (in PDF format)  and can email you when a job is done. Backup-2009 Pro is able to manage automatically cycle full &gt;&gt; incremental and allow you to define a retention period.\nBackup2009 Pro offers multiple ways to restore one or more specific files, a group of files (e.g. *.doc), a folder or the entire archive file just with few clicks. Restore can be processed to the original location or to any destination. Built in verify and repair function it includes functions to cut archive file in smaller pieces, or to merge multiple parts archive files.\nThe History displays the status of each job. The History is also available from the Windows Explorer.\nBackup2009 Pro provides 4 compression methods : Pkzip defalte64, standard Pkzip 2.04 ,Bzip and Bzip2.  Backup2009 studio supports strong AES encryption with 256 bits key. It comes with predefined backup sets (My emails, Windows shell, Registry...) and much more\n","torrent":{"xt":"urn:btih:865aedeafbdefd2ce5db6e51a041e91d97f9baaa","amp;dn":"Backup2009+Pro+v6.1.251+cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"865aedeafbdefd2ce5db6e51a041e91d97f9baaa","infoHashBuffer":{"type":"Buffer","data":[134,90,237,234,251,222,253,44,229,219,110,81,160,65,233,29,151,249,186,170]},"announce":[],"urlList":[]}}