{"title":"Ben Liebrand In The Mix","uid":3613187,"size":608158197,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8aee2a5be423c70b7ff941a79092fe775961a5cc&amp;dn=Ben+Liebrand+In+The+Mix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nvdwolk","files":9,"time":1170884127,"description":"Ben Liebrand, Classic &quot;In The Mix&quot; part 1\n\n&quot;In The Mix&quot; was broadcasted in the early 80s by Radio Veronica from 02:00 - 03:00 after midnight.\n\nSit back and relax. Enjoy disco the way it was meant to be..\n\n\nPlaylist files: recorde in 192kbps\n\n1. 01 Liebrand InTheMix Cassette Rip Aside Unknown Date (47:04)\n2. 01 Liebrand InTheMix Cassette Rip Bside Unknown Date (47:13)\n3. 02 Liebrand InTheMix Cassette Rip Aside Unknown Date (47:17)\n4. 02 Liebrand InTheMix Cassette Rip Bside Unknown Date (47:06)\n5. 03 Liebrand InTheMix Cassette Rip Bside Unknown Date.mp3\n6. 04 Liebrand InTheMix Cassette Rip Aside Unknown Date.mp3\n7. 04 Liebrand InTheMix Cassette Rip Bside Unknown Date.mp3\n8. 110783 Liebrand InTheMix Cassette Rip Bside.mp3\n9. 140583 Liebrand InTheMix Cassette Rip Aside.mp3\n\n\nAbout Ben Liebrand.\n\nThe Radio Veronica Early Years\n\nOn April 1st, 1983, Liebrand was hired by Netherlands station Radio Veronica, producing a weekly individual mix-show (&quot;In The Mix&quot;) on Radio Veronica, playing at 2am weekly, lasting an hour, running from early 1983 to November 1985. From that radio show, regular features such as the &quot;Grandmix&quot;, a yearly mix of all important dance tracks of the year, was developed. Taking a full month to organise, mix and record, the first Grandmix was broadcasted at the end of 1983, but technical complications almost ended this event before it started. Arriving at the Veronica Studio, Liebrand discovered that he had forgotten the second of the two tapes on which the Grandmix &amp;#039;83 was recorded. Thankfully, he happened to have a tape of a just finished &quot;High Fashion Dance Mix&quot; with him, and it was with that tape that the second part of the Grandmix &amp;#039;83 began! In January 1984, the &amp;#039;Grandmix &amp;#039;83&amp;#039; was broadcasted in its entirity, the way it was supposed to be. From such ignoble beginnings, the &quot;Grandmix&quot; flourished into a trademark event for both Radio Veronica and Liebrand, running until 1992.\n\nLater, in 1984, Ben also started making shorter remixes for the Friday evening &amp;#039;Curry &amp; van Inkel show&amp;#039;, later the &amp;#039;Stenders &amp; van Inkel show&amp;#039; (both on that station). These minimixes were either three/four track mixes (never exceeding fifteen minutes in total) or remixes of popular chart records at the time. It was during this period that Liebrand honed his production skills, selecting the tracks that would feature and producing the mixes during the day prior to them being broadcast that evening!\n\nMany of Liebrand&amp;#039;s remixes, released as singles, including Bill Withers &quot;Lovely Day&quot; and Frankie Valli &amp; The Four Seasons &quot;December, 1963 (Oh, What a Night)&quot; were premiered as &amp;#039;minimixes&amp;#039; on this radio show. In the case of Phil Collins &quot;In The Air Tonight,&quot; however, the mix was completed and then taken by Ben to be part of a mix showcase at the DMC Mixing Championship Finals in London. Ben himself takes up the story... &quot;Then I put on my remix of Phil Collins, in front of those two and a half thousand DJ?s. And I told them: &quot;If you want to see this released? Call Virgin first thing tomorrow!&quot; That resulted in Virgin being called by two and a half thousand DJ?s, and this got the track signed and released by 1pm the day after!&quot; [1]. Ben Liebrand, the record-selling producer, had arrived.\n\nAfter producing the final &quot;Grandmix&quot; in 1992, Ben felt frustrated with lack of feedback that his mixes were gaining. &quot;You didn?t know what people thought of it. 30 days fulltime working on the Grandmix in December, ten to twelve hours a day mixing. On the 31st December it was finished, and the last years when I entered the broadcast studios, everybody was busy doing something else, not really interested, and only the technician who was on duty, sat with me in the broadcast room. I plugged in my gear, pressed play around six o?clock, and after an hour I disconnected it again, and took off. Having sat there for one hour, solely with the technician, it was the biggest anti-climax ever. This could be compared to making a piece of art, walking up to a bridge and throwing it in the river, without knowing the people?s opinions about it.\n","torrent":{"xt":"urn:btih:8aee2a5be423c70b7ff941a79092fe775961a5cc","amp;dn":"Ben+Liebrand+In+The+Mix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aee2a5be423c70b7ff941a79092fe775961a5cc","infoHashBuffer":{"type":"Buffer","data":[138,238,42,91,228,35,199,11,127,249,65,167,144,146,254,119,89,97,165,204]},"announce":[],"urlList":[]}}