{"title":"Lee Smolin: How science is like democracy","uid":4569094,"size":45481416,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8c3ab8d62159f9a1c16fe1e08dd830f4031f2055&amp;dn=Lee+Smolin%3A+How+science+is+like+democracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"the_Phyrexian","files":-1,"time":1228992924,"description":"Physicist Lee Smolin talks about how the scientific community works: as he puts it, &quot;we fight and argue as hard as we can,&quot; but everyone accepts that the next generation of scientists will decide who's right. And, he says, that's how democracy works, too.\n\nLee Smolin is a theoretical physicist, working mainly in the field of quantum gravity. He's a founding member of the Perimeter Institute for Theoretical Physics in Canada, and the author of The Trouble With Physics.\n\nLee Smolin's bachelor's degree was in physics and philosophy -- twin passions that have complemented one another throughout his blazing career as a theoretical physicist. As his website bio is careful to state, &quot;His main contributions to research so far are to the field of quantum gravity.&quot; He's made contributions in many other fields, including cosmology, quantum mechanics, elementary particle physics and theoretical biology, and is the author of (among other books) The Trouble With Physics, a work that questions the very basis of the prevailing string theory.\n\nTaking a step back from work on specific problems in physics, Smolin's work examines the scientific process itself and its place in the world. In all of his three books, Life of the Cosmos, Three Roads to Quantum Gravity and The Trouble with Physics, he wrestles with the philosophical implications of what contemporary physics has shown us to be true. As we come to understand more about how the world works, he asks, how will our worldview change?\n\nSmolin is a founding member of and a researcher at the Perimeter Institute for Theoretical Physics, in Ontario, Canada (whose Executive Director is 2008 TED Prize winner Neil Turok).\n\n\nplease leave a comment if you want, this is just to show what is out there...\n\nAnd before you go and spam, dl it watch it and make up your own mind...\n\ncheers the_phyrexian\n\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n             &lt;a href=&quot;\nhttp://petitions.number10.gov.uk/shariastop/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://petitions.number10.gov.uk/shariastop/&lt;/a&gt;\t\n\n\nthere is a reseed section, read it / use it...\n        &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;","torrent":{"xt":"urn:btih:8c3ab8d62159f9a1c16fe1e08dd830f4031f2055","amp;dn":"Lee+Smolin%3A+How+science+is+like+democracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c3ab8d62159f9a1c16fe1e08dd830f4031f2055","infoHashBuffer":{"type":"Buffer","data":[140,58,184,214,33,89,249,161,193,111,225,224,141,216,48,244,3,31,32,85]},"announce":[],"urlList":[]}}