{"title":"20110623-Stossel-[Declaration of Independents]-Fox Business.CF.a","uid":6496006,"size":360894238,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8c414ba28da6ed7d7344484909c5434904824c78&amp;dn=20110623-Stossel-%5BDeclaration+of+Independents%5D-Fox+Business.CF.a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1309076294,"description":"STOSSEL - [Declaration of Independents] - Fox Business Network\n2011, June 23, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nWhat's your political affiliation?\nRepublican? Democrat?\nOr are you an independent?\nMost said &quot; independent&quot; when we asked people outside my office.\n\nIn their new book, &quot;Declaration of Independents,&quot; Nick Gillespie and Matt Welch from Reason say that independents with libertarian politics are on the rise, and they can fix what's wrong with America. Why? Because everything in our culture is being democratized, and the parts of America free from government control are getting better.\n\n&quot;Citizen journalists&quot; like Andrew Breitbart break stories the major networks would miss or ignore.\n\nFewer people are jammed into narrow categories of race, sexual preference, or style...we're becoming a culture of &quot;mutants,&quot; say Gillespie and Welch.\n\niPhones...Facebook...YouTube...all of these new innovations are designed to give individuals more choices and ways to express themselves.\n\nAnd people expressing themselves is a great way to be independent. Music and pop culture liberates people all over the world ... and constantly pushes forward tolerance and freedom of speech. Former MTV personalities Kurt Loder and Kennedy say a freer culture means freer people.\n\nGovernment impedes progress. What government controls -- education, health care, entitlements -- government messes up. What do they all have in common? Too little choice, and too much regulation.\n\nThis week, I have the solution: We declare independence from government and government control. &quot;Declaration of Independents&quot; airs on FBN at 10pm EST. Re-airing on Saturday and Sunday at 9pm &amp; midnight EST.\n\n----------\nOn 20110731, the servers providing the ReplayTV Electronic Program Guide data will be shut down forever, stranding my DVR without a schedule. Alternative sources for guide data are being explored by the owner community, but there are some doubts as to the ultimate usability of the units after this date. _IF_ it becomes impossible to schedule unattended recordings with my unit, then the flow of torrents describing this show and others will stop after this date.","torrent":{"xt":"urn:btih:8c414ba28da6ed7d7344484909c5434904824c78","amp;dn":"20110623-Stossel-%5BDeclaration+of+Independents%5D-Fox+Business.CF.a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c414ba28da6ed7d7344484909c5434904824c78","infoHashBuffer":{"type":"Buffer","data":[140,65,75,162,141,166,237,125,115,68,72,73,9,197,67,73,4,130,76,120]},"announce":[],"urlList":[]}}