{"title":"3.10 To Yuma (1957) - Greek Subtitles (Optional) - By Omifast","uid":4402694,"size":717597428,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8cc7943c4fb526ac46ddf986773fe6a05444f6ea&amp;dn=3.10+To+Yuma+%281957%29+-+Greek+Subtitles+%28Optional%29+-+By+Omifast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OmifastGR","files":3,"time":1221780694,"description":"3:10 to Yuma (1957) - Starring: Glenn Ford, Van Heflin, Felicia Farr, Leora Dana,\n\nThis is a Hight Quality Nero Digital Movie!\n\nThis Movie Recode it from the Original DVD.\n(Black &amp; White, No Colors)\n\nSpoken Languages: English, Spanish.\n\nSubtitles: Greek, French.\n\nIt Can Play in Any Media Player.\n\n================================================\nBut If You Want To Change Language Or Subtitles,\nYou Must Have Nero ShowTime Player.\n================================================\n\nFoto\n\n\n\nTrailer\n\nSummary\nA rancher struggles to support his ranch and family during a long draught. Desperately needing money to build a well, he takes an assignment to transport a notorious felon, in the hands of authorities, to Yuma for imprisonment. But, once the two meet, the criminal tries to tempt him with--in exchange for allowing him to escape--an offer of much more money than the rancher ever expected, the result of a hidden loot. \n\n\nWatch and Create High Quality Nero Digital Video with NeroVision Express\n\nNero Digital is a video format based on the same video compression technology that the TV and movie industries use to make your digital video experience better than ever. This state-of-the art codec (short for compressor-decompressor) is ideal for creating high-quality video files at a fraction of the original size so they can be enjoyed on PCs, TVs, and mobile devices.\n\nNero Digital videos are created using open standard codecs as adopted by the HD broadcasting standard as well as new HD technologies like AVCHD, Blu-ray, and HD DVD, as well as online video compression technologies adopted by the online video community.\n\nNero Digital videos can be viewed on a PC with Nero ShowTime, or on Nero Digital-certified DVD players, set-top boxes, digital TVs, and DMAs.Nero Digital files also play with basic audio and video functionality on any open standard players such as the PlayStation 3, Xbox 360, iPod, or software players such as QuickTime or Adobe Flash Player 9 (with MPEG-4 support).\nNero Digital video features include:\n\n* Multiple languages, including subtitles\n* Convenient video navigation through chapters\n* Playback on many different devices, supporting screen sizes\n  from mobile phone resolutions up to HD TVs\n* Excellent video and audio quality, using a fraction of the disc space.\n\n\nPlease be kind enough to seed my torrents\n\nThank You All.\n\n\nps. If nobody seeding please post a request and i will seed immediately !","torrent":{"xt":"urn:btih:8cc7943c4fb526ac46ddf986773fe6a05444f6ea","amp;dn":"3.10+To+Yuma+%281957%29+-+Greek+Subtitles+%28Optional%29+-+By+Omifast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cc7943c4fb526ac46ddf986773fe6a05444f6ea","infoHashBuffer":{"type":"Buffer","data":[140,199,148,60,79,181,38,172,70,221,249,134,119,63,230,160,84,68,246,234]},"announce":[],"urlList":[]}}