{"title":"THE SAND PEBBLES MPEG-4 (DVD Rip)","uid":3521539,"size":704152691,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8def62754ebf231a8aebc30ea6df389834753a00&amp;dn=THE+SAND+PEBBLES+MPEG-4+%28DVD+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jerryf01","files":1,"time":1157815452,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0060934/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0060934/&lt;/a&gt;\n\n\nThis is a great movie. Mcqueen had gravity. He doesn&amp;#039;t say much, but still waters run deep and he carries the movie with his quiet reserve. This is a character-driven action-drama, which Hollywood doesn&amp;#039;t make many of any more, because people&amp;#039;s attention-spans are shorter and longer films are more risky to make. Also at the time studios could count on longer releases at their own theatres to earn back their investment, but that arrangement was broken up by anti-trust actions in the late 60&amp;#039;s.\n\nMcqueen&amp;#039;s Holman was special. He cared enough about his job to oppose turning it over to the coolies, and then when that became impossible, he respected them enough to take one as an engineering pupil, instead of treating them as virtual slaves. He seemed singularly virtuous, if a little lost and hermetic about his life choices.\n\nThe film shows a forgotten moment in US history when we were maintaining an international colonial presence in China, then a collapsed Feudal state at the end of long dynasty. But we had no business there as overlords, and China was and is far too large to accept outside control permenantly. Once they&amp;#039;d absorbed enough western technology the end was inevitable. Over the course of the film the natives go from polite-but-unfriendly and toothless, to profoundly hostile and murderous, and the movie doesn&amp;#039;t cast negative judgement on this - it respects the complexity of the situation and sees it as a natural, historic event.\n\nThis came out at a time when we were fighting to maintain a questionable presence in IndoChina (Vietnam).. This was either intentionally meant to comment on this, or was simply interpreted as such by the audience of the time. The sad ending was a moment of deep, existential sadness, but there was a reality there. It seemed inevitable - the result of following orders which were against common sense, and the filmakers didn&amp;#039;t pull punches. I respect them more for that than if they&amp;#039;d put on a happy ending.\n\nMany people here became big stars later on.\nGavin Mcleod captained the Love Boat.\nCandice Bergen became Murphy Brown.\nRichard Crenna Headed up the A-Team.\nAnd Richard Attenborough was the rich old patron of Jurasic Park, among other things.\nBut Steve Mcqueen died in 1980 of cancer. He is missed.  \n***\nCut and pasted from user reviews @ Amazon.com\n &lt;a href=&quot;\nhttp://www.amazon.com/Sand-Pebbles-Robert-Wise/dp/B000059HAF/sr=8-1/qid=1157807599/ref=pd_bbs_1/103-0198034-2867049?ie=UTF8&amp;s=dvd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Sand-Pebbles-Robert-Wise/dp/B000059HAF/sr=8-1/qid=1157807599/ref=pd_bbs_1/103-0198034-2867049?ie=UTF8&amp;s=dvd&lt;/a&gt;\n\nDecoded w/ NERO Ditigal","torrent":{"xt":"urn:btih:8def62754ebf231a8aebc30ea6df389834753a00","amp;dn":"THE+SAND+PEBBLES+MPEG-4+%28DVD+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8def62754ebf231a8aebc30ea6df389834753a00","infoHashBuffer":{"type":"Buffer","data":[141,239,98,117,78,191,35,26,138,235,195,14,166,223,56,152,52,117,58,0]},"announce":[],"urlList":[]}}