{"title":"Martin-Feds Lose Big-Weaver Trial(Ruby Ridge incident)(1993)","uid":4739334,"size":2781277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e1416895286003b7230c728fd65ddc54732bd15&amp;dn=Martin-Feds+Lose+Big-Weaver+Trial%28Ruby+Ridge+incident%29%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"red_gonzo","files":1,"time":1235473469,"description":"This is Len Martin's shocking book Feds Lose Big - The Weaver Trial (1993) which covers the Randy Weaver story and details from the trial including numerous lies told by federal agents that were uncovered by the defense. Many still remember Ruby Ridge as the site of a violent confrontation and siege in the US state of Idaho in 1992 where US Marshals and FBI agents murdered several members of Randy Weaver's family. This fascinating book covers the aftermath and consequent trial of Randy Weaver with an emphasis on government's attempt to frame him and Kevin Harris for crimes they didn't commit. This was done in order to cover up actual crimes of US government that included cold-blood murder of innocent US citizens by police agencies such as the U.S. Marshals Service, Federal Bureau of Investigation (FBI), Bureau of Alcohol, Tobacco and Firearms (BATF) and the Secret Service. In most cases, agents of these various agencies get away with their criminal acts because Sheriffs of the counties where the acts take place, allow them to happen. But occasionally their plans go awry and they find themselves caught with their pants down. They have no fear because protecting them are the federal courts. Some therefore call U.S. District Judges and U.S. Attorneys the greatest coverup gang in America. Feds Lose Big concludes that the Weaver/Harris case is not an isolated incident of misconduct by government agents, but merely another case of an attempt by the all-powerful government to silence a family that might cause trouble for the evil forces that are trying to weaken America, and force it and its citizens into a one-world socialist government. 85 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:8e1416895286003b7230c728fd65ddc54732bd15","amp;dn":"Martin-Feds+Lose+Big-Weaver+Trial%28Ruby+Ridge+incident%29%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e1416895286003b7230c728fd65ddc54732bd15","infoHashBuffer":{"type":"Buffer","data":[142,20,22,137,82,134,0,59,114,48,199,40,253,101,221,197,71,50,189,21]},"announce":[],"urlList":[]}}