{"title":"Shakawkaw on the Isle of Man","uid":3526407,"size":144913544,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:900c06522ad207e5f724df65a6204b2114b1c357&amp;dn=Shakawkaw+on+the+Isle+of+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tagfat","files":1,"time":1158692264,"description":"Shakawkaw on the Isle of Man\n\nI was always curious if you could make a great GPL-video if you had no knowhow or tallent. Others might not find this particular baby &quot;great&quot; but hey its my baby and i like it. Its got a nice technical finesse with swiching into slowmo (!) at the jump somwhere arround Glen Wine , but actually i like the bits just after for musical reasons. Just like i like the Gregwillys hill/Cronkywoody and down for musical reasons.\nYou will note that i have very few cuts, there are only fifteen or so captures, but if you have great driving on a great track you dont nessesarily need more. It also made it easier to redo the captures that i screwed up.\n\nWhat else did i have to learn?\nLast week i knew nothing about moviemaking, something which has not changed a lot. My first capture resulted in 4 gigs of 1600x1200 jpg-files - nice but no fun.\nI skimmed a few lines from GPL2AVI faqs and noted that you should capture with the GPL-replay in max resolution, even if you need to go with 640/380 in captured video. I learned that i could only play the captures in slowmo or less than full screen.\n\nThe captures was put together with Pinacle Studio which i never read the manual for. After a bit of fumbling its bleeding obvious how you do the simple stuff and I just stick to that then.\n\nI would love to learn how to ad GPL-racesound to the captures, but hey i might have time to kill next week too. Also i need to learn how to capture in a format that gives me original aspect ratio, but thats just details.\n\n\nFor a silly cheap production like this you need:\n\nOne Pentium D 805 or better (se http://www.tomshardware.com/2006/05/..._41_ghz_cores/ )\n\nGPL\nGPL2AVI (freware)\nPincacle Studio (comes with my burner)\nGPLcarcam.exe (freware)\n\nA stack of replays to pick from - i used two merged into one with GPL-replay analyser.\n\nSome fairly intense music, preferably with deep lyrics like what i found in &quot;Shakawkaw&quot; (live version).\n\nTwo days or one night with no sleep. I know that when Kevin Clark made his masterpeices - using a candlelit Celeron 700 computer - it took nine hours to render each new version, but hardware is cheap and fast these days so youre running out of exuces.\n\nThis text doubles as credits for the movie, as i dont know how to make those spiffy roling ones.\nThe real artists involved in this are off couse Jim Pearson and Infected Mushroom.\n\nTake 3:\nAdded some engine sound for good effect.\n\nIts a stupid procedure, capturing video with fraps, ripping the video with VirtualDub and then adding the file in Pinacle, but it work most of the time.\n\n","torrent":{"xt":"urn:btih:900c06522ad207e5f724df65a6204b2114b1c357","amp;dn":"Shakawkaw+on+the+Isle+of+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900c06522ad207e5f724df65a6204b2114b1c357","infoHashBuffer":{"type":"Buffer","data":[144,12,6,82,42,210,7,229,247,36,223,101,166,32,75,33,20,177,195,87]},"announce":[],"urlList":[]}}