{"title":"Ke$ha-Tik Tok(Live)-Wushan.AVI","uid":5322503,"size":161862392,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:90f63c8329f7cb05a0139cb70bdb393f2cbd8ebf&amp;dn=Ke%24ha-Tik+Tok%28Live%29-Wushan.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wushan","files":1,"time":1264908734,"description":"                                       Tik Tok\n \n                               Single Kesha Rose Sebert \n\n                                        Ke$ha\n\n                                (born March 1, 1987)\n\n                              \n                               from the album Animal\n   \n\n     better known mononymously as Kesha (stylized as Ke$ha), is an American recording artist. An active musician since 2005, her breakthrough came in early 2009 after appearing on Flo Rida's number one single &quot;Right Round&quot;. Her debut single, &quot;Tik Tok&quot;, was released in August 2009 and reached number one in five countries and set the female weekly download and total weekly Top 40 Mainstream airplay records in the US. Her debut album, Animal, was released in early 2010 and debuted at number one in the US.\n\n      &quot;Tik Tok&quot; made its chart debut on the official New Zealand Singles Chart at number seven on the issue dated October 5, 2009. The following week, it moved up to number one.It held the top spot for a total of five consecutive weeks.The song also charted in Australia where it debuted on the ARIA Charts at number twenty-eight, and reached number one on its third week on the chart. In Europe, the song debuted at number thirty-eight in Sweden on the issue dated October 23, 2009 and managed to peak at number three.The song debuted at thirty-nine in Denmark and peaked at number six. In Norway, the song debuted at number eleven and peaked at number three.The song also charted in both the Flanders and Wallonia regions of Belgium, peaking at number four and one respectively.In Finland, the song debuted at number sixteen and peaked at number seven.It debuted on the official UK Singles Chart at number six on November 8, 2009 and over a period of just under three months climbed to a peak of number four on January 3, 2010 based on downloads alone...\n\n                             Tik Tok (Live) Enjoy!!!","torrent":{"xt":"urn:btih:90f63c8329f7cb05a0139cb70bdb393f2cbd8ebf","amp;dn":"Ke%24ha-Tik+Tok%28Live%29-Wushan.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f63c8329f7cb05a0139cb70bdb393f2cbd8ebf","infoHashBuffer":{"type":"Buffer","data":[144,246,60,131,41,247,203,5,160,19,156,183,11,219,57,63,44,189,142,191]},"announce":[],"urlList":[]}}