{"title":"PPGwave-ProSoundsV.2VSti","uid":4729095,"size":1716847,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:90fb5f3c21334b3b67c03931e99a4861d0ca6f0a&amp;dn=PPGwave-ProSoundsV.2VSti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sHaKiS455","files":-1,"time":1234905980,"description":"                .,.,.,.,.      PPG Wave!   .z.z..z.z.z\n\n\nPPG Wave\nImportant note regarding parameter automation:\nAutomation of parameters has changed in the PPG depending on the\nfunctionality of your host application. The PPG Wave 2.V now sends\nMIDI Controllers to the host when changing parameters rather than\nsending VST automation data.\nThe reason is that VST automation data has no channel information.\nTherefore, the PPG used to encode the channel information into the\nparameter value. On receiption, it decoded the parameter value and\nassigned the change to the right channel. Now, some hosts modify this\nautomation data to e.g. create ramps or to only store the most\nimportant part of the automation values. This results in automation\ndata the PPG doesn't understand. Those hosts are e.g. Logic 5 for Mac\nOS 9 and Cubase SX / SL. To accomodate this problem, the PPG now\nsends MIDI Controllers instead of VST automation data. Those MIDI\nController curves can be edited in the appropriate editors of your\nhost application.\nKeep in mind that MIDI Controllers have MIDI Channels. Therefore, the\ntrack where they are recorded on must be set to the correct MIDI\nOutput (the PPG plug-in, for sure) and MIDI Channel.\nBackward compatibility to existing songs with automation data is\nassured. The receiption of automation data works exactly as in\nprevious versions of the PPG. Only when creating new automations, the\nPPG generates MIDI Controller data instead of VST automation data.\nChanges in V1.2\n07.11.2002\n* [Mac] Carbon version created. Tested with Mac OS X 10.1.5 and 10.2.\n* [Win] Compiled and tested with Windows XP.\nFixes:\n* [All] Fixed crash in Logic when switching between Editor and Control mode.\n* [All] Fixed crash in Logic when switching plug-in to Multi Out.\nEnhancements:\n* [All] Parameter automation is now done with MIDI Controllers instead of VST automation data.\n* [All] Knobs now work as follows:\n* After starting the PPG, they are &quot;slaved&quot; to the knob mode set in the VST host\napplication, e.g. &quot;Circular&quot;, &quot;Linear&quot; or &quot;Relative Circular&quot;.\n* If Shift+PPG-Logo is clicked, they behave linearily, no matter how the knob mode\nin the host is set. This feature is kept to allow linear movements in host applications\nthat don't have a global knob mode feature.\n* If Shift+PPG-Logo is clicked again, their behaviour is slaved to the host again.\nSo, usually, you don't need the Shift+PPG-Logo click anymore but instead use the host's\nknob mode adjustment if available.\n* [All] Envelope 3 Decay rates 62 and 63 now work as in the PPG Wave 2.2 and 2.3. The original\nPPG used these two rates to create an infinite decay. When ENV3 is routed to pitch, this\ncan be used to create a constant detune to accomodate the limited value range of the\nDETUNE parameter.\nIf you created sounds where Envelope 3 Decay was set to 62 or 63 to create a long but\nnot infinite decay, set their decay rates to a value smaller than 62. The sound are not\nconverted automatically because the factory sets were already set to have this infinite\ndecay but the PPG Wave 2.V didn't emulate it properly. Now it does.\n* [All] There's a new parameter in the TUNE page called SEMITONE&gt;KEY:\nOn the original PPG, SEMITONE 1..8 had an effect on the resulting notes that were played.\nThat means, if the keyboard mode was set to POLY, each key played a different note from\nthe SEMITONE list. With this feature, it was possible to play 8 note melodies by playing\nthe same key on the keyboard.\nAlso, SEMITONE 1..8 had an effect on keytrack (KEY&gt;WAVES, KEY&gt;FILTER, KEY&gt;AMP) so sounds\nthat are copied parameter by parameter from the Wave 2.3 to the Wave 2.V might sound\ndifferent.\nIn the PPG Wave 2.V, both features were missing. The first one was not emulated because\nwe thought that it could confuse the customer too much. The second one by mistake.\nSEMITONE&gt;KEY takes care of that. It allows to play 8 note melodies in POLY mode and applies\nthe SEMITONE 1..8 values to keytrack before this in turn is applied to WAVES, FILTER and\nAMP.\nBy default, SEMITONE&gt;KEY is switched OFF to ensure sound compatibility. However, on the\noriginal PPG preset banks you should switch SEMITONE&gt;KEY to ON when you want to listen to\nthe programs as they originally sounded in the PPG Wave 2.3.\nFixes and Improvements in V1.0.1\n24.05.00\n* [All] Fixed changing of Wavetables in Emagic Logic.\n* [All] MIDI Program Change messages are evaluated properly during &quot;Export Audio&quot;.\n* [All] Volume parameter smoothed.\n* [All] Cutoff parameter smoothed.","torrent":{"xt":"urn:btih:90fb5f3c21334b3b67c03931e99a4861d0ca6f0a","amp;dn":"PPGwave-ProSoundsV.2VSti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90fb5f3c21334b3b67c03931e99a4861d0ca6f0a","infoHashBuffer":{"type":"Buffer","data":[144,251,95,60,33,51,75,59,103,192,57,49,233,154,72,97,208,202,111,10]},"announce":[],"urlList":[]}}