{"title":"CHIGLEY EPISODE 12","uid":4482565,"size":104857600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:93fb9a86a7f796689da2d41e1afa1ecf98a95690&amp;dn=CHIGLEY+EPISODE+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mcfc_guvnors","files":1,"time":1225634352,"description":"Episode 12. Willie Munn\n\n\n\nIN BRIEF - Biscuit &amp;#039;stamper&amp;#039; Willie Munn has the chance to prove himself as a Cresswell driver,but being &amp;#039;a dreamer&amp;#039; is a hard habit to break.Although with the help of Lord Belborough he manages to pull it off.\n\n\n\nWe meet Mr.Clamp outside his greengrocers in Trumpton Market Square,loading his truck ready for some deliveries.\n\nAnd we ride with him to the Biscuit Factory where Mr.Fletcher supervises the unloading of the consignment of fruit and veg for their canteen.\n\nClamp informs Mr.Cresswell that his nephew,Willie Munn,is working there,and is invited inside to meet him as he operates &quot;the biscuit stamping machine&quot;.Back outside Cresswell tells Clamp that he&amp;#039;s a good worker but &quot;a bit of a dreamer&quot;, although before leaving,Clamp informs him that he&amp;#039;s actually a good driver which they may find useful.And spookily  prophetic as Mr.Fletcher immediately walks over to inform his boss that the man who operates the boxing machine is ill and &quot;driver McGregor&quot; is the only man who can take his place.So Mr.Cresswell decides to give young Willie a chance and reasons that a temporary replacement for his job would be the least difficult to find.\n\n30 mins later and Willie&amp;#039;s driving along in the van mindful of the tasks Messrs Cresswell &amp; Fletcher have set him 1) Fill up with petrol at Crockett&amp;#039;s Garage 2) Deliver 2 boxes of biscuits to Mrs Dingle at the Post Office 3) Deliver 3 boxes of biscuits to Winkstead Hall and 4) Return to the Factory.\n\nBut he&amp;#039;s so happy to be out driving and away from the noisy stamping machine that he forgets to stop at Crockett&amp;#039;s to fill up and drives straight on to the Post Office.And,whilst driving along the Chigley Road en route to Winkstead Hall,the inevitable happens and he runs out of petrol.Just as well that a phonebox and the railway line are both nearby then,so he decides to ring Lord Belborough,who knows him because he helped paint Bessie when she first arrived.And sure enough his Lordship is happy to help,instructs Brackett to get a can of Mr.Bilton&amp;#039;s lawnmower petrol and they quickly  steam to the rescue.Willie fills up the van,takes some advice about always writing things down and persuades his Lordship to take his 3 boxes of biscuits there and then so he can get back to the Factory without being late.\n\nAnd so Mr.Cresswell&amp;#039;s non-the-wiser and everyone makes it back in time for the 6 o&amp;#039;clock whistle.\n","torrent":{"xt":"urn:btih:93fb9a86a7f796689da2d41e1afa1ecf98a95690","amp;dn":"CHIGLEY+EPISODE+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93fb9a86a7f796689da2d41e1afa1ecf98a95690","infoHashBuffer":{"type":"Buffer","data":[147,251,154,134,167,247,150,104,157,162,212,30,26,250,30,207,152,169,86,144]},"announce":[],"urlList":[]}}