{"title":"James Bond 007 Quantum of Solace Demo [Windows Game]","uid":4522246,"size":722740543,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9428fd4aec22e4d8d2ff678120529c9282853898&amp;dn=James+Bond+007+Quantum+of+Solace+Demo+%5BWindows+Game%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vega0ne","files":2,"time":1227209094,"description":"James Bond is back to settle the score in Quantum of Solace: The Game. Introducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combat skills to progress through missions. Seamlessly blending the heart-pounding action and excitement of the upcoming &quot;Quantum of Solace&quot; feature film with the &quot;Casino Royale&quot; movie, the title propels players into the cinematic experience of international espionage. Based on the renowned Call of Duty 4: Modern Warfare game engine that has been specifically engineered to immerse players in the Bond universe, Quantum of Solace: The Game delivers superior high-definition graphics, reactive AI and visually stunning locations inspired by locales portrayed in the films.\n\nFeatures:\nPaying special attention towards making the game one of the most graphically stunning titles on the Wii, Quantum of Solace: The Game is filled with armed combat, massive explosions and vertigo-inducing chases. Gamers are further drawn into epic movie moments with theatrical camera angles, split screen effects, picture-in-picture sequences, and visually stunning real world locations such as Montenegro, Venice, Bolivia and Austria.\nPlayers fully immerse themselves into the Bond universe utilizing controls designed specifically for the Wii. Players may choose to use the unique Wii Remote and Nunchuk control scheme to seamlessly target and engage their enemies or they can leverage the Wii Zapper to truly step into the shoes of James Bond.\nBringing James Bond to the Wii for the first time, gamers now have the ability to battle their friends in online multiplayer battle. Players can also engage with up to four players in split screen local multiplayer games, a mode that is exclusive to the Wii platform.","torrent":{"xt":"urn:btih:9428fd4aec22e4d8d2ff678120529c9282853898","amp;dn":"James+Bond+007+Quantum+of+Solace+Demo+%5BWindows+Game%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9428fd4aec22e4d8d2ff678120529c9282853898","infoHashBuffer":{"type":"Buffer","data":[148,40,253,74,236,34,228,216,210,255,103,129,32,82,156,146,130,133,56,152]},"announce":[],"urlList":[]}}