{"title":"a/k/a Tommy Chong (2006)","uid":4906757,"size":1471125504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9636d9b326f8c4745443faaf8580721ce66ebf33&amp;dn=a%2Fk%2Fa+Tommy+Chong+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cmoyer4","files":1,"time":1242934776,"description":"a/k/a Tommy Chong offers a sometimes frightening, often hilarious account of Operation Pipe Dreams, a nationwide drug paraphernalia sting operation spearheaded by former Attorney General John Ashcroft. After a fully armed SWAT team raided the 65 year old comedian's home in February of 2003, Chong was sentenced to 9 months in federal prison for conspiracy to manufacture and distribute drug paraphernalia. Of the 55 defendants, Chong was the only one with no prior convictions to receive jail time. Justifying the 9 month sentence, the prosecutor cited the classic 1978 Cheech &amp; Chong film Up In Smoke as evidence that Chong had become wealthy &quot;trivializing law enforcement efforts to combat marijuana trafficking and use.&quot;\n\nAs Roger Ebert said &quot;You do not have to approve of drugs to be offended.&quot;\n\nThe film explores how Chong's legacy as a pro-marijuana comedian made him the target of an over-zealous Justice Department. Operation Pipe Dreams cost tax-payers $12 million. As Chong himself put it &quot;The only weapons of mass destruction the Bush administration has found... are my bongs.&quot;","torrent":{"xt":"urn:btih:9636d9b326f8c4745443faaf8580721ce66ebf33","amp;dn":"a%2Fk%2Fa+Tommy+Chong+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9636d9b326f8c4745443faaf8580721ce66ebf33","infoHashBuffer":{"type":"Buffer","data":[150,54,217,179,38,248,196,116,84,67,250,175,133,128,114,28,230,110,191,51]},"announce":[],"urlList":[]}}