{"title":"[DVD5 ITA]Lupin III - Viaggio nel pericolo[CR-Bt]","uid":4682758,"size":4655808512,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:986edb84f25c9068f6e7118ed1fe2e1e8223caf7&amp;dn=%5BDVD5+ITA%5DLupin+III+-+Viaggio+nel+pericolo%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CR-Bt","files":21,"time":1233132388,"description":"L'inizio della storia appare subito piuttosto insolito, con Zenigata che invece di dover catturare Lupin si trova a dover sgominare un'organizzazione criminale chiamata &quot;Ghost Shell&quot; e con il nostro ladro che si trova a dargli una mano. Collaborazione al posto della rivalitÃƒÂ ? Si direbbe di sÃƒÂ¬ e le cose parrebbero andare piuttosto bene. Parrebbero sÃƒÂ¬, per lo meno finchÃƒÂ© non entra in scena un sottomarino che la Ghost Shell vuole assolutamente avere e una scienziata russa che conosce Jigen meglio di quanto si direbbe a prima vista. Da questo momento la storia si sviluppa in un intricato susseguirsi di momenti d'azione e di riflessione che in certi momenti sfiorano quasi il drammatico, fino al bellissimo epilogo.\nPer la prima volta, Lupin e Zenigata si trovano dalla stessa parte! La loro missione riguarda l'organizzazione Shot Shell, una banda di trafficanti di armi che causa guerre per procurarsi nuovi mercati. Naturalmente, Lupin e i suoi amici vogliono mettere le mani sui soldi malguadagnati della Shot Shell. Come prima cosa, rubando il sommergibile Ivanov, Lupin si mette in contatto con il capo della Shot Shell. Certo, distruggere l'organizzazione rimetterebbe Zenigata sulle loro tracce, ma questa non e` una cattiva idea...\n\nMaggiori info su http://colombo-reloaded.org\n\nInspector Zenigata has been removed from the Lupin case which leaves him despondent, and he ends up drinking with Lupin &amp; Jigen. Lupin decides that he and his gang should work with Zenigata to solve his new case, investigating a group of arms dealers known as Shot Shell. Lupin gathers his partners together (Jigen, Goemon, &amp; Fujiko), and with Zenegata they steal a Russian submarine. They kidnap a scientist named Karen Korinsky to help them operate the sub, and also to protect her from Shot Shell. Meanwhile the ICPO assigns a man named Keith Hayden to the Lupin case, and unlike Zenigata he wants Lupin and his group dead. Where ever Lupin and friends go, Keith follows, as the officer attempts to pick them off one by one.\n\nMore info at http://colombo-reloaded.org","torrent":{"xt":"urn:btih:986edb84f25c9068f6e7118ed1fe2e1e8223caf7","amp;dn":"%5BDVD5+ITA%5DLupin+III+-+Viaggio+nel+pericolo%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"986edb84f25c9068f6e7118ed1fe2e1e8223caf7","infoHashBuffer":{"type":"Buffer","data":[152,110,219,132,242,92,144,104,246,231,17,142,209,254,46,30,130,35,202,247]},"announce":[],"urlList":[]}}