{"title":"HISTORY OF POP AND ROCK MUSIC - part 280","uid":6121221,"size":1823871144,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:99133b137971851044c36884b4bc93394786d4d2&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+280&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1295749713,"description":"                       PART  280\n    \n                                          \n          LYNYRD  SKYNYRD -  That Smell  (1977)\n          LYNYRD  SKYNYRD -  Saturday Night Special  (1977)\n          ALLMAN BROTHERS BAND  -  Jessica  (1977)\n          ALLMAN BROTHERS BAND  -  Whipping Post (1977)\n          ALLMAN BROTHERS BAND  -  Statesboro Blues  -  cover versions\n          THE DOOBIE BROTHERS  -  Listen to the music   (1979)\n          THE DOOBIE BROTHERS  -  Long Train Runnin  (1996)\n          LYNYRD  SKYNYRD  -  Free Bird \n\n\n\n     &quot;That Smell&quot; is a song by the southern rock band Lynyrd Skynyrd. Written by Ronnie Van Zant and guitarist Allen Collins, it was released in 1977 on the album Street Survivors. At the time the song was written, the band had been drinking and doing many different drugs. Van Zant had said that he started drinking heavily to relieve the pressure of performing in front of large audiences.The song's name comes from the fact that there is a saying among heroin users that the smell of cooking it brings you right back to shooting it. Van Zant's inspiration for the song was the increasing reckless indulgences of the band members culminating in the evening when guitarist Gary Rossington got drunk and high and survived the crash of his new car into an oak tree along Mandarin Road in Jacksonville, Florida. Van Zant was thus inspired to write the song as a warning about the consequences of careless overuse of drugs and alcohol. Van Zant said, &quot;I had a creepy feeling things were going against us, so I thought I'd write a morbid song (as a warning)       \n     &quot;Saturday Night Special&quot; is a hard rock song by Lynyrd Skynyrd. It is the opening track on their album &quot;Nuthin' Fancy&quot;. It was their third studio album, and their first to reach the Top 10, peaking at #9 on the U.S. albums chart.The song  &quot;Saturday Night Special&quot; addresses the issue of gun control.            \n     &quot;Jessica&quot; is a rock instrumental written by Dickey Betts, guitarist of The Allman Brothers Band, and Les Dudek, who played with them soon after Duane Allman's death. &quot;Jessica&quot; was first released on the band's 1973 album &quot;Brothers and Sisters&quot;.The piece, along with &quot;Ramblin' Man&quot;, is one of the two tracks from the album which marked the beginning of a new era for the Allman Brothers Band following the deaths of Duane Allman and Berry Oakley. The song is named for Jessica Betts, the daughter of Dickey Betts and Sandy Bluesky.Although not successful as a single, topping out at #65 on the Billboard Hot 100 chart, the song achieved considerable airplay on progressive rock and album oriented rock radio and helped make &quot;Brothers and Sisters&quot; a commercial success. A later live version of &quot;Jessica&quot; won a Grammy Award in 1996, twenty-three years after the initial release, for Best Rock Instrumental Performance.\n    &quot;Whipping Post&quot; is a song by The Allman Brothers Band. Written by Gregg Allman, the five-minute studio version first appeared on their 1969 debut album The Allman Brothers Band. But the song's full power only manifested itself in concert, when it was the basis for much longer and more intense performances.[1][2] This was captured in a classic take on the Allman Brothers' equally classic 1971 double live album At Fillmore East,[3] where a 23-minute epic rendition takes up the entire final side.[4][5] It was this recording that garnered &quot;Whipping Post&quot; spots on both the Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll list[6] and Rolling Stone's 500 Greatest Songs of All Time list.\n   &quot;Statesboro Blues&quot; is a blues song in the key of D written by Blind Willie McTell; the title refers to the town of Statesboro, Georgia. Covered by many artists, the version by The Allman Brothers Band is especially notable and was ranked #9 by Rolling Stone in their list of the 100 Greatest Guitar Songs of All Time. In 2005, The Atlanta Journal-Constitution ranked &quot;Statesboro Blues&quot; number 57 on its list of 100 Songs of the South.  \nThe song is still a staple of The Allman Brothers Band's live shows, now often with Derek Trucks on slide.\n\n\n\n","torrent":{"xt":"urn:btih:99133b137971851044c36884b4bc93394786d4d2","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+280","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99133b137971851044c36884b4bc93394786d4d2","infoHashBuffer":{"type":"Buffer","data":[153,19,59,19,121,113,133,16,68,195,104,132,180,188,147,57,71,134,212,210]},"announce":[],"urlList":[]}}