{"title":"Calibre - 2.5 - Linux (x64)","uid":11153670,"size":58659488,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:9a34821b619fabecd3819bd45369d0a5b3f13e63&amp;dn=Calibre+-+2.5+-+Linux+%28x64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Doctor-","files":1,"time":1412378981,"description":"Version 2.5 (Released 3 October 2014) of Calibre licensed under the GNU GPL v.3 for Linux (x64).\n\nCalibre is a free and open source e-book library management application developed by users of e-books for users of e-books.\n\nOfficial site: calibre-ebook.com\n\nPlease seed for as long as you can.\n\nChanges in 2.5\nNew Features\n\n    E-book viewer: Allow changing the website that is used as a dictionary for looking up words in the viewer. Click the Preferences button in the viewer and choose the dictionaries tab to customize the website.\n    Edit book/Book polishing: When embedding fonts or subsetting embedded fonts, handle the :first-letter and :first-line pseudo-element style rules.\n    Windows driver for Trekstor Pyrus 2 LED.\n\n\n\nBug Fixes\n\n    Fix a typo preventing calibre from recognizing the new Kobo Aura H2O\n    Edit Book: Spell Check: Fix replaced words coming back into the list when toggling the &quot;Show only misspelled words&quot; setting\n    Edit Book: Spell Check: Fix replacing a word with multiple words causing the replacements to show up erroneously in the list of misspelled words\n    Edit Book: Fix leading or trailing hyphens on words being ignored when spell checking.\n    E-book viewer: Fix a regression, caused by a Qt 5 behavior change, that caused incorrect colors to be shown when viewing MOBI files that use CSS 3 color specifications internally.\n    MOBI Output: Handle input documents that use CSS 3 syntax for colors by converting the color to the #RRGGBB format required for MOBI\n    Tag Browser: Fix drag and drop of books onto a language not setting the language.\n    Tag Browser: When renaming an item that is currently being searched for, remove the search indicator, as the search will no longer match the renamed item.\n    Bulk metadata edit: Fix getting cover from EPUB files that have no cover image by rendering the first page as the cover not working.\n    Custom cover generation: Fix disabled color schemes not being saved\n    Wireless device driver: Fix a regression in 2.4 that caused book matching to run slowly when connecting to calibre companion\n\n\nImproved news sources\n\n    Sueddeutsche Zeitung\n    The Hindu\n    Carta","torrent":{"xt":"urn:btih:9a34821b619fabecd3819bd45369d0a5b3f13e63","amp;dn":"Calibre+-+2.5+-+Linux+%28x64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a34821b619fabecd3819bd45369d0a5b3f13e63","infoHashBuffer":{"type":"Buffer","data":[154,52,130,27,97,159,171,236,211,129,155,212,83,105,208,165,179,241,62,99]},"announce":[],"urlList":[]}}