{"title":"Summer of 42 Dvdrip H264 Bookerdog.mp4","uid":5003015,"size":808052817,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9eb1f9c220b10f4e620dcadf5f8fb8de7f0cca8d&amp;dn=Summer+of+42+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bookerdog","files":-1,"time":1247602104,"description":"Category\tJazz, Dramas, Romance, Coming Of Age, Nostalgic, Bucolic\nStarring\tJennifer O'Neill, Robert Mulligan, Jerry Houser, Lou Frizzell, Gary Grimes, Walter Scott, Oliver Conant, Christopher Norris\nDirector\tRobert Mulligan\nComposer\tMichel Legrand\nDirector of Photography\tRobert Surtees\nEditor\tFolmar Blangsted\nProducer\tRichard Roth\nProduction Designer\tAlbert Brenner\nScreenwriter\tHerman Raucher\n\nTender coming-of-age tale about a teenage boy who's spending the summer of 1942 in Long Island with his two buddies. He meets an alluring older woman whose husband is abroad serving in World War II. The two begin a relationship, leading to the young man's first sexual encounter, an event that changes the teenager's perspective forever.\n\nGently nostalgic, Robert Mulligan's tender and insightful look at three teenage boys' approach to the mysteries of love and sex takes place on the coast of New England during World War II. While his two friends devote their time to investigating the process of getting laid, Hermie finds himself falling in love with the young wife of a U.S. serviceman away at the war. Stumbling over their misconceptions, fears, and ignorance, the boys fumble their way toward adulthood during their last summer of youth and innocence. Noted for his skill with young actors, Robert Mulligan (TO KILL A MOCKINGBIRD) draws out the insecurities of growing up from his cast and will touch viewers reminiscing about their own coming of age.","torrent":{"xt":"urn:btih:9eb1f9c220b10f4e620dcadf5f8fb8de7f0cca8d","amp;dn":"Summer+of+42+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb1f9c220b10f4e620dcadf5f8fb8de7f0cca8d","infoHashBuffer":{"type":"Buffer","data":[158,177,249,194,32,177,15,78,98,13,202,223,95,143,184,222,127,12,202,141]},"announce":[],"urlList":[]}}