{"title":"CrossOver Games 7.1.1 Mac OS X [Lame Duck 2008-10-28 Free Downlo","uid":4472838,"size":39665978,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a196393380b956224f5384c5d8c9dfea325bcc73&amp;dn=CrossOver+Games+7.1.1+Mac+OS+X+%5BLame+Duck+2008-10-28+Free+Downlo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anonstuff","files":1,"time":1225210081,"description":"Don't forget to get a serial NOW!\n\nSince CodeWeavers' site was temporarily down... (http://www.codeweavers.com)\n\n______________________________________________________________________\n\nCrossOver Games 7.1.1 Mac OS X [Lame Duck 2008-10-28 Free Download Day - NO serial]\n\n______________________________________________________________________\n\nMain Website Temporarily Offline\n\nDue to the high volume of traffic for the Lame Duck Challenge Free Offer, we have temporarily streamlined the CodeWeavers main website.\n\n    We apologize for any inconvenience. We still love Digg, even if our server disagrees. ;-)\n\n\nUse this form to register for a serial number. Due to load, expect your serial number to be emailed to you in a few days.\n\nE-Mail: \n\n\n\n\n\nFull Version Downloads\n\nFor Tuesday, October 28, 2008 only, we are putting up fully unlocked builds.\n\nDownload CrossOver Mac Pro\n\nDownload CrossOver Games Mac\n\nDownload CrossOver Linux Pro\n\nDownload CrossOver Games Linux\n\nAbout CodeWeavers\n\nCodeWeavers' mission is to make Linux and Mac OS X fully Windows compatible operating systems. We do this through the power of Wine, which powers all of our CrossOver products. The CrossOver products make it possible to run Windows programs on Mac OS X and Linux without needing a copy or license for Windows itself.\n\nAbout Wine\n\nWine is an open-source reimplementation of the Win32 API for Unix-based operating systems. Wine allows Windows applications to be run without a Windows operating system license. CodeWeavers is the largest corporate sponsor of the Wine Project, and contributes all of its work to free Wine.\n\n__________________________________________________\n\n\nA Goal has been met!\n\nYes! You heard it right! On October the 14th, the average price of a gallon of gasoline dropped below $2.79 a gallon here in the Twin Cities. Sure, the decline of gas prices was due to the total collapse of the world economy, and the price of oil spiraling into a vortex of doom as a result. And to be honest, we're not sure if this was actually the work of President Bush, or whether our Lame Duck Challenge had more of an impact on the economy than we suspected. But hey: a deal's a deal, right? Our giving away all of our software for free is just our way of trying to make good on the loss of untold $trillions worth of equity from American pocketbooks. We hope you agree that it was all worth it to get back to the good old days of cheap gas again. Ummm, yeah.\n\nIn any case, just click on this link to get your free software!\n\nMore information in our Press Release.\nIf Bush gets it done, America gets FREE software!\n\nGoal Achieved! Oh Crap--My Bad!\n\nMy fellow Americans. As you probably know by now, we recently succeeded in reaching one of our Lame Duck Presidential Challenge Goals . Of course, we reached it in perhaps the worst way possible--by destroying the world economy. And while ostensibly President Bush was to get the credit/blame for meeting our goals, the bottom line is that I cannot help but feel personally responsible for the greatest financial collapse since the 1930s.\n\nHow was I to know that President Bush would take my challenge so seriously? And, give the man credit, I didn't think there was *any* way he could pull it off. But engineering a total market meltdown - wow - that was pure genius. I clearly underestimated the man.\n\nI'm ashamed that I goaded him into this and take full responsibility for the collapse of any savings you might have. Please accept our free software as my way of apologizing for the global calamity we now find ourselves embroiled in.","torrent":{"xt":"urn:btih:a196393380b956224f5384c5d8c9dfea325bcc73","amp;dn":"CrossOver+Games+7.1.1+Mac+OS+X+%5BLame+Duck+2008-10-28+Free+Downlo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a196393380b956224f5384c5d8c9dfea325bcc73","infoHashBuffer":{"type":"Buffer","data":[161,150,57,51,128,185,86,34,79,83,132,197,216,201,223,234,50,91,204,115]},"announce":[],"urlList":[]}}