{"title":"Voila v 3.0.4 + Core keygen","uid":6443013,"size":24874825,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a3ce2ba76f0d777b347234411df613003b7b55d8&amp;dn=Voila+v+3.0.4+%2B+Core+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1307031645,"description":"Official Web Site: &lt;a href=&quot; http://www.globaldelight.com/voila/voila_overview.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.globaldelight.com/voila/voila_overview.html&lt;/a&gt;\n\nVoila Screen Capturing Tool is a power-packed package with the right combination of Capturing, Recording, Annotating, Organizing and Sharing Tools making it the only Screen Capture Tool you will ever need!\n\nVoila is an All-in-One screen-capturing solution for your Mac! What we believe is, why bore people with lengthy explanations? Simply explain things with a screen recording or a screenshot to show them what you mean. Voila is a powerful Image Capturing, Screen Recording and Annotating tool on the Mac platform, all packed into one lean package. Loaded with various options, Voila enables you to quickly and easily do what you do, The Best!\n\nHighlights:\n\n* Flexible Screen Capture Modes:\nCapture still shots in Full Screen, Selection, Window, Freehand, Menu with Title, iSight, with/without cursor, multiple selections and multiple screens\n\n* Webpage Capture\n\nCapture entire web pages, portions of the web page and DOM elements and retain important Metadata such as URL, Tags &amp; Description\n\n* Screen Recording &amp; Trimming\n\nRecord Full Screen or a Selected region of your desktop, with/without cursor and trim the videos using the QuickTime player.\n\n* Screenshot Editing &amp; Annotation\n\nApply Callouts, Text, Blur, Eraser, Stamps, Marquee and more to make your images more attractive and informative. You can resize images to your needs.\n\n* Effects\n\nEnhance your images further with Filters, Edges, Crop, Spotlight and more\n\n* Sharing\n\nShare instantly via YouTube, Flickr, FTP, SFTP or email. Or export to other documents. You can also obtain your last captured snapshot from the global clipboard\n\n* Image/Video Export\n\nExport in various formats your images, such as PNG, JPG, TIFF and more and videos in various formats such as MOV, AVI, MPEG 4 and more\n\n* Organize your work\n\nCreate rule-based smart collections and add details to your files such as Title, Description and more\n\n* Keyboard shortcuts\n\nCustomize keyboard shortcuts. You can also assign Function keys for single button capturing ease.\n\nSystem Requirements:\n\nMac OS X 10.5.8 or newer\n\n-- PLEASE SEED --\n\n\t\t","torrent":{"xt":"urn:btih:a3ce2ba76f0d777b347234411df613003b7b55d8","amp;dn":"Voila+v+3.0.4+%2B+Core+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3ce2ba76f0d777b347234411df613003b7b55d8","infoHashBuffer":{"type":"Buffer","data":[163,206,43,167,111,13,119,123,52,114,52,65,29,246,19,0,59,123,85,216]},"announce":[],"urlList":[]}}