{"title":"Les 4 Guitaristes de l'Apocalypso-Bar - World Tour 1998 - TQMP","uid":4956934,"size":485303632,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4134008511ca0ad033a8bdd645e0791636324c9&amp;dn=Les+4+Guitaristes+de+l%5C%27Apocalypso-Bar+-+World+Tour+1998+-+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mio959mao","files":26,"time":1245113971,"description":"Put together by Montreal guitarist AndrÃƒÂ© Duchesne, Les 4 Guitaristes de l'Apocalypso-Bar was a conceptual electric guitar quartet (plus drums), something rarely seen before. His longest-lasting project (four years), it was also the one that got the most international attention, thanks to the presence of ex-Henry Cow drummer Chris Cutler (some say it served as the blueprint for the Fred Frith Guitar Quartet). The group released two LPs on Ambiances MagnÃƒÂ©tiques in 1987 and 1989, although titles and recording dates are willingly misleading; after all, this was a band from the future. As evidence of this, both albums were reissued in 1995 by ReR Megacorp under the title World Tour 1998.\n\nThere are several layers of perversity in evidence here: the Biblical wordplay in the band name, the &quot;Nearly a Million Copies Sold!&quot; notice on the front cover, and the fact that the CD (which consists of two previously-released LPs, World Tour and Fin de Siecle) was released in 1995 rather than 1998. All should serve as a tip-off to the attentive listener: this may be an avant-garde supergroup, but it's not one that takes itself very seriously. Guitarists Andre Duchesne, Rene Lussier, Jean-Pierre Bouchard, and Roger Boudrealt (helped out on drums by the redoubtable Chris Cutler) serve up a consistently impressive, if not always completely enthralling, program of carefully composed weirdness that never devolves into freeform skronk but sometimes gets just a bit too longwinded for its content. This is more of a problem on the first part of the album (World Tour), with its rather boring four-part &quot;La Chute de la Maison d'Usher&quot; and the rather circus-y &quot;Ton Corps dans Ma Memoire&quot; The second part (Fin de Siecle) is more tightly organized and consistently fun. Overall, this is an album that is sure to appeal to fans of Henry Cow and of Fred Frith's solo work, and to guitarists of all stripes.\n\nFLAC and full covers\nenjoy\n","torrent":{"xt":"urn:btih:a4134008511ca0ad033a8bdd645e0791636324c9","amp;dn":"Les+4+Guitaristes+de+l%5C%27Apocalypso-Bar+-+World+Tour+1998+-+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4134008511ca0ad033a8bdd645e0791636324c9","infoHashBuffer":{"type":"Buffer","data":[164,19,64,8,81,28,160,173,3,58,139,221,100,94,7,145,99,99,36,201]},"announce":[],"urlList":[]}}