{"title":"The Killing [Remake] 1x09 HDTV Spanish by tony","uid":6761220,"size":374316572,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a61b62ab5c0d98cb51f378df42abee000aa4c61b&amp;dn=The+Killing+%5BRemake%5D+1x09+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carambolas","files":3,"time":1319211889,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n  &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\n'The Killing' es el resultado de la adaptaciÃƒÂ³n que la cadena norteamericana AMC ('Mad Men', 'The Walking Dead') y la guionista Veena Cabreros Sud ('Caso abierto') han realizado de la serie danesa 'Forbrydelsen' (estrenada tambiÃƒÂ©n como 'The Killing' fuera de Escandinavia), una adaptaciÃƒÂ³n que no sÃƒÂ³lo no traiciona al original, sino que lo enriquece asumiendo riesgos propios como es el hecho de que esta nueva versiÃƒÂ³n introduzca algunas variantes sobre el caso y sea tambiÃƒÂ©n perfectamente creÃƒÂ­ble.\nPara ello, ha contado con varios colaboradores, entre ellos, el guionista danÃƒÂ©s SÃƒÂ¸ren Sveistrup, uno de los responsables de 'Forbrydelsen', presente como guionista y productor en los crÃƒÂ©ditos de varios episodios de 'The Killing', y realizadores de prestigio, como Ed Bianchi, responsable de la producciÃƒÂ³n de HBO 'Deadwood', y la cineasta polaca Agnieszka Holland, directora de numerosas pelÃƒÂ­culas y series en Estados Unidos, entre ellas 'El jardÃƒÂ­n secreto', 'Washington Square', 'El tercer milagro' y episodios de 'The Wire: Bajo escucha', 'Caso abierto' y 'Treme'.\nLas dos series parten de una premisa idÃƒÂ©ntica: una inspectora de policÃƒÂ­a, a punto de abandonar el servicio porque se traslada a otra ciudad junto a su pareja y su hijo, se ve envuelta en el que estÃƒÂ¡ llamado a ser el caso de su vida, la desapariciÃƒÂ³n de una adolescente cuyo cuerpo serÃƒÂ¡ encontrado en el maletero de un coche. El crimen trastocarÃƒÂ¡ todos sus planes ya que aplazarÃƒÂ¡ su traslado y afectarÃƒÂ¡ a su vida personal.\nA partir de aquÃƒÂ­, la versiÃƒÂ³n americana de 'The Killing' asume riesgos propios, contextos que no siempre van a ser iguales a los del original y la inclusiÃƒÂ³n de una serie de situaciones que abocan a lo que parece un final diferente. AMC y el equipo de guionistas liderado por Veena Cabreros Sud no se han limitado a cambiar Copenhague por Seattle, han querido ir mucho mÃƒÂ¡s allÃƒÂ¡, dotar a la serie de su propia personalidad y presentar una historia que estÃƒÂ¡ tan bien contada y dosifica con tal maestrÃƒÂ­a las claves del gÃƒÂ©nero de investigaciÃƒÂ³n que atrapa al espectador desde el primer minuto.\nLa originalidad de 'The Killing' reside en el hecho de ser una historia contada desde numerosos puntos de vista en la que cualquiera puede ser el asesino. En el punto de mira de la policÃƒÂ­a hay varios frentes abiertos: el novio de la joven, sus padres, el colegio con profesores y compaÃƒÂ±eros y, por ÃƒÂºltimo, un polÃƒÂ­tico aspirante a alcalde que parece que tambiÃƒÂ©n tiene mucho que esconder.\nCada episodio se compone es un paso adelante en la investigaciÃƒÂ³n, un nuevo eslabÃƒÂ³n en la cadena de sospechas que proporciona giros de vÃƒÂ©rtigo de los que no puedes despegar la atenciÃƒÂ³n.","torrent":{"xt":"urn:btih:a61b62ab5c0d98cb51f378df42abee000aa4c61b","amp;dn":"The+Killing+%5BRemake%5D+1x09+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a61b62ab5c0d98cb51f378df42abee000aa4c61b","infoHashBuffer":{"type":"Buffer","data":[166,27,98,171,92,13,152,203,81,243,120,223,66,171,238,0,10,164,198,27]},"announce":[],"urlList":[]}}