{"title":"Naked City - SE04 EP01 - Hold For Gloria Christmas.divx","uid":5143814,"size":343656908,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a68af0cde73e98d724bb8eadf1a7581d544d2c31&amp;dn=Naked+City+-+SE04+EP01+-+Hold+For+Gloria+Christmas.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AdamFlint","files":1,"time":1257102941,"description":"Naked City TV series.\n\nSE04 EP01 - Hold for Gloria Christmas (1962)\n\n&quot;Greenwich Village poet Duncan Kleist (Burgess Meredith) goes on a violent rampage early one morning, accosting people he meets for money and for help in mailing a parcel he's carrying. This leads to a confrontation with Stanley Dorkner (Herschel Bernardi). The two argue and fight, and Kleist is left to die on the street alone, his parcel gone and no witnesses to the assault. Detective Adam Flint (Paul Burke) leads the investigation -- but to determine who killed Kleist, he must first find out why he was killed. Flint interviews Mildred Pepper (Eileen Heckart), whom he lived with and abused for 20 years; Kleist's boyhood friend Kip Harris (Sanford Meisner), now a successful publisher, who wanted to see more of Kleist's work in print; Dorkner, to whom Kleist owed a 500-dollar bar tab; and the people with whom Kleist crossed paths on the last night of his life. The detective pieces together the tormented life of a shattered genius and finds out that Kleist had just been told that he had only days to live, a result of his alcoholism; he also learns that Kleist had planned to mail his unpublished manuscripts to his home town in Iowa, specifically to a woman he'd conjured up in his ramblings across the years named Gloria Christmas. Flint also discovers that the manuscripts were valuable enough to kill for -- and for Kleist to kill for. A humiliating confrontation with a young poet (Alan Alda) at Dorkner's tavern the night before Kleist's death had only brought matters to a head, and led to the murderous confrontation.&quot; (from Allmovie.com)\n\nThis is another of my favorite Naked City episodes.\n\n\nThere are 56 more episodes in my collection waiting to be added to TPB - As soon as the first four are well-seeded I'll resume adding more.","torrent":{"xt":"urn:btih:a68af0cde73e98d724bb8eadf1a7581d544d2c31","amp;dn":"Naked+City+-+SE04+EP01+-+Hold+For+Gloria+Christmas.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a68af0cde73e98d724bb8eadf1a7581d544d2c31","infoHashBuffer":{"type":"Buffer","data":[166,138,240,205,231,62,152,215,36,187,142,173,241,167,88,29,84,77,44,49]},"announce":[],"urlList":[]}}