{"title":"Wanda Jackson [2011) the Party ain't over","uid":6143751,"size":73469393,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a7cd4d10ffdf1927288f3ae6e974be674112e158&amp;dn=Wanda+Jackson+%5B2011%29+the+Party+ain%5C%27t+over&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dwain-o","files":12,"time":1296594434,"description":"Wanda Jackson is known as the Queen of Rockabilly and she has an over 50 year career in the business to prove it.  A favorite (and one-time girlfriend) of Elvis Presley, Jackson had a string of hit songs in the 50's and early 60's that included &quot;Fujiyama Mama&quot;, &quot;Right or Wrong&quot;, and &quot;A Little Bitty Tear&quot;.  With the rise of the Beatles and the Psychedelic Rock era, Jackson moved into Country and Gospel Music, falling into a bit of obscurity.\n\nBut in recent years, Jackson has seen a career revival.  Now 73 years old, Jackson was inducted into the Rock and Roll Hall of Fame in 2009 and now guitarist and producer Jack White is bringing the same magic he used to revive the career of Loretta Lynn to bear on Jackson's gravel voice with The Party Ain't Over.\n\nThe Party Ain't Over should be a major kick in the pants for Wanda Jackson's career.  Jack White surrounds her with a wall of instruments and his own trademark guitar reverb sound to make a group of old songs sung by an old singer sound like something fresh and new.  The Party Ain't Over is a full on assault of horns, keys, and guitars that is anything but subtle.\n\nBut this isn't a Jack White album and the star of The Party Ain't Over is undoubtably Wanda Jackson.  Displaying a surprisingly vibrant amount of sass for a grandmother who, until recently, had been known for the Gospel Country tour circuit.  She blows through Little Richard's &quot;Rip It Up&quot; like she owns the song.  She infuses brand new life into Bob Dylan's &quot;Thunder on the Mountain&quot;, aided by some strong Rockabilly piano and some soaring brass.  Hank Williams' &quot;Dust on the Bible&quot; is a nod to Jackson's Gospel years and the song has never sounded better.  The album's first single is Johnny Kidd's &quot;Shakin' All Over&quot; and Jackson confirms the title of her album by bringing the party hard with the song.\n\nBut the undisputed jewel of The Party Ain't Over is the riskiest track, Amy Winehouse's &quot;You Know I'm No Good&quot;.  It would be very easy to listen to a 73 year old sing that song and enjoy it only for the irony.  But Jackson's rasp absolutely drips with seduction, more so than in Winehouse's original actually.  The song is also destined to become a live-show favorite as Wanda Jackson has a ball with it, brining out her best Marilyn Monroe poses on stage.\n\nI hope to see more White/Jackson collaboration albums in the future.  It's a pairing that works on so many levels and you can tell from both their interviews and their stage presence together that this goes beyond a mutual admiration society to a real friendship.  I can't think of many artists who deserve to end their career on such a high note as Wanda Jackson.  She is, or was, one of the forgotten pioneers of Rock and Roll, deserving of a pedestal just as high as Little Richard or Chuck Berry.  She opened doors for women that had never been opened before and, with The Party Ain't Over, she shows she's still not just walking through those doors but strutting confidently.\n","torrent":{"xt":"urn:btih:a7cd4d10ffdf1927288f3ae6e974be674112e158","amp;dn":"Wanda+Jackson+%5B2011%29+the+Party+ain%5C%27t+over","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7cd4d10ffdf1927288f3ae6e974be674112e158","infoHashBuffer":{"type":"Buffer","data":[167,205,77,16,255,223,25,39,40,143,58,230,233,116,190,103,65,18,225,88]},"announce":[],"urlList":[]}}