{"title":"Robert Jordan - Het Rad des Tijds 2- De grote jacht TBS","uid":6464515,"size":761504300,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a85e3b6ceb08c42bdb7e2acc46191378fa2259d5&amp;dn=Robert+Jordan+-+Het+Rad+des+Tijds+2-+De+grote+jacht+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1307914554,"description":"Audioboek - Robert Jordan - Het Rad des Tijds Boek 2- De grote jacht\n\nBeschrijving\n De Hoorn van Valere is een legendarisch artefact dat naar verluidt de helden van weleer kan oproepen. Om die reden wordt elke honderd jaar de Grote Jacht op de Hoorn aangekondigd. Elke nieuwe jacht leidt onveranderlijk tot nieuwe avonturen die door de barden worden bezongen. Maar dit keer verloopt alles anders. De Hoorn is gevonden en dat feit zorgt voor veel onrust. Want De Hoorn verkeert nu in handen van het Kwaad.\n \n\n\n\nRecensie(s)\nNBD|Biblion recensie\n De jonge dorpeling Rhald Althor heeft al eens Ra'abramon, de Duistere, bestreden en overwonnen, maar Rhald weigert te aanvaarden dat hij door het Rad des Tijds (een metafysische, semi-goddelijke kracht) gekozen is als de Herrezen Draak, de voorvechter van de goede krachten in de patronen die geweven worden in het Lot. Wanneer zijn vriend in doodsgevaar komt, moet Rhald echter wel uit zijn schulp kruipen. De legendarische Grote Jacht naar de Hoorn van Valere begint, een jacht naar een magische hoorn die dode helden kan doen herrijzen. De hoorn wordt gevonden, maar gestolen. Rhalds speurtocht brengt hem tot dieper inzicht in zichzelf, zijn gezellen en vooral zijn eigen lotsbestemming. Op zichzelf leesbaar tweede deel van de tot dusver elfdelige fantasy-saga 'Het rad des tijds', begonnen met 'Het oog van de wereld'. Sterk getekende personages, vlotte fantastische actie in een wereld vol goede en duistere magie. Wel moeilijk door de complexe plot en het grote aantal personages; handig is daarom de lijst van personen en plaatsen achterin. Kleine druk.\n \n\nTBS","torrent":{"xt":"urn:btih:a85e3b6ceb08c42bdb7e2acc46191378fa2259d5","amp;dn":"Robert+Jordan+-+Het+Rad+des+Tijds+2-+De+grote+jacht+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85e3b6ceb08c42bdb7e2acc46191378fa2259d5","infoHashBuffer":{"type":"Buffer","data":[168,94,59,108,235,8,196,43,219,126,42,204,70,25,19,120,250,34,89,213]},"announce":[],"urlList":[]}}