{"title":"Barclay James Harvest - Glasnost 1988","uid":6746372,"size":441651064,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab0d4f3403194c941073ff15745c4d987795394a&amp;dn=Barclay+James+Harvest+-+Glasnost+1988&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1318706255,"description":"Woolly Wolstenholme - whose mellotron playing was a trademark of the Barclay James Harvest sound in the 70s - left the band 1979 after the album XII. Woolly pursued a short solo career fronting Maestoso, before retiring from the music business to pursue farming.\n\nThe remaining three members continued. At the height of their success, they played a free concert in front of the Reichstag in West Berlin, with an estimated attendance of 250.000 people (30 August 1980). They were also the first Western rock band to play an open-air concert in pre-Glasnost East Germany, playing in Treptower Park, East Berlin on 14 July 1987 to a 170.000+ audience.\n\nThe band continued as a trio with regular guest musicians until 1998. One album, Welcome to the Show, released in 1990, was released under the abbreviated name BJH. However, because of criticism from fans, the full Barclay James Harvest name was restored, albeit with the inclusion of the BJH moniker.\n\nIn 1998, musical differences in the band saw the three members agree to take a sabbatical. John Lees subsequently released an album mixing new songs and BJH classics, entitled Nexus, under the band name Barclay James Harvest through the eyes of John Lees. Woolly Wolstenholme played in (and composed for) this band, subsequently resurrecting Maestoso to record and tour with new material, as well as back-catalogue favourites. Les Holroyd and Mel Pritchard teamed up to record under the name Barclay James Harvest featuring Les Holroyd. Lees and Wolstenholme recently (2006/7) toured under the slightly modified band title John Lees' Barclay James Harvest.\n\nMel Pritchard died suddenly of a heart attack in early 2004. Woolly Wolstenholme took his own life in December 2010 having apparently struggled with depression for many years.\nThe two derivatives of Barclay James Harvest continued to record and tour until 2010, and enjoyed ongoing popularity, particularly in Germany, France, and Switzerland. (wikipedia)\n\n- - -\n\nBarclay James Harvest were invited by the then East German (DDR) authorities to play a concert in East Berlin as part of Berlins 750th birthday celebrations 1987. The original venue was to have been the Island Of Youth, a small island in the middle of a river which flows through the city, but, faced with over 50.000 ticket applications in the first two weeks, the authorities decided to relocate the concert to Treptower Park.\n\nThe ticket price was a nominal 4,05 East Marks (equivalent to about 50p), but on the day the ticket collecting arrangements were so haphazard that thousands of people got in for free, making it almost impossible to give an accurate figure for the attendance - estimates varied from 130.000 to 170.000.\n\nUnlike the first Berlin album, the recording went well, and, despite comments about re-recordings, virtually none was done: the clean sound is down to good mixing and, most importantly, an almost flawless live performance by the band. (bjharvest.co.uk)\n\n- - -\n\nBarclay James Harvest - Glasnost 1988\n(Polydor)\n\n 1. Poor Mans Moody Blues \n 2. Alone In The Night \n 3. Hold On \n 4. African \n 5. On The Wings Of Love \n 6. Love On The Line \n 7. Berlin \n 8. Medicine Man \n 9. Kiev \n10. Hymn \n11. Turn the Key \n12. He Said Love \n\n\nRecording Dates:\nRecorded on July 14th, 1987 at Treptower Park, East Berlin, Derks Mobile.\nMixed at Advision Studios, London\nProducer: Gregg Jackman, Barclay James Harvest and Ian Southerington\nEngineer: Gregg Jackman, assisted by Karen Down\nLive Engineers: Gregg Jackman, Gerd Rautenbach and Peter Brandt\nRemix Engineers: Gregg Jackman and Ian Southerington\n","torrent":{"xt":"urn:btih:ab0d4f3403194c941073ff15745c4d987795394a","amp;dn":"Barclay+James+Harvest+-+Glasnost+1988","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0d4f3403194c941073ff15745c4d987795394a","infoHashBuffer":{"type":"Buffer","data":[171,13,79,52,3,25,76,148,16,115,255,21,116,92,77,152,119,149,57,74]},"announce":[],"urlList":[]}}