{"title":"Need For Speed - The Run by relentlesstech (2011)","uid":9342214,"size":16157400708,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ab210ffb5283693e27649366ed158c0759a38b1b&amp;dn=Need+For+Speed+-+The+Run+by+relentlesstech+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"relentlesstech","files":-1,"time":1386956911,"description":"Need for Speed: The Run was developed by the series primary developer EA Black Box, released on November 15, 2011. The Run was in development since Black Box's 2008 entry in the series, Undercover, which received mixed reviews. The game continues the action focused street-racing gameplay of Black Box's previous titles. The story is based on a race across the United States from San Francisco to New York.\n\nThe game features quick time events with the player, for the first time in Need for Speed history, exiting their car and traveling on foot. The Run is powered by DICE's Frostbite 2 engine, making the game the first non-shooter and one of the first console titles to use the engine. Additionally, NFS Autolog, the Need for Speed franchise's social competition functionality, which was introduced in Hot Pursuit and was previously used in Shift 2: Unleashed, is also back as it continues to track career progression and compare game stats.\n\nThe Run employs a large range of real-world vehicles, seemingly taking in the usual mix of muscle cars, street racers and refined exotics. The cars can be altered with performance upgrades and visual upgrades, such as paint colors and body kits. There are cosmetic body kits known as Style Pack kits and Aero Pack kits, which affect aerodynamics as well as performance. An XP (Experience points) system is used for unlocking cars and events.","torrent":{"xt":"urn:btih:ab210ffb5283693e27649366ed158c0759a38b1b","amp;dn":"Need+For+Speed+-+The+Run+by+relentlesstech+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab210ffb5283693e27649366ed158c0759a38b1b","infoHashBuffer":{"type":"Buffer","data":[171,33,15,251,82,131,105,62,39,100,147,102,237,21,140,7,89,163,139,27]},"announce":[],"urlList":[]}}