{"title":"Euro Sex Parties - Team Players - Tiffany Doll &amp; Ria Rodrige","uid":9319687,"size":534985871,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:adfcb1829c73c5f4ad0255ef5c52a2e468a687a7&amp;dn=Euro+Sex+Parties+-+Team+Players+-+Tiffany+Doll+%26amp%3B+Ria+Rodrige&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1386528424,"description":"Ria, a dark haired, dark skinned Hungarian and Tifany a light skined, French, brunette, are kicking a ball back and forth at the the local park. Both girls are looking exceptionally sexy in the soccer outfits; the typical, short, soccer shorts, thin, soccer jerseys, with no bras underneath, and knee high socks seal the deal to accent the beauty of these two girls. Soon enough they draw the attention of Sabby and Tony. The two guys join in and play along. As things start to get hot and the guys and girls become better acquainted the girls show off their sexy, athletic bodies right in the middle of the park. The decision to take this to a more private local comes quickly. They get back to the apartment and the girls take a shower together and Sabby joins them. They get nice and wet while getting Sabby hard. All three soap each other up and help each other rinse, providing a nice little intermission. The party moves to the bedroom next. Here Tony is waiting, having taken a shower in another bathroom, since neither shower is that large. The girls lay down on their stomachs and let the guys rub lotion on their legs and amazing asses. This quickly turns into ass and pussy licking, as well as cock sucking. But the party doesn't stop here soon the girls are gracefully twisting into various positions and switching partners effortlessly. We are given quite the show by these young, horny, athletic euro beauties. In a blowjob finally Tifany swallows a huge load from Tony while Sabby covers Rias entire face in a cum mask.\n\nstraight, amateur porn, brunette, stockings, outside, shower, group sex, 2girlbj, asslick, blow jobs, deepthroat\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=12410340450815260221.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=12410340450815260221.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=15377024313873578294.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=15377024313873578294.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:adfcb1829c73c5f4ad0255ef5c52a2e468a687a7","amp;dn":"Euro+Sex+Parties+-+Team+Players+-+Tiffany+Doll+%26amp%3B+Ria+Rodrige","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adfcb1829c73c5f4ad0255ef5c52a2e468a687a7","infoHashBuffer":{"type":"Buffer","data":[173,252,177,130,156,115,197,244,173,2,85,239,92,82,162,228,104,166,135,167]},"announce":[],"urlList":[]}}