{"title":"Kesha-Take_It_Off-DVDRip-x264-2010-MVcl","uid":5816840,"size":46666860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ae16d2db3a30d71c0e24ab8d87988471d3f0b424&amp;dn=Kesha-Take_It_Off-DVDRip-x264-2010-MVcl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ruudsach","files":-1,"time":1283881852,"description":"SCREENSHOTS:\n &lt;a href=&quot;\nhttp://bayimg.com/cAOcIaACn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cAOcIaACn&lt;/a&gt;\n\n\nBackground\n\nThe video premiered on Vevo on August 3, 2010.[18] It was directed by Paul Hunter and Dori Oskowitz.[19] Kesha revealed the main idea behind the video in an interview, &quot;[the video is] about me and all my hot vampire babe friends breaking into a hotel on another planet, and at the end we all turn into this beautiful stardust. Once you take it all off, all your inhibitions, your clothes, we're all made up of the same thing.&quot;[20] She explained that she did not want the video to just be about &quot;Taking it off&quot;, that there was an actual message behind the video explaining, &quot;[the] clip isn't just about taking off your clothes and rolling in glitter. It's also about taking off your inhibitions and being raw and real&quot;.\n\n\n\n\nSynopsis\n\nThe video starts off with Kesha seen on a motorcycle. She proceeds to walk as her friends follow behind her as they enter a motel area. As the chorus of the song starts, Kesha and her friends start to run around the motel dancing and jumping off railings. The friends gather around an empty pool and start tearing at each others clothing; While this is happening it is revealed they that are on a different planet and Kesha is seen rolling around in sand. Slowly as some of the friends start taking off their clothing, they begin to turn into star dust. The group starts to dance in the pool with some of the party goers exploding into dust. The remainder of the friends continue to dance in the dust that is now covering the bottom of the pool. As this is happening they all begin to lose different parts of their bodies as they explode into multicolored star dust. The video ends with everyone as dust with Kesha beginning to &quot;unzip&quot; herself as she turns into yellow dust.\n\n\n\n\n\nReception\n\nJocelyn Vena of MTV News met the video with a positive review. She noted that Kesha &quot;manages to embrace her inner party animal and throw a neon-colored party at an abandoned motel in the middle of nowhere.&quot; She stated that &quot;While the concept of &quot;a lot of pretty people dancing at dusk&quot; is pretty simple, the neon colors manage to amp up the video, as does the colored sand that's thrown around in the air and mixed with glitter.&quot; Her conclusion of the video and of Kesha was that as simple as it may be, &quot;she manages to be both sexy and fun while rolling around in the desert.&quot;","torrent":{"xt":"urn:btih:ae16d2db3a30d71c0e24ab8d87988471d3f0b424","amp;dn":"Kesha-Take_It_Off-DVDRip-x264-2010-MVcl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae16d2db3a30d71c0e24ab8d87988471d3f0b424","infoHashBuffer":{"type":"Buffer","data":[174,22,210,219,58,48,215,28,14,36,171,141,135,152,132,113,211,240,180,36]},"announce":[],"urlList":[]}}