{"title":"Snake 2013 HD Full Free Precracked Axiom Studios","uid":8492803,"size":32523486,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ae4c22e6ea3c2f244b16560334a891fcd9cb8be3&amp;dn=Snake+2013+HD+Full+Free+Precracked+Axiom+Studios&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Swishee","files":1,"time":1369048748,"description":"FULL FREE PRECRACKED VERSION of Snake 2013: HD by Axiom Studios\nRelease Date: April 2013\nVersion 1.0.3\n\n\nDESCRIPTION FROM PLAY STORE\n----------------------------\n\nIn this Year of the Snake, we have recreated the magic of the Classic Game of Snake! \n&quot;Snake 2013: HD&quot; is here to help you relive all the fun times you've had, but with a twist!\n\nWith SIX different Game Modes, a multitude of Snakes, amazing Power-Ups, exciting Milestones &amp; a wily arch nemesis Dr. Manaconda, we offer you unlimited hours of fun!\n\n\nDeveloper Note: &quot;Snake 2013: HD&quot; was developed for devices with screens of size 4 inches &amp; above, and may not run efficiently on some older devices. If your device cannot run &quot;Snake 2013: HD&quot; correctly, please do send us feedback, and we'll be glad to try to make it compatible for your device as well!\n\n\n**** &quot;Snake 2013: HD&quot; ONLY Features****\n\nâ–ª Retro Mode - A throwback to the original game, relive the '70s with Retro Mode! Retro Mode is most enjoyable with &quot;Grandpa The Retro Snake&quot;\n\nâ–ª Three exclusive (for a total of EIGHT snakes!) &quot;Snake 2013: HD&quot; snakes with their own environments! Get ready to meet &quot;Droid&quot; The Droid Snake, &quot;Pinky&quot; the Serial Hisser &amp; &quot;Grandpa&quot; The Retro Snake!\n\nâ–ª Dr. Manaconda has made another set of 25 mazes (for a total of FIFTY) for Classic Mode! \n\nâ–ª Stunning Full HD Graphics!\n\n\n**** &quot;Snake 2013: FREE!&quot; Features****\n\nâ–ª Classic Mode - Escape Dr. Manaconda's dastardly vicious mazes! Every turn will challenge your snake handling skills! Navigate through 25 treacherous levels while feeding your snake!\n\nâ–ª Challenge Mode - Put your skill &amp; co-ordination to the test! Complete Dr. Manaconda's convoluted challenges by eating combinations of treats, while avoiding randomly spawning obstacles!\n\nâ–ª Time Attack Mode - Accept Dr. Manaconda's 'All You Can Eat in 60 seconds!' time trial. This fast paced mode will keep you 'hungry' for more! \n\nâ–ª Survival Mode - Survive Dr. Manaconda's &quot;Life-DrainO'Matic 3000 Device&quot; by eating treats! The longer you survive, the faster Dr. Manaconda drains your snake's health! This mode really redefines the term 'Eat to Live!', So keep eating! \n\nâ–ª Nirvana Mode - Dr. Manaconda is tired and on a break! Kick back, relax &amp; unwind with Nirvana Mode. With none of the bad stuff, Nirvana Mode is amazing if you just want to eat some treats after a long day!\n\nâ–ª In Game Store with multiple power ups that make your snake the Ultimate Predator! \n  Four unlockable snakes each with their own environment!\n  Additional Level packs for Classic Mode!\n\nâ–ª 70 unique Milestones to earn while playing! How many can you get?\n\nâ–ª Social Media sharing, so you can compete &amp; enjoy &quot;Snake 2013&quot; with your friends &amp; family!\n\nâ–ª Simple &amp; fun graphics that preserve the magic of this Classic game! \n\nSo what are you waiting for?! Grab your copy of &quot;Snake 2013&quot; today.\n\n\n\n---------------------------------------------------------------------------------\n\nEnjoy, and please seed!","torrent":{"xt":"urn:btih:ae4c22e6ea3c2f244b16560334a891fcd9cb8be3","amp;dn":"Snake+2013+HD+Full+Free+Precracked+Axiom+Studios","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4c22e6ea3c2f244b16560334a891fcd9cb8be3","infoHashBuffer":{"type":"Buffer","data":[174,76,34,230,234,60,47,36,75,22,86,3,52,168,145,252,217,203,139,227]},"announce":[],"urlList":[]}}