{"title":"The Myth of the Good Jew","uid":4460036,"size":15279064,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae7b43607751b1fadc7db51fd8341b5576a4a2d7&amp;dn=The+Myth+of+the+Good+Jew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CuriousGeorge","files":1,"time":1224652924,"description":"Black activist challenges Jews to expose criminal Jews\n\n&quot;The Jews take advantage of their false naturalization as citizens in order to work without hindrance for the future of Judaism to the detriment of the countries which accord them hospitality . They benefit them from the advantages of this situation without fulfilling its duties.\n\nOn the other hand, if the Jewish world hegemony signified the moral elevation of humanity it would have no adversaries; but it implies the moral, and in part material destruction of the nations for the benefit of the Jew alone. Thus anti-Judaism is a work of defence and social conservation, not an act of aggression, as the Jews would wish to make us believe:\n\nIn summing up we may therefore say this:\n\nJewish domination is both the result of natural causes and conspiracy. On the one hand, the origin and the putting in practice of these principles are due to the Judaeo-Masonic conspiracy of which we have seen the efforts to establish  in the world the principles of 1789: in the spiritual domain by atheistic materialism; in the political domain, by democracy, republicanism, and liberalism; in the social domain by collectivism.\n\nIt would then be a service to the Jews themselves to check their revolutionary activity, for on the one hand, their famous socialism is not likely to last, and on the other hand, if we are the first to succumb to it, their own turn will come immediately after, since, in short, their abilities are essentially those of parasites.&quot;\n\nVicomte Leon de Poncins - Freemasonry and Judaism: the Secret Powers Behind Revolution. page 235","torrent":{"xt":"urn:btih:ae7b43607751b1fadc7db51fd8341b5576a4a2d7","amp;dn":"The+Myth+of+the+Good+Jew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7b43607751b1fadc7db51fd8341b5576a4a2d7","infoHashBuffer":{"type":"Buffer","data":[174,123,67,96,119,81,177,250,220,125,181,31,216,52,27,85,118,164,162,215]},"announce":[],"urlList":[]}}