{"title":"[Coursera] A History of the World since 1300","uid":9330694,"size":6955911971,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:aecaaf7be8741e9657302ae612c0a5470a84eaa8&amp;dn=%5BCoursera%5D+A+History+of+the+World+since+1300&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KeepKnowledgeFree","files":294,"time":1386723767,"description":"== Course Details ==\n\n* Instructor: Jeremy Adelman from Princeton University\n* Workload: 24 lectures, approximately 50 minutes each \n* Taught In: English\n* Subtitles Available In: English\n\n\n== About the Course ==\n\nThis course explores the history of the modern world since Chinggis Khan. It focuses on the connections between societies from the time of the Mongol conquests and the gradual, but accelerating ways in which connections became ties of inter-dependence. The relations between societies are what will concern us. The forces pulling the world together vary from religious to economic, political to intellectual. These forces bring the world together, but they also create new divisions. Nowadays, we call this &quot;globalization.&quot; That term has tended to emphasize the drive to worldwide integration; the view of globalization taken in this course emphasizes disintegration as well as integration. We will tackle some very basic questions: How do we explain the staggering wealth of China in the centuries up to 1750, as well as China's recent ascent? Where did the United States come from, and where is it headed? What are the significance and legacies of empire in the world? How have world wars and revolutions shaped the international system over time? What exactly is globalization, and how does today's globalization compare with the past? How has the relationship between humans and nature changed over the centuries?\n\n\n== Recommended Background ==\n\nAnyone and everyone is welcome to take this class.\n\n\n== Suggested Readings ==\n\nAlthough the lectures are designed to be self-contained, we recommend (but do not require) that students refer to the book Worlds Together, Worlds Apart: A History of the World: From 1000 CE to the Present (Third Edition) (Vol. 2), which was written specifically for this course. /included in torrent/","torrent":{"xt":"urn:btih:aecaaf7be8741e9657302ae612c0a5470a84eaa8","amp;dn":"%5BCoursera%5D+A+History+of+the+World+since+1300","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aecaaf7be8741e9657302ae612c0a5470a84eaa8","infoHashBuffer":{"type":"Buffer","data":[174,202,175,123,232,116,30,150,87,48,42,230,18,192,165,71,10,132,234,168]},"announce":[],"urlList":[]}}