{"title":"Chopper Mike v1.01","uid":8506629,"size":22411078,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:afde0025cff72b962e402ec26d7f27c0ec2634c0&amp;dn=Chopper+Mike+v1.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":-1,"time":1369444762,"description":"\nChopper Mike is a charming, fast-paced, arcade helicopter time trial game featuring super smooth graphics and amazing controls.\n\nFly through 3 difficulty modes and 48 levels, picking up gems, avoiding collisions, and landing as quickly as you can! Skillful play will be rewarded with mysterious bonus aircraft!\n\nComplete the levels, beat the target times, then replay to beat your best times!\n\n- - - - - - -\n\nChopper Mike supports phones and tablets!\n\n- - - - - - -\n\nPlaying tips.\n\n* Start off in the Rookie 1000, but as soon as you get to grips with the controls, switch up to the Red Squirrel for greater speed and agility!\n\n* Each difficulty has different levels. Once you master the Easy difficulty, move on to Normal.\n\n* Fast Stars are hard to earn in Normal and very hard in Expert. Try getting the Perfect Stars first, you can go as slowly as you want - just don't hit anything. With all the Perfect Stars from Easy and Normal you'll unlock a faster chopper that will help you beat them, (although they are all beatable in the Red Squirrel).\n\n* Try to find the 'racing line' in a level. Turn before you get to the gems so you're already aiming for the next one as you collect the first.\n\n* Try using the Rookie 1000 to earn Perfect Stars in later levels. You won't beat the Target Times, but Perfect Stars are about clearing the level without bumping into things!\n\n- - - - - - -\n\nNote 1: Chopper Mike is designed to run at 60 frames per second, and features complicated graphics shaders. As such it requires a moderately powerful device to run at its best. Chopper Mike runs well on a Samsung Galaxy S2, Google-Asus Nexus 7, and ASUS Transformer Pad TF300T.\n\nNote 2: For best presentation, Chopper Mike requires a minimum screen height of around 448 pixels, (when in landscape orientation).\n\nWhat's in this version:\n\n* Tablet support.\n* Fixes for Nexus 10 graphical issues. Now draws perfectly!\n* Support for Back button in the user interface, and to shut the game down from the title screen.\n* Added auto-pause when game is suspended.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.VAMflax.ChopperMike&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.VAMflax.ChopperMike&lt;/a&gt;\n","torrent":{"xt":"urn:btih:afde0025cff72b962e402ec26d7f27c0ec2634c0","amp;dn":"Chopper+Mike+v1.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afde0025cff72b962e402ec26d7f27c0ec2634c0","infoHashBuffer":{"type":"Buffer","data":[175,222,0,37,207,247,43,150,46,64,46,194,109,127,39,192,236,38,52,192]},"announce":[],"urlList":[]}}