{"title":"Cauldron of Abaddon - Texe Marrs Divx","uid":4304903,"size":608892662,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aff5bc0b9cc66b78195276e17bb3c0bc5489aa06&amp;dn=Cauldron+of+Abaddon+-+Texe+Marrs+Divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CuriousGeorge","files":-1,"time":1216492842,"description":"What is the most wicked city on earth? From this evil place spews witchcraft and sorcery. Its merchants produce the world\\'s most destructive child pornography. This city\\'s hidden rulers are the drug kingpins of the planet. Their mafia control the world\\'s most frenzied gambling establishments. Cruel violence, sexual sin and perversion, murder and gangsterism rock this city and reverberate around the world. This city\\'s inhabitants have spread their tentacles across the globe. Their grotesque debauchery and unparalleled crimes are holographed in New York City, Moscow, London, Bangkok, and dozens of other locales.\n\nJerusalem Identified as \\&quot;Sodom and Egypt\\&quot;\n\nThe prophetic Scriptures identify this city with Mystery Babylon, and spiritually call it \\&quot;Sodom and Egypt\\&quot; (Revelation 11:8). The Bible says this is the great city \\&quot;wherein our Lord was crucified.\\&quot;\n\nThis city, is in fact, the very \\&quot;Cauldron of Abaddon,\\&quot; a fiery boiling pot of sorcery and vice stirred by Satan and his minions.\n\nHave you got it yet? Do you know the name of this terrible placeÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½the most wicked city in the world in the end-times?\n\nThe city I am describing is, of course, Jerusalem, the capital of Israel, a place so evil and corrupt that The Jerusalem Report (November 13, 1997), a strongly pro-Israel publication, labeled the city \\&quot;Lawless.\\&quot;\n\nJews\\' First Allegiance is to Israel\n\nJerusalem is not only the capitol of the nation-state of Israel. The very name of this city is a codeword, which stands for the pervasive influence of latter day Jewish culture and religion throughout the world.\n\nIndeed, there are more Jews living today in New York City than reside in Jerusalem proper. And in the state of Florida, a haven for rich Jews, there are found more Jews than in all of Israel.\n\nIn almost every major city of the planet, there is found a community of rich and influential Jews who control local media, commerce, and banking, and whose first allegiance is not to the country in which they reside, but to Israel and to Jerusalem.\n\nIn the U.S.A., for example, our banking system is run by a Jew, Fed Reserve Chairman Alan Greenspan. Our nation\\'s two most prominent newspapers, The Washington Post and The New York Times, are owned by Jews and operated on behalf of Jerusalem and global Jewish culture. Our TV networks also are owned and run by Jews, and their propaganda consistently represents the sole viewpoint of Jerusalem and Israel. These TV networks incessantly spew out pro-Israel sentiment and promote Jewish culture to unwitting Americans.\n\nIn America, Jews founded and still run liberal, Christ-hating, agitation groups like the ACLU, ADL, AIPAC, PAW, Southern Poverty Law Center, and the American Jewish Congress.\n\nOh, did I mention Hollywood? You know, that village culturally akin to Sodom and Gomorrah out in California, which endlessly churns out filth and corruption. Yes, it, too, is owned by Jews and is operated as a propaganda front for Zionist forces in Jerusalem.\n\nNo wonder the Apostle Paul said that Jerusalem (the earthly, not the heavenly, city of Jerusalem) and its people are in bondage to Satan (Galatians 4:25).\n\nGrotesque Discoveries\n\nMy video, Cauldron of Abaddon, fully documents the astonishingly grotesque stature of the latter day \\&quot;great city\\&quot; of Jerusalem and the corrupt and violent nation of Israel. Among the discoveries chronicled in this revealing video:\n\n   1. Israel tops the world in school violence. (Reference: Israel National Council for the Child, The Jerusalem Report, January 28, 2002)\n   2. After a Jewish madman, Baruch Goldstein, stormed a peaceful Islamic mosque and massacred 29 Palestinians worshipping there, Jewish rabbis praised his crime and called Goldstein \\&quot;blessed.\\&quot; (The Jerusalem Report, January 28, 2002)\n   3. Israel and many Jews are racists and are hateful of people of other races, which they consider little more than \\&quot;goyim\\&quot; (cattle). Israel Shamir, an Israeli citizen who fought in the Yom Kippur War of 1973 against the Arabs, sadly admits that Israel is infected with the \\&quot;evil idea of Jewish supremacy.\\&quot; Shamir, a decent man fed up with so many bigots in his own country, calls Israel, \\&quot;a Ku Klux Klan state run by madmen.\\&quot; (Speech, Emory University, 2001. Also, essay, Kid Sister, by Shamir).\n   4. Most Jews in Israel despise Jesus Christ and have utter contempt for Christians. Rami Rozen, in Israel\\'s top daily newspaper, Ha\\'aretz, recently wrote: \\&quot;Jews feel toward Jesus...hatred and spite. For centuries, Jews concealed from Christians their hatred of Jesus, and this tradition continues.\\&quot;\n   5. A headline in Battle Cry, a Christian publication, read: \\&quot;Christians in Israel Face Firebombs and Prison for Soulwinning.\\&quot; After being threatened by Israeli authorities, most Christian groups in Israel have promised not to proselytize or convert Jews to the Christian faith.\n   6. Many Jews in Israel and America especially hate Palestinians, and most have little or no pity for the plight of the poverty-stricken people whom they, in their luxury and riches, have uprooted. \\&quot;One million Arabs are not worth a Jewish fingernail,\\&quot; Rabbi Yaacov Perrin was quoted as saying in The New York Times (February 28, 1994, page 1). In The Jerusalem Post (February 2, 2001), it was reported that Israeli settler Nahum Korman was convicted of killing an 11-year old Palestinian boy. His punishment: six months of community service.\n   7. In 1998 an Israeli retired General exposed that Israel had, in its 1973 war with Egypt, herded thousands of surrendered Egyptian POWs into the desert with their hands tied behind their back, slaughtered them with machine guns, then bulldozed them all into a huge bloody pit. Confronted with the evidence, then Prime Minister Rabin dismissed it all as \\&quot;past history.\\&quot; (Yeah, well, that\\'s not what the Jews say about Nazi atrocities that occurred a quarter of a century before these Israeli atrocities.)\n   8.  Pedophilia among Jewish rabbis and Jewish homosexuals is rampant. For example, one of Jerusalem\\'s best known clergymen, Rabbi Ze\\'eu Kopelovich, pled guilty to sexually molesting 19 male students (The Jerusalem Report, November 18, 1999).\n   9.  So racially prejudiced are the Jews that, until they were caught, most of Israel\\'s blood banks systematically dumped blood donated by people outside their own race. In 1996 it came to light that the blood of black Ethiopians living in Israel was trashed (The Jerusalem Report, February 22, 1996)\n  10.    10.  Many cemeteries in Israel refuse the burial of dead bodies of those who aren\\'t of the correct Jewish race and background.\n\nJewish Vices: From Gambling to Child Slavery\n\nAs I also reveal in Cauldron of Abaddon, the Jewish mafia are the world\\'s most wicked and powerful (remember Jewish thugs Meyer Lansky and Bugsy Siegel?). The international ecstasy drug trade and the global pornography industry are run by Jews at the top, as acknowledged by the FBI, DEA, and almost every other authority.\n\nGambling has been called \\&quot;The Jewish Vice\\&quot; by The Jerusalem Report, and the Las Vegas\\' gambling casino industry was founded by Jewish gangsters. Jewish kingpins also run major child slavery rings, and Israeli police complain that Jewish pimps are about to overrun the Israeli cities of Tel Aviv and Jerusalem.\n\nThe Israeli Mossad spy agency is brutal and ruthless and is responsible for so many assassinations and murders the Russian KGB and Yassir Arafat\\'s PLO must be blushing with envy.\n\nIn Israel, a bank robbery occurs almost daily (The Jerusalem Post, November 13, 1997) and newspaper headlines trumpet a long string of murders.\n\nWicked Jerusalem Exalted by America\\'s Leaders\n\nSeeing how wholly evil is the earthly city of Jerusalem today, we must ask ourselves why the majority of the Christian leadership continues to call Jerusalem the \\&quot;Holy City.\\&quot; Why is decadent, modern-day Israel exalted and made into an icon of righteousness by Jerry Falwell, James Dobson, Pat Robertson, and others?\n\nWhy, indeed, do these famous-name Christian clergy, and especially our politicians, kiss up to and bow down to the Jewish rich and powerful? Do they fear the Jews?...or do they do so for financial advantage?\n\nDo they not study God\\'s Word? Do they not believe the Lord\\'s endtime prophecy and warning about the evil, treachery, and cruelty of those who comprise the \\&quot;Synagogue of Satan?\\&quot; (Revelation 2:9 and 3:9)\n\nHave they not read in Revelation 18 of the judgement and pitiful destiny of that great city, Mystery Babylon, with which the kings of the earth have committed fornication? Sadly, the scriptures testify that this city, as just due for her whoredom and vice over the ages, is burned and destroyed, and \\&quot;in one hour is she made desolate\\&quot; (Verse 19).\n\n\\&quot;Come Out of Her\\&quot;\n\nThe Bible\\'s admonition is that God\\'s people \\&quot;come out of her.\\&quot; Jerusalem is spiritually \\&quot;Sodom and Egypt.\\&quot; Yet, the Falwells, the Dobsons, the Robertsons, the Clintons and the Bushes wallow in the vomit with Jerusalem, disregard her sin and treachery, and exalt her to the stars. She is their idol.\n\nIn so doing, they stand in danger of joining her in her final throes of agony and despair. May God have mercy upon them, and may God quickly bring out of the wicked beast system that small remnant of Jews whom He, by His grace, has faithfully promised to save. AMEN","torrent":{"xt":"urn:btih:aff5bc0b9cc66b78195276e17bb3c0bc5489aa06","amp;dn":"Cauldron+of+Abaddon+-+Texe+Marrs+Divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff5bc0b9cc66b78195276e17bb3c0bc5489aa06","infoHashBuffer":{"type":"Buffer","data":[175,245,188,11,156,198,107,120,25,82,118,225,123,179,192,188,84,137,170,6]},"announce":[],"urlList":[]}}