{"title":"JustLooking 1.0.1 (Replacement for Preview.app)","uid":3561223,"size":1088326,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b017c9e4615ad70dbbbb64f258c420eff47db92d&amp;dn=JustLooking+1.0.1+%28Replacement+for+Preview.app%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chipmunkninja","files":1,"time":1164043777,"description":"JustLooking is an image viewer for Mac OS X designed to replace the Preview application.  It has the following features, along with others:\n\n\n- It focuses on files and directories instead of lists of files. Thus, once you load a file, you can easily navigate through all other files in the same directory.\n- It displays images at their native resolution instead of interpreting DPI information stored in the image meta-data. While images are printed at the maximum resolution possible, on screen they are displayed pixel-by-pixel.\n- Being designed more for viewing of Images, it properly shows animated GIF files.\n- The entire program can easily be manipulated and powered by simple keystrokes for a quick and pleasant viewing experience.\n- JustLooking also supports such basic features as printing and rotating and will hopefully prove to be sufficiently functional for most users\\\\\\&amp;#039; needs.\n\n\nRunning JustLooking is quite simple, and the only requirements are:\n\n- Mac OS X 10.4 or greater\n- 256MB RAM\n- 2MB free disk space\n\nJustLooking is installed on any new machine by simply dragging it into the Applications folder.\n\nmore information at http://chipmunkninja.com.\n\nWe need help with localisation.  If you speak a language other than english fluently, and have 2 hours or so to spare, please let me know -- the more languages the better!!!\n\nThis is version 1.0.1, which contains a couple of bug fixes related to deleting files and operations on files that no longer exist.\n\t\t","torrent":{"xt":"urn:btih:b017c9e4615ad70dbbbb64f258c420eff47db92d","amp;dn":"JustLooking+1.0.1+%28Replacement+for+Preview.app%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b017c9e4615ad70dbbbb64f258c420eff47db92d","infoHashBuffer":{"type":"Buffer","data":[176,23,201,228,97,90,215,13,187,187,100,242,88,196,32,239,244,125,185,45]},"announce":[],"urlList":[]}}