{"title":"Vivitar 840XHD Demo Video [Can You Edit This?]","uid":5393160,"size":24592620,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b0e8bfc91c626a687cb63a7b0059f2b701c61c98&amp;dn=Vivitar+840XHD+Demo+Video+%5BCan+You+Edit+This%3F%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Xeptical","files":1,"time":1267131396,"description":"So I went out and bought a new camcorder. The Vivitar 840XHD. Says it's full 1080p HD. The picture quality is pretty good. My problem is that I can't find a video editor out there that will even touch the files that come out of the camera. They have an AVI extension. But I've tried Adobe Premier Pro, Sony Vegas, CyberLink PowerDirector... nothing works.\n\nIn some cases the video will play, but there is no audio. In the case of Sony Vegas, it won't open the files at all. When I try to drag the files into the time line, there's a red circle with a slash through it, indicated an invalid media file. Even the ridiculous software that came with the camera doesn't work.\n\nEven playing the files in VLC player is sketchy. It's almost like it takes the computer a few seconds to catch up and sync the audio and video together. I have no idea what's wrong.\n\nSo, I've uploaded this sample video here. I'm hoping that maybe someone here can download this video and let me know if you can open it and successfully edit it in any video editing software. I'm hoping that it's just something I'm doing wrong... an incorrectly configured codec or something.\n\nI'm using Windows 7 Home Premium (64-bit).\n\nIf you find anything out about this, leave the info in the comments! I would greatly appreciate it!","torrent":{"xt":"urn:btih:b0e8bfc91c626a687cb63a7b0059f2b701c61c98","amp;dn":"Vivitar+840XHD+Demo+Video+%5BCan+You+Edit+This%3F%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0e8bfc91c626a687cb63a7b0059f2b701c61c98","infoHashBuffer":{"type":"Buffer","data":[176,232,191,201,28,98,106,104,124,182,58,123,0,89,242,183,1,198,28,152]},"announce":[],"urlList":[]}}