{"title":"NapoleÃƒÂ£o no Egito","uid":4579846,"size":569605176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b27bb1262a4043dc84f042f39bf461d61b97cc4b&amp;dn=Napole%C3%83%C2%A3o+no+Egito&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sisifo22","files":1,"time":1229378976,"description":"O grande NapoleÃƒÂ£o Bonaparte comeÃƒÂ§ou a nascer no Egito. Ao retonar ÃƒÂ  FranÃƒÂ§a, depois de dois anos de batalha; e &quot;isolado&quot; no Oriente MÃƒÂ©dio, tendo conquistado o Cairo, NapoleÃƒÂ£o volta a Paris para o 18 BrumÃƒÂ¡rio, o golpe de Estado que o transforma em primeiro consul e, depois, em Imperador da FranÃƒÂ§a.\nEsse documentÃƒÂ¡rio do Discovery Civilization Channel, conta a histÃƒÂ³ria da invasÃƒÂ£o do Egito pelas tropas francesas comandadas pelo, entÃƒÂ£o, general NapoleÃƒÂ£o Bonaparte. Mais do que uma campanha militar, NapoleÃƒÂ£o pretendia que fosse uma expediÃƒÂ§ÃƒÂ£o cultural, para decifrar o Egito. Ele seguia os passos de seu ÃƒÂ­dolo, Alexandre, o Grande, que no passado buscara glÃƒÂ³ria e conquistas no oriente. Mas para dar o golpe do 18 BrumÃƒÂ¡rio, NapoleÃƒÂ£o precisou transformar em vitÃƒÂ³ria, as incontÃƒÂ¡veis derrotas que sua expediÃƒÂ§ÃƒÂ£o sofreu no Oriente. A comeÃƒÂ§ar pela batalha naval da baia de Aboukir, em que a marinha francesa ficou ancorada depois do desenbarque das tropas de NapoleÃƒÂ£o, e acabou sendo totalmente aniquilada pela esquadra inglesa comandada pelo almirante Nelson.\nCom a perda de sua Marinha, os franceses comandados por Bonaparte ficaram presos e isolados em terras egÃƒÂ­picias. Depois de tomar o Cairo dos Mamelucos, NapoleÃƒÂ£o  sente o gosto de governar - tanto para o bem quanto para o mal, levado que foi a promover a chacina de 3000 soldados turcos capturados em uma das batalhas travadas no oriente mÃƒÂ©dio. NapoleÃƒÂ£o imaginara retonar ÃƒÂ  FranÃƒÂ§a por terra, passando pela Terra Santa. Mas, derrotado pelos turcos, foi obrigado a retonar ao Egito. Cansadas, suas tropas foram atingidas por doenÃƒÂ§as e epidemias e ao retonar ao Cairo, NapoleÃƒÂ£o decide voltar ÃƒÂ  FranÃƒÂ§a e deixar seu segundo homem no comando de suas tropas no Egito. Escreve uma carta a ele dizendo que foi chamdo com urgÃƒÂªncia a Paris. Poucos dias depois, ele estaria liderando o golpe de 18 BrumÃƒÂ¡rio e assumindo como primeiro consul o governo da FranÃƒÂ§a. Mas a maior parte dos homens que o acompanharam atÃƒÂ© o Egito morreram ou foram capturados pelos ingleses, inclusive os cientistas de sua expediÃƒÂ§ÃƒÂ£o e todos os tesouros encontrados e catalogados. Tanto ÃƒÂ© que a famosa pedra Rosetta, descoberta pela missÃƒÂ£o francesa, foi usada para decifrar os hirÃƒÂ³glifos, em Londres, em 1821. \n","torrent":{"xt":"urn:btih:b27bb1262a4043dc84f042f39bf461d61b97cc4b","amp;dn":"Napole%C3%83%C2%A3o+no+Egito","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b27bb1262a4043dc84f042f39bf461d61b97cc4b","infoHashBuffer":{"type":"Buffer","data":[178,123,177,38,42,64,67,220,132,240,66,243,155,244,97,214,27,151,204,75]},"announce":[],"urlList":[]}}