{"title":"Ben Katchor: Comics that tell the little stories of a big city","uid":4878595,"size":44042645,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b293f5f1270cfc3aeff5cc3a48b8d11563928712&amp;dn=Ben+Katchor%3A+Comics+that+tell+the+little+stories+of+a+big+city&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263481,"description":"Ben Katchor: Comics that tell the little stories of a big city\n\nIn this captivating talk from the TED archive, cartoonist Ben Katchor reads from his comic strips. These perceptive, surreal stories find the profound hopes and foibles of history (and modern New York) preserved in objects like light switches and signs.\n\nIn the antique buildings of New York City now overgrown with tawdry fixtures and the modernized hopes of its denizens, Ben Katchor listens for the stories that fill his wry, perceptive (and slightly surreal) comic strips of urban life. Downtrodden characters and objects get equal time in a slant spotlight, and while their interplay is often pathetic, it points to profound truths about history, memory and human hopes.\n\nKatchor is author of several comics collections, including Cheap Novelties: The Pleasures of Urban Decay, The Jew of New York, and Julius Knipl: Real Estate Photographer. He's been a Guggenheim Fellow and has also written for the stage works such as The Slug Bearers of Kayrol Island. In May, he premieres A Check-room Romance, a musical tragicomedy co-written with Mark Mulcahy\n\n    &quot;Ben Katchor ... is the most poetic, deeply layered artist ever to draw a comic strip.&quot;\n\nNew York Times Book Review","torrent":{"xt":"urn:btih:b293f5f1270cfc3aeff5cc3a48b8d11563928712","amp;dn":"Ben+Katchor%3A+Comics+that+tell+the+little+stories+of+a+big+city","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b293f5f1270cfc3aeff5cc3a48b8d11563928712","infoHashBuffer":{"type":"Buffer","data":[178,147,245,241,39,12,252,58,239,245,204,58,72,184,209,21,99,146,135,18]},"announce":[],"urlList":[]}}