{"title":"World Championship Darts 2008 [DVD - NTSC] [Multi 6], Ps2","uid":5311493,"size":113265401,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b319897e536eca4fef39a0589e6a6ba3a38ea9f1&amp;dn=World+Championship+Darts+2008+%5BDVD+-+NTSC%5D+%5BMulti+6%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big_dude","files":-1,"time":1264578542,"description":"PDC - World Championship Darts 2008 for the Ps2                     Rel. 01/25/2008\n\n\nFormat:        DVD5 Patched to NTSC.\nLang.:         English, French, Italian, Deutch, Spanish, Netherland.\nDiscs:         1\nImage:         ISO\nGenre.:        Sports, Darts\nConversion:    Rebuilt from CD to DVD.\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nRelease Notes - This is World Championship Darts originally a ps2 cd game and in \n                pal. I couldn't find the NTSC USA release, only the pal version. \n                It has been Rebuilt to DVD and Patched to Ntsc. The screen offset \n                isn't perfect and you can't make out the very bottom. This \n                couldn't be helped and is the best it could be. The game is still \n                very much playable and shouldn't bother you a whole lot as its not \n                that bad, and you can't tell that much of a difference really.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nPURE EXCITEMENT. PURE PRESSURE. PURE DARTS..GAME ON! \n\nPDC World Championship Darts 2008 is an officially licensed darts game and sequel to it's earlier incarnation. The player can opt to play as existing champions or create his own player. This new version includes even more stars to choose from.\nIt also includes more licensed events to participate in. Each is modeled after the actual real life events. The game includes three existing darts arenas.\n\nIn addition, the Order of Merit and World Rankings of the professional players in the game has been updated since PDC World Championship Darts 2008 to ensure the most up-to-date statistics possible in the Career Mode.\n\n\nFeatures:\n\n* 4 Game Modes - Exhibition, Tournament, Career and Party Game.\n\n* Three levels of difficulty/throwing mechanisms - Amateur, Professional and \n  Master.\n \n* Featuring 16 PDC Champions : Phil Taylor, Raymond van Barneveld, Peter Manley, \n  Wayne Mardle, Dennis Priestley, Adrian   Lewis, Alan Warriner-Little, John Part, \n  Colin Lloyd, Mark Dudbridge, Roland Scholten, Ronnie Baxter, Terry Jenkins, \n  Kevin Painter, Andy Hamilton, Andy Jenkins.\n\n* Commentary from the TV's voice of darts Sid Waddell and top level match referee \n  Bruce Spendley.\n\n* Computer opponents play off the real life averages and playing styles of the  \n  Pros.\n \n* 47 Achievements from 163 bogey checkout to 9 dart finish. \n\n* 7 real world tournament sets that are common to the PDC Championships.\n\n* Games stats displayed in-game, at the end of a match and stored as high scores\n  and trivia.\n\n* In depth career mode based around the 7 major tournaments in the PDC calendar. \n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:b319897e536eca4fef39a0589e6a6ba3a38ea9f1","amp;dn":"World+Championship+Darts+2008+%5BDVD+-+NTSC%5D+%5BMulti+6%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b319897e536eca4fef39a0589e6a6ba3a38ea9f1","infoHashBuffer":{"type":"Buffer","data":[179,25,137,126,83,110,202,79,239,57,160,88,158,106,107,163,163,142,169,241]},"announce":[],"urlList":[]}}