{"title":"LimeWire Pro v4.18.8 by /-ZM-/","uid":4629768,"size":7336328,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b72dcc52fdd0c21a7f098dfd02005e2122e64d3d&amp;dn=LimeWire+Pro+v4.18.8+by+%2F-ZM-%2F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZabuzaMox","files":1,"time":1231348483,"description":"LimeWire 4.18.8\nFast and reliable P2P file-sharing client\n\nWhat is LimeWire? \nLimeWire is a fast, easy-to-use file sharing program that contains no spyware, adware or other bundled software. Compatible with all major platforms and running over the Gnutella network, LimeWire's open source code, is freely available to the public and developed in part by a devoted programmer community. LimeWire is offered in dozens of languages and is available in LimeWire BASIC, a free version, or LimeWire PRO, an enhanced version with personalized technical support offered at $21.95. \n\nWhy Should I Use LimeWire? \nLimeWire is the fastest, easiest, most advanced file sharing program available and it's completely free of spyware, adware and any other bundled software. Find out more about LimeWire's features. \n\nFor the ultimate Lime experience, LimeWire PRO features access to optimized search results, faster downloads, free updates and personalized technical support for up to six months. Get your copy of LimeWire PRO today. \n\nWhat's new at Lime Wire? \nLime Wire is introducing a filtering system to encourage safer, more responsible file sharing. Copyright owners interested in blocking their files from being downloaded, uploaded and shared are invited to learn more and register here. LimeWire users can learn more about responsible file sharing in Copyright Information. \n\nAbout LimeWire LLC \nLime Wire LLC is a New York City-based company founded in 2000. We develop innovative, sophisticated applications of file sharing technology. Industry expert Mark Gorton (Chairman) leads an international team of professionals from the world's most prestigious academic and professional institutions. Find out more about Lime Wire LLC. \n\nLimeWire is an excellent P2P file-sharing client software letting users download and share various types of computer files, including pictures, movies, games, and text documents. LimeWire has nice multiple search tabbed interface. It allows user to search for multiple files at the same time. Some other features include these: Firewall to Firewall Transfers, proxy support, more faster connection to network , preview of files, &quot;Thread&quot; downloads from multiple hosts, integration of chat, support for International searches and International groups, iTunes integration\nSearches in LimeWire now immediately display the artists, albums and other information that fully describes files. Users can now browse the network and search for the most recent and actual content additions.\nLimeWire is clear so it contains no bundled software of any kind. No spyware. No adware. Guaranteed.\nChanged in 4.18.6 (08.21.08)\n* Fix exceptions in PushProxies Publisher, Mojito StatusCode, AbstractPoolEntry, UDPPInger validate hosts, splitting Mojito buckets and removing files in MySharedFilesResultPanel for a GnutellaSearchResult.\n\n(review:)\n\nUsage\nWhen it comes to downloading programs such as games, images, documents, videos, MP3 and other audio files you need to look no farther than LimeWire. The creators of this software have given us a unique way to get what we want or need in one P2P or Peer-to-Peer program. It uses a Java Platform to run, and Gnutella a file sharing network to scan your computer for downloadable files. You can find files shared through LimeWire in the Digital Audio Access Protocol, which is designed to keep track of media shared across the Network.\n\nCons\nThere are a few cons to LimeWire, such as if you want even faster downloads you need to purchase LimeWire Pro. You will also get a few warnings about there being a virus or Trojan, however you this warning is displayed on your screen before your download will begin. However, the free version will tell you before you begin the download. You may also see someone downloading files from your pc. When it comes to this do not worry though, it is very common with P2P programs. You can see what they are downloading and stop it if you want to.\n\nPros\nThe pros to LimeWire are as vast as its resources. You can download and try out programs that would normally cost you a lot of money. You can also download an entire CD, and burn it to disk. Some of the other Peer-to-Peer programs do not have this feature even though they advertise it. During the startup of the program, it has a Tips and Tricks screen that popup. These help you use LimeWire even more efficiently. A huge pro is the download time and availability of finding and installing LimeWire itself. You do not have to be a computer expert just an internet surfer.\nIt is designed to run on Microsoft Windows, Mac OS X, and RPM or Red Hat Package Manager.\n\n\nNO BUNDLED SOFTWARE OF ANY KIND!\nNo spyware. No adware. Guaranteed. \nFirewall to Firewall Transfers.\nSince about 60% of users are currently firewalled, this feature greatly increases the amount of content on the network. \nFaster network connections.\nUsing new &quot;UDP Host Caches&quot;, LimeWire starts up and connects faster than ever before! \nUniversal Plug 'N Play.\nUPnP support allows LimeWire to find more search results and have faster downloads. \niTunes Integration.\nWindows and Mac users can now take advantage of LimeWire's iTunes integration. \nCreative Commons Integration.\nLimeWire now recognizes OGGs and MP3s licensed under a Creative Commons License. \n&quot;What's New?&quot; feature.\nUsers can browse the network for the most recent content additions. \nSearch drill down results.\nSearches in LimeWire now immediately display information that fully describes files. \nProxy support.\nUsers can now use web proxies to route their downloads to protect their identity. \nSupport for International searches and International groups.\nUsers can now search in any language, and LimeWire ensures that a user will be connected to other users with their own language to aide international users to receive search results in their native language and to find content from sources that are close to home. \n\n","torrent":{"xt":"urn:btih:b72dcc52fdd0c21a7f098dfd02005e2122e64d3d","amp;dn":"LimeWire+Pro+v4.18.8+by+%2F-ZM-%2F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b72dcc52fdd0c21a7f098dfd02005e2122e64d3d","infoHashBuffer":{"type":"Buffer","data":[183,45,204,82,253,208,194,26,127,9,141,253,2,0,94,33,34,230,77,61]},"announce":[],"urlList":[]}}