{"title":"Driver Genius Pro Edition v12.0.0.1306 - Final","uid":9097735,"size":15812611,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ba187037a6565c3fe96f5d9f653e725b8006bb6b&amp;dn=Driver+Genius+Pro+Edition+v12.0.0.1306+-+Final+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TehForkinator","files":-1,"time":1382724057,"description":"Driver Genius Professional is a driver management tool that will find and update outdated drivers on your PC. Driver Genius Professional can also back-up and restore your drivers - particularly helpful in case of a system crash or when upgrading to a new operating system.\n\n\n\nWith just a few clicks of your mouse Driver Genius will analyze the drivers on your PC and recommend updates from a database containing over 60,000 drivers.  The database contains drivers for the vast majority of hardware devices such as motherboards, video cards, sound cards, network cards, modems, monitors, mice, keyboards, digital cameras, video capture cards etc.\n\n\n\n\nFeatures:\n\nWizard based interface makes updating your drivers as easy as 1-2-3.\n\nScan - Automatically detects which drivers need updating.\n\nDownload - Choose which drivers you want to download; or download them all at once.\n\nInstall - Driver Install Wizard makes installation easy.\n\n\n\n\n80,000+ Drivers Supported.\n\nDigital Cameras, MP3 Players, Motherboards, VOIP Phones, Video Cameras, Modem Cards, Printers, CD/DVD Drives, Video &amp; Sound cards, Network Cards, Keyboard &amp; Mouse, Hard Drives And More! \n\n\n\n\nBackup, Restore and Remove\n\nBackup - Create a backup of all installed devices drivers on your PC\n\nRestore Drivers - Automatically reinstall all your backup drivers - great when upgrading or reinstalling your operating system.\n\nUninstall Drivers - Remove old and useless drivers that harm your system and slow your PC.\n\n\n\n\nHardware Management\n\nImproved Hardware Management supports the newest Intel and AMD CPU and Graphics Processing Unit including latest nVidia Quadro, GeForce AMD FirePro drivers and many more.\n\n\n\n\nSystem Health Monitoring\n\nHigh PC temperatures canreduce the stability and performance of hardware devices and possibly damage them. Driver Genius Professional 12 can monitor the temperature of CPU, Video card, HDD, etc to help prevent system damage.\n\n\n\n\n\n\n\n*Specs &amp; Requirements:\n \nThe prerequisites for Driver Genius Professional. Version: 12.0\n\nWindows:\nPlatform: Windows 8, Windows 7, Vista, XP, 2000, NT\n30 MB free disk space\n256 MB RAM \nProcessor: Pentium Class.","torrent":{"xt":"urn:btih:ba187037a6565c3fe96f5d9f653e725b8006bb6b","amp;dn":"Driver+Genius+Pro+Edition+v12.0.0.1306+-+Final+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba187037a6565c3fe96f5d9f653e725b8006bb6b","infoHashBuffer":{"type":"Buffer","data":[186,24,112,55,166,86,92,63,233,111,93,159,101,62,114,91,128,6,187,107]},"announce":[],"urlList":[]}}