{"title":"Dae-seung Kim - Hyeol-ui nu aka Blood Rain (2005)","uid":4727045,"size":1336682904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bd549b700329573cea2c86013e697990be8e5bc9&amp;dn=Dae-seung+Kim+-+Hyeol-ui+nu+aka+Blood+Rain+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lord_terabyte","files":-1,"time":1234809724,"description":"Dae-seung Kim - Hyeol-ui nu aka Blood Rain (2005)\n\nLanguage\tKorean\nSubtitles\tincluded: English, Dutch\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0462684/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0462684/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img142.imageshack.us/img142/1265/bloodraincoverki1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img142.imageshack.us/img142/1265/bloodraincoverki1.jpg&lt;/a&gt;\n\nSCREENED AT THE 2006 FANTASIA FESTIVAL: &quot;Blood Rain&quot; has a name fit for horror and the blood to match, and while supernatural thrills are certainly one direction the story could have gone, the film is actually a mystery. It's a heck of a nifty one, too, with an atmospheric setting, an intriguing sleuth, and a conspiracy that is going to be a devil to crack.\n\nIn the early part of the 19th Century, the isolated island of Donghwa is relatively prosperous thanks in large part to its paper mill, which produces paper of unusually high quality. Mainland Korea lets them remain more or less autonomous so long as they send regular tribute. This year, disaster strikes, as the ship carrying the paper bursts into flames while most of the crew is ashore. To investigate, the government sends Lee Weon-gyu (Cha Seung-won). He quickly demonstrates his crime-solving expertise on a more recent crime, but as soon as he starts investigating, townspeople start turning up dead. The more superstitious folks on the island lay the blame on the ghost of the mill's founder, who (along with his family) was executed several years ago for his alleged Catholicism. This is of more than passing interest to Weon-gyu, as his father was involved in that prosecution.\n\nBlood Rain resembles a pulp novel, if they'd had them in Korea's Joseon dynasty. The detective is stoic, the world view is cynical, and the murders are frequent and quite bloody. The mystery is, I think, solvable once you've got all the evidence (I don't recall any information withheld from the audience that Weon-gyu wsa privy to), but that's not the whole point. Like any good pulp yarn, the investigated incident is only half the story; the other half is the crime that daily life can be: The mill's owners are wealthy, but the workers are poor; the vast majority of the authority figures look down on the people so that even the ones who genuinely want to help; everybody has a shameful secret. The main difference is that Weon-gyu is less hard-boiled than many pulp protagonists.\n\nThere's also an emphasis on forensics that seems slightly anachronistic, at least to this westerner. This sort of scientific enquiry when investigating crimes would not become de rigeur in the west for many years, but even if the same is true in Korea, it serves a purpose. It establishes Weon-gyu as unusually intelligent and fair-minded; he won't be likely to be swayed by personalities or prejudices. It also marks him as an outsider; while many on the island are talking about a phantom or participating in the local shamanistic rituals, a certain amount of tension is being generated. There are, of course, certain people who don't want the mystery solved, and ghosts are convenient scapegoats\n\nIt also affords director Kim Dae-seung and writers Kim Seong-jae and Lee Won-jae the chance for a grisly autopsy scene or two. They aren't the only bloody scenes, either; although Blood Rain is at its heart a procedural, the scenes where the body count goes up could come out of a splatter movie, sometimes taking place right before or after a chase scene that exhausts even its young and fit participants. The music is generally a bombastic orchestra rather than something more fitting with the period and location. There are times when this feels almost like an action movie, with the sudden nasty death leading to a bunch of running across the island to a booming score. It might have been a good idea to have Weon-gyu actually catch up with his adversary and get into a fist fight once in a while, because the middle of the movie does sort of settle down a little too much as the investigator and audience gather information. It gets a little dry, and I occasionally found myself wondering if there was a quicker, more exciting way to get us from point A to point B.\n\nPart of the trouble is that this is a murder mystery that has its roots in events of several years past that is mostly related with words rather than flashbacks, which means that several of the more interesting characters in the story only come to us second-hand. Putting everything together despite the fragmentary information given is part of the fun of a mystery story in print, but it's a tricky matter for a movie; where a reader will subconsciously slow his or her pace down while the pieces coalesce, the director controls the pacing totally on film. On average, Kim Dae-seung does pretty well; I had everything straight by the end, but I felt a little behind toward the start, probably compounded by my relative unfamiliarity with the culture.\n\nThose relatively surmountable complaints aside, it's a very enjoyable production. The cast does their job very well, with Cha Seung-won standing out as the gruff but driven prosecutor. It's the same kind of role I'd seen him play in Murder, Take One a day or so earlier, but he makes it different in ways other than the full beard; here, he's an upper-class guy starting to realize that ideals can come easy to aristocrats. The rest of the cast blends together a little, which isn't necessarily a bad thing for a mystery; it means the movie doesn't tip its hand as to who is a suspect and who is a victim. They live in a very well-realized setting - it's a very complete-looking village, the paper mill is a cool spot for the inevitable final showdown, and the costumes are very spiffy indeed while looking genuinely used.\n\nNot all genre movies are nearly so well mounted, and even if it gets a little sluggish in the middle, &quot;Blood Rain&quot; is impressively (and aggressively) entertaining. I was kind of serial killer-ed out by this point in the festival, but still found myself very fond of this one.\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard01-31.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard01-31.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard02-32.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard02-32.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard03-34.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard03-34.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard04-31.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard04-31.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard06-22.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard06-22.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard07-5.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i497.photobucket.com/albums/rr334/little_gigabyte/Clipboard07-5.png&lt;/a&gt;\n\n------my rip---------\n\n~~~~~~ Hyeol-ui nu.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,329,055,744                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:59:37                \nFrame Count:....................................172056             \nFrame Width (pixels):...........................688                  \nFrame Height (pixels):..........................304                  \nAspect Ratio:...................................2.263                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1280                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.255&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:bd549b700329573cea2c86013e697990be8e5bc9","amp;dn":"Dae-seung+Kim+-+Hyeol-ui+nu+aka+Blood+Rain+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd549b700329573cea2c86013e697990be8e5bc9","infoHashBuffer":{"type":"Buffer","data":[189,84,155,112,3,41,87,60,234,44,134,1,62,105,121,144,190,142,91,201]},"announce":[],"urlList":[]}}