{"title":"Murray Gell-Mann: Beauty and truth in physics","uid":4682755,"size":55286103,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c4fd57158c25ea895d8e182566937ec70532d609&amp;dn=Murray+Gell-Mann%3A+Beauty+and+truth+in+physics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1233132337,"description":"Armed with a sense of humor and laypeople's terms, Nobel winner Murray Gell-Mann drops some knowledge on TEDsters about particle physics, asking questions like, Are elegant equations more likely to be right than inelegant ones?\n\nHe's been called &quot;the man with five brains&quot; -- and Murray Gell-Mann has the resume to prove it. In addition to being a Nobel laureate, he is an accomplished physicist who's earned numerous awards, medals and honorary degrees for his work with subatomic particles, including the groundbreaking theory that the nucleus of an atom comprises 100 or so fundamental building blocks called quarks.\n\nGell-Mann's influence extends well beyond his field: He's a member of the National Academy of Sciences, the American Academy of Arts and Sciences, and the Council on Foreign Relations. He also serves on the board of the Wildlife Conservation Society and is a director of Encyclopedia Britannica. Gell-Mann, a professor emeritus of Caltech, now heads the evolution of human languages program at the Santa Fe Institute, which he cofounded in 1984.\n\nA prolific writer -- he's penned scores of academic papers and several books, including The Quark and the Jaguar -- Gell-Mann is also the subject of the popular science biography Strange Beauty: Murray Gell-Mann and the Revolution in 20th-Century Physics.\n\n    &quot;The names alone that Gell-Mann applies to his new theories and formulations reflect his sense of humor, immensely broad range of interests, and deep understanding. The theories themselves say that much more.&quot;\n\nPBS\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:c4fd57158c25ea895d8e182566937ec70532d609","amp;dn":"Murray+Gell-Mann%3A+Beauty+and+truth+in+physics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4fd57158c25ea895d8e182566937ec70532d609","infoHashBuffer":{"type":"Buffer","data":[196,253,87,21,140,37,234,137,93,142,24,37,102,147,126,199,5,50,214,9]},"announce":[],"urlList":[]}}