{"title":"Win7 Codecs 1.1.5 Final","uid":4962567,"size":18084745,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c5b8dfada425fe83d07f433db7fe976084122b77&amp;dn=Win7+Codecs+1.1.5+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XoLWoX","files":-1,"time":1245377818,"description":"Compiles the best codecs from all the big name codec packs. From author of Vista Codec Package. The installer will automatically remove most other popular codec releases from your computer before installing this concise yet comprehensive package. You won't need to make any adjustments or tweaks to enjoy your media content immediately. Windows Media Player and Windows 7 Media Center will instantly recognize all your files as playable.\n\nIt does not contain a media player and it does not associate filetypes. With this package installed you will be able to use any media player, limited only by the players' capabilities, to play all movies and video clips. Streaming video is supported in several formats in all popular web browsers. Users of Win7 codecs have the ability to choose what is installed and where to install it using the public redistributable. After installation you can select to remove specific portions without removing the entire package. You can also re-add the removed items at any time.\n\nThe new Win7codecs which I have created do not change or mess with what M$ has going on with native support. This includes the native H264 playback in WMP12 and Media Center. DXVA accelerated H264 playback is provided by the codec package for all other capable non M$ players.\n\nCodecs have been a problem for most users at one time or another. This is because there has never been an 'out of the box' working solution that the average computer user could install and just have everything work properly from the beginning. There are several decent codec package solutions out there, but none of them did everything I wanted. I was always in need of a tweak, adjustment, or even a re-installation just to get the codecs I needed/wanted and most of the time, the file still didn't play properly. I've never claimed to be a media guru. My media experience prior to creating these packages was to doubleclick a file I downloaded and hope that it played. So with the help of the MSFN community, I decided to package up the bare minimum of codecs required by most computer users and share them with the rest of the world.\n\nChangelog:\n- update gabest SVN rev 1125\n- update ffdshow to SVN rev 2972\n- update xvid to SVN rev 1.3.0\n- improve thumbnail support-----------------------------------------------------------------------------------------------------------------\nJust Install\n\nZipped with WinRaR &quot;UnZip&quot;\nTested By me: White_Snake41 worked 100%\nScanned with Kaspersky Internet Security Suite 2009 8.0.0.454\n100% Clean: Note: Will not answer to other AV!!!!!!!!!!!!!!!!!!!\nNote: I do not yet know if this works as I have not tested this.. Anyone that has windows 7 and downloads &amp; tries Please let me know if it works if not I'll delete it!!!!!!!!!!!!!!!!!!!!!!Thanks White_Snake41","torrent":{"xt":"urn:btih:c5b8dfada425fe83d07f433db7fe976084122b77","amp;dn":"Win7+Codecs+1.1.5+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5b8dfada425fe83d07f433db7fe976084122b77","infoHashBuffer":{"type":"Buffer","data":[197,184,223,173,164,37,254,131,208,127,67,61,183,254,151,96,132,18,43,119]},"announce":[],"urlList":[]}}