{"title":"Der_kleine_Bibelfuchs__Das_gelobte_Land","uid":4692231,"size":401449879,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c6d047fb233ef355cb462348c62c09523db42c31&amp;dn=Der_kleine_Bibelfuchs__Das_gelobte_Land&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mostofbits","files":3,"time":1233432474,"description":"Zeichentrickfilm fÃƒÂ¼r Kinder und Erwachsene von Osamu Tezuka in deutsch.\n\nDigitaler DTV-Rip 480x576 2/3-D1 MPEG2-Format lÃƒÂ¤uft im jedem Divx-DVD-Player\n\n&quot;Bedienungsanleitung&quot; zum VerstÃƒÂ¤ndnis dieses Teils - keine Werbung\n==================================================================\n\nDas gelobte Land - was hat es damit auf sich  ?\n----------------------------------------------\n\nDieser Teil handelt vom Ende des Auszugs der Juden aus der Gefangenschaft in das\nLand, welches Gott in den biblischen Grenzen gegeben hat. Gott selbst hat dieses\nLand als sein Eigentum erklÃƒÂ¤rt und dieses Eigentum seinem Volk zum Besitz gegeben.\n\nWie in der Rechtsprechung ist Eigentum und Besitz nicht das gleiche.\n\nDas Volk der Israeliten ist zwar der rechtmÃƒÂ¤ÃƒÅ¸ige Besitzer, aber nicht der EigentÃƒÂ¼mer!\n\nDas Volk Gottes hat demnach auch nicht das Recht das Land zu zerteilen und es anderen \nVÃƒÂ¶lkern zu geben und zwar deswegen weil es Gottes Eigentum ist und Ihm allein gehÃƒÂ¶rt \nund Gott dieses Land seinem Volk gegeben hat und Nutzungsbestimmungen dafÃƒÂ¼r erlassen \nhat und auch wie die &quot;Framdlinge&quot; zu behandeln sind. \n\nIn diesem Land ist jeglicher GÃƒÂ¶tzendienst verboten. Wenn das Volk Gottes dieses ewige \nGebot miÃƒÅ¸achtet wird Gott die Feine seines Volkes aufstehen lassen und das Volk schwach \nwerden lassen. In dem MaÃƒÅ¸e wie das Volk Gottes sich Gott wieder unterordnet wird das Land \nwieder erstarken und die Feine des Volkes Gottes zerschlagen werden. \n\nWarum wird dort kein Frieden ?\n------------------------------\n\nDas Volk der Juden gehÃƒÂ¶rt zu den &quot;halsstarrigsten VÃƒÂ¶lkern der Welt&quot; (das steht so in \nder Bibel) und doch hat es Gott auserwÃƒÂ¤hlt. Wegen ihrer Halsstarrigkeiten schwankt es \naber stÃƒÂ¤ndig zwischen Fluch und Segen, Krieg und Frieden.\n\nAuf diese Weise kommt also keine Ruhe und kein Segen in das Land am Jordan, weil das Volk \nGottes die Gebote und die Sabbatzeiten, die Gott verbindlich fÃƒÂ¼r alle, die ihm nachfolgen \nund die seinen Namen tragen festgelegt hat, miÃƒÅ¸achtet. Es ist eben nun mal so festgelegt.\n\nDies gilt also ohne EinschrÃƒÂ¤nkung auch fÃƒÂ¼r die Christen, die den Sabbat miÃƒÅ¸achten und \nstattdessen wie die RÃƒÂ¶mischen Kaiser den Tag der weltweiten GÃƒÂ¶tzenverehrung den Sonntag \n(Sonnengott=Baal=GÃƒÂ¶tze) feiern. Da die RÃƒÂ¶mer Jesus kreuzigten ist schon das allein \nProvokation genug. Das Jesus die Ursache sei, dass die Christen den Sonntag halten ist \neine unglaubliche LÃƒÂ¼ge. Das hat Jesus niemals gesagt oder aufschreiben lassen!!!\n\nJesus hat gesagt, dass der Antichrist sich in den den Tempel Gottes setzen wird und sich \nuntersteht Zeiten und Gesetze zu ÃƒÂ¤ndern. Dies ist in den vielen Konzilien - eine ganz \nbesonders schwere Form von frommer GotteslÃƒÂ¤sterung - so beschlossen worden.\n\nDie Bibel sagt, dass Jesus selbst den Frieden in dieser Region bringen wird und er\nallein wird durch das zugemauerte Osttor in die Stadt Jerusamlem einziehen. \n\nAls Jesus damals in Jerusalem das erste Mal einzog und die Geistlichen ihm dies verbieten \nwollten, weil das das Volk ihn mit Palmenzweigen und Hosianna-Rufen als den Messias (ErlÃƒÂ¶ser) \nfeierte, sagte Jesus, dass wenn das Volk nicht &quot;Hosianna&quot; schreien wÃƒÂ¼rde, dann wÃƒÂ¼rden eben \ndie Steine schreien. Man merke auf - so wird es wieder sein wenn Gott der Messias wiederkommt.\n\nFast alle Computerchhip bestehen chemisch aus Mineralien und diese Mineralien in einem\nkomplizierten Verfahren schreien heute diese Botschaft in die Welt, je nachdem wieviel\nWatt die angeschlossenen PC-Lautsprecher haben, mehr oder weniger laut. JEDES Wort der\nBibel wird sich auf den Punkt erfÃƒÂ¼llen. Jesus hat gesagt am dritten Tag wird er den Tempel \nin Jerusalem wieder aufbauen. Die biblische Zeitrechnung bezieht sich dabei IMMER auf Jesus \nund dort wo er sich aufhÃƒÂ¤lt. Er hat gesagt ein Tag im Himmel sind 1000 Jahre auf der Erde (wenn\nJesus im Himmel ist) und ein Tag auf der Erde sind wie 1000 Jahre im Himmel wenn Jesus auf\nder Erde ist. Jetzt ist Jesus im Himmel - demnach sind wir am Beginn des dritten Tages \nim Himmel und die Steine schreien heute schon &quot;Hosianna, gelobt sei der da kommt im Namen\ndes Herrn&quot; - das passiert weil das Volk Gottes aufgehÃƒÂ¶rt hat Hosianna zu rufen. Ist das nicht \nwunderbar ?\n\nWie geht es weiter ?\n--------------------\n\nDer Zusammenhang zwischen Gottesfurcht und Frieden mit Segen hat sich in der jahrtausendealten \nGeschichte immer wieder gezeigt. Das letzte Gefecht, welches auf dieser Erde stattfinden wird, \ndies wird an den Grenzen Jerusalems in der Talebene von Armagedon stattfinden. \n\nGott selbst wird ALLE VÃƒÂ¶lker, die gegen Israel zu Felde ziehen, dahinschlachten und wir \nlesen in der Bibel, dass das Blut den Pferden bis an die ZÃƒÂ¼gel reichen wird. Jeder Mensch \nhat 7 Liter Blut und um ein ganzes Tal so hoch mit Blut zu fÃƒÂ¼llen braucht es schon eine \nunvorstellbare groÃƒÅ¸e Menge VÃƒÂ¶lker und Krieger. Die Bibel sagt das Blut der Krieger, die \ndann gegen das gelobte Land ziehen, wird flieÃƒÅ¸en wie in einer Weinkelter. Das ist so weil \ndieses Land Gott gehÃƒÂ¶rt und ein Volk welches es wagt Gottes Eigentum anzutasten wird von \nGott vernichtet. Die Erde ist so groÃƒÅ¸ und weit und wunderschÃƒÂ¶n, aber dieses StÃƒÂ¼ck triste \nWÃƒÂ¼stenlandschaft mit ein paar bewÃƒÂ¤sserten Oasen - dies gehÃƒÂ¶rt eben Gott, weil Jesus in diesem \nLand sein Leben gab, damit alle die an ihn glauben in seinem Reich eine ewige Wohnstatt haben \nwerden.\n\nWenn Jesus wiederkommt wird auch Jerusalem aufblÃƒÂ¼hen - es wird die Goldene Stadt genannt \nwerden und goldene StraÃƒÅ¸en haben. Das kann man sich nicht vorstellen, aber auch diese \nBibelstelle wird sich prÃƒÂ¤zise erfÃƒÂ¼llen.\n\n\nSchlusssatz\n-----------\n \nGott sagt in der Bibel wer das Volk Gottes antastet, der tastet seinen Augapfel\nan. Man kÃƒÂ¶nnte sagen Gott sieht alle VÃƒÂ¶lker der Welt aus der Sicht seines Volkes. \n\nSo wie Aaron es aber zulies das das Volk Gottes das Goldene Kalb (GÃƒÂ¶tzendienst) anbetete \nund deswegen nicht ins gelobte Land kommen durfte haben wir heute eine Analogie zu den \nheutigen Gemeindeleitern, die geistiche Unordnungen in ihren Gemeinden zulassen. Das Gericht \nÃƒÂ¼ber sie wird ungleich hÃƒÂ¤rter sein, als fÃƒÂ¼r jeden GlÃƒÂ¤ubigen, der einen Fehltritt getan hat und\nsogar hÃƒÂ¤rter als die die Jesus kreuzigten, denn die Gemeindeleiter wissen was sie tun und \nwenn nicht mÃƒÂ¼ssen sie sich eben in der Bibel belesen und brauchen sich nicht hinter \nKirchenvorschriften verstecken, denn beim jÃƒÂ¼ngsten Gericht sind diese alle wertlos und nichtig.\n\nHaltet also die Gebote Gottes ob Christ oder Jude, dann wird der Segen ÃƒÂ¼ber Eurem Hause \nvollkommen sein. Wir wissen das das Gesetz allein nicht den Platz im Himmel garantiert, denn\nJesus sagt keiner kommt zum Vater, denn durch mich. Also ist das vorbildliche Leben und \nVerhalten Jesu wie ein Spiegelbild welchem wir als Christen ebenbildlich sein sollten,\nauch wenn wir oft genug daran scheitern. DafÃƒÂ¼r gibt es aber die Vergebung. Dem, der seine \nFehltritte ernstlich bereut und erkennen lÃƒÂ¤sst, dass er sich bessern will, dem wird\nGott seine Fehltritte auch vergeben und sie an der tiefsten Stelle im Meer versenken und\ndort steht &quot;Fischen verboten&quot; (das &quot;versenken&quot; war ein geistlicher Eindruck von Corrie Ten Boom) \n\nWer aber Mutwillen treibt, dem bleiben die Fehltritte erhalten. Eine pauschale Vergebung \nohne jede Einsicht und den Versuch der Wiedergutmachung ist eine gefÃƒÂ¤hrliche Irrlehre, \nausgedacht von zÃƒÂ¼gelosen Leuten, die die Gebote Gottes nicht wertachten. \n\nOb Jude oder Christ - wir sehen uns im Himmel wieder und bis dahin lebt wie Geschwister in \nungeheuchelter Liebe und freut Euch an den Geboten Gottes, denn im Vergleich zu den \nGesetzen der GÃƒÂ¶tzendiener sind sie alle leicht zu merken, sinnvoll, ÃƒÂ¼berschaubar und gut.\n\n5.Mose 5 - Download &quot;elektronische&quot; Bibel also Steine die schreien - www.mybible.de\n\nBleibt behÃƒÂ¼tet!\n ","torrent":{"xt":"urn:btih:c6d047fb233ef355cb462348c62c09523db42c31","amp;dn":"Der_kleine_Bibelfuchs__Das_gelobte_Land","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d047fb233ef355cb462348c62c09523db42c31","infoHashBuffer":{"type":"Buffer","data":[198,208,71,251,35,62,243,85,203,70,35,72,198,44,9,82,61,180,44,49]},"announce":[],"urlList":[]}}