{"title":"Sherlock Holmes and the Running Noose","uid":6434054,"size":273754683,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c6d4e1e742a562e33264016a09be8915b57ea8be&amp;dn=Sherlock+Holmes+and+the+Running+Noose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rosie1966","files":7,"time":1306715224,"description":"Sherlock Holmes and the Running Noose\nby Donald Thomas\nnarrated by John Telfer\n\nThis is a reupload of a torrent of mine which had one mp3 for each CD but now will be one mp3 for each story so that each mp3 has the title of the story instead of something like Running Noose parts 1 through 8.. I am doing this with a few Holmes torrents.\nI've managed to remove all the 'end of CD 1' and 'start of CD2' announcements for this one as well.\nI will add that I didn't take the old mp3 files and edit them. I have the CD set so I just started from the start again - making wavs and editing those in Audacity.\n\nAbout the book...\nSix new tales of crime presented by Dr Watson from the documents of Sherlock Holmes, which follow on from The Secret Cases of Sherlock Holmes. What were Holmes's views on Dr Crippen? What happened when Oscar Wilde visited Baker Street to seek advice? How did Holmes reveal a loving husband to be one of the most dangerous psychopaths of modern times? And just what horrors await Holmes in the darkened slums of Waterloo Road?\nRelating Holmes' part in real-life crimes of the day, Donald Thomas brings the Great Detective to life once again, displaying Holmes at his most determined, inventive and downright devious.\n\nCh1 The Two Failures of Sherlock Holmes\nCh2 The Case of the Racing Certainty\nCh3 The Case of the Naked Bicyclists\nCh4 The Case of the Sporting Major\nCh5 The Case of the Hygienic Husband\nCh6 The Case of the Talking Corpse\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c6d4e1e742a562e33264016a09be8915b57ea8be","amp;dn":"Sherlock+Holmes+and+the+Running+Noose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d4e1e742a562e33264016a09be8915b57ea8be","infoHashBuffer":{"type":"Buffer","data":[198,212,225,231,66,165,98,227,50,100,1,106,9,190,137,21,181,126,168,190]},"announce":[],"urlList":[]}}