{"title":"EXPLOITED COLLEGE GIRLS - Kelsey - Redhead Teen Titties So Big H","uid":9063686,"size":1485826664,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c9b5c5e642f2f432d44bbe1feb1b9614792856d3&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Kelsey+-+Redhead+Teen+Titties+So+Big+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1382068640,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=uxx98_kly.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=uxx98_kly.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=3rs69_exploitedcollegegirl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=3rs69_exploitedcollegegirl.jpg&lt;/a&gt;\n\nIt's been ages since I had a girl both this enthusiastic and this busty. Kelsey is a former cam girl and you can tell from her dirty talk and sexy enthusiasm that it's a career well suited to her and her all natural D cups.\n\nPrior to meeting, Kelsey mentioned that she'd done some webcam modeling and felt very free and comfortable in front of the camera which sounded like a great session in the making. When I get to know her on the ride to our location, she wastes no time showing off her camming skills. This girl has a supercharged libido and isn't shy about sharing in as much detail as you could want. She's got the phone sex operator voice down pat and before she pops her amazing tits out of her top she's already got me hard. Me being hard and behind the wheel can only mean one thing - road head. As good as her BJ skills are, there is def one thing missing: Kelsey's big naturals bouncing and jiggling. Do stay tuned, however, there's plenty of that to come.\n\nWe get set up in the room and while I intend to get a little more interview done, Kelsey has other ideas because as soon as she's comfortable she starts playing with her pussy. As a guy who can take a hint, I drop the small talk and get between her legs with a vibrator. When she agrees to try anal I get excited, but it turns out no amount of lube is going to get me access to her tight back door.\n\nAfter her first orgasm, the real fun starts when she drops to her knees to suck me off. This turns into one of the best oral scenes I've shot in a long time. Turns out Kelsey really, really loves sucking cock. She's got a bottomless throat and takes me all the way down repeatedly. Between fucking her throat and fucking her big tits, I'm almost ready to blow my load before we even get to the sex!\n\nThe actual sex turns out to be great, too. This girl is incredibly flexible and bends herself around my cock in the most amazing ways. Knowing that she likes to manhandled, I take control and fuck her hard and rough until she orgasms several more times.\n\nOn a lot of occasions when I get a girl that's as much of a big talker as Kelsey they don't really back it up, I have had plenty of girls call themselves nymphos who love to show off for the camera only to be a complete zero as soon as the red light goes on and my dick comes out. In this case JUST THE OPPOSITE. Not only does Kelsey have the dirty mouth of a phone sex operator, she's up for ANYTHING. From letting me attempt anal on her tight ass to letting me throat fuck her to swallowing the majority of a facial, she really is up for anything.","torrent":{"xt":"urn:btih:c9b5c5e642f2f432d44bbe1feb1b9614792856d3","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Kelsey+-+Redhead+Teen+Titties+So+Big+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b5c5e642f2f432d44bbe1feb1b9614792856d3","infoHashBuffer":{"type":"Buffer","data":[201,181,197,230,66,242,244,50,212,75,190,31,235,27,150,20,121,40,86,211]},"announce":[],"urlList":[]}}