{"title":"Syrup.pdf","uid":9416967,"size":146338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca00b35d0fea81e220c4513433e510127d40cb87&amp;dn=Syrup.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"benlynn","files":1,"time":1388473613,"description":"This is my story recounting the past two years I've spent experimenting with a phenomena I accidentally stumbled upon with a common over the counter cough syrup and how it interacted with my daily prescription SNRI medication. The experience I can only describe as being a real life version of the movie 'Limitless' with Bradley Cooper. In the movie, the protagonist is introduced to a pill that blows away any barriers in his consciousness and allows him to tap into the endlessly creative resources hidden deep in his psyche. A tiny example of how this interaction unleashed previously unknown abilities in my own self is the writing if this mini-book itself. To someone who writes frequently or for a living, a 9 page 3800 word account of ones daily life is a very simple accomplishment to be sure. For a person like myself who has the attention span of a meth addicted ferret, who struggles to put together a two line email, this a feat. Once I decided to write down my experiences it took one solid 5 hour stretch of writing with a few edits and re-reads to complete and publish on Kindle store. Unheard of in my regular state as anyone close to me would attest. The implications of this if ever to be verified by research are monumental and truly one of the great discoveries of mankind. This account only speaks to my experience and I cannot speak for any other findings or experiences of others. This is the absolute truth to what happened to me and the near superhuman levels of brain power that I encountered.","torrent":{"xt":"urn:btih:ca00b35d0fea81e220c4513433e510127d40cb87","amp;dn":"Syrup.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca00b35d0fea81e220c4513433e510127d40cb87","infoHashBuffer":{"type":"Buffer","data":[202,0,179,93,15,234,129,226,32,196,81,52,51,229,16,18,125,64,203,135]},"announce":[],"urlList":[]}}