{"title":"Network Infrastructure Security (2009)","uid":4883461,"size":12407026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc28181dc8e8b6ba76e5712c5531afbf8dd4a515&amp;dn=Network+Infrastructure+Security+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bugzbunny","files":-1,"time":1241521223,"description":"Network Infrastructure Security\n\nSpringer\nISBN: 1441901655\nPaperback: 266 pages\nDate: Apr 2009\nFormat: PDF\n\n\n Research on Internet security over the past few decades has focused mainly on information assurance, issues of data confidentiality and integrity as explored through cryptograph algorithms, digital signature, authentication code, etc. Unlike other books on network information security, Network Infrastructure Security by Angus Wong and Alan Yeung addresses the emerging concern with better detecting and preventing routers and other network devices from being attacked or compromised.\n\nAttacks to network infrastructure affect large portions of the Internet at a time and create large amounts of service disruption, due to breaches such as IP spoofing, routing table poisoning and routing loops. Daily operations around the world highly depend on the availability and reliability of the Internet, which makes the security of this infrastructure a top priority issue in the field.\n\nNetwork Infrastructure Security is a book that bridges the gap between the study of the traffic flow of networks and the study of the actual network configuration. This book makes effective use of examples and figures to illustrate network infrastructure attacks from a theoretical point of view. The book includes conceptual examples that show how network attacks can be run, along with appropriate countermeasures and solutions.\n\n","torrent":{"xt":"urn:btih:cc28181dc8e8b6ba76e5712c5531afbf8dd4a515","amp;dn":"Network+Infrastructure+Security+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc28181dc8e8b6ba76e5712c5531afbf8dd4a515","infoHashBuffer":{"type":"Buffer","data":[204,40,24,29,200,232,182,186,118,229,113,44,85,49,175,191,141,212,165,21]},"announce":[],"urlList":[]}}