{"title":"The Mentalist S1 E7 (2008)nl.subs.NLT-Release (DivX)","uid":4629767,"size":434226698,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ccf3ff060e920ba170e98dd1f1b6ecf58f8e4394&amp;dn=The+Mentalist+S1+E7+%282008%29nl.subs.NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"linday1","files":-1,"time":1231348462,"description":"De nieuwe Amerikaanse hitserie The Mentalist is vanaf 1 januari wekelijks te zien op SBS 6. Deze crimeserie vertelt het verhaal van Patrick Jane: een zeer bekende, voormalig televisieparagnost die, nadat hij ontmaskert is als fraudeur, nu zijn echte vaardigheden als mentalist gebruikt om het Californie Bureau of Investigation te helpen met het oplossen van misdrijven. Als mentalist, gebruikt Patrick Jane zijn zeer ontwikkelde kundigheden: observeren, afleiden en manipuleren, om het Serious Crime Team te ondersteunen. Hij is charismatisch, een beetje vreemd - en stuurs, en zijn moderne Sherlock Holmes achtige, opzienbarende methodes overschrijden vaak een grens, maar deze methodes geven hem uiteindelijk vaak gelijk.\n\nTeresa Lisbon is een top agent van het CBI die vaak met Patrick Jane samenwerkt. Alhoewel ze schoorvoetend moet toegeven dat hij talent heeft en dat zijn methodes vaak werken, is ze vastberaden de misdrijven op te lossen, met of zonder hem.\n\n\nSeason 1: Episode 07: Seeing Red\nThe team investigates a hit and run murder of a wealthy California heiress, Rosemary Tennant, whose death was predicted by her psychic, Kristina Frye, moments before the accident. Jane, always the skeptic, laughs at the prediction and becomes intent on proving the psychic is a fake and a killer. But when CBI discovers Rosemary's will was being changed, suspicion falls on Rosemary's deviant teenage son, who was being cut out of the will, her younger lover, as well as the ever-present Kristina who was named as a beneficiary in the will. In order to catch the real murderer, Jane uses a gathering of Rosemary's supposed loved ones at a seance, that they think is to expose Kristina as a fraud, but is instead a mentalist trap to flush out the killer.\n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\n\nEnjoy The Movie!!!!!!","torrent":{"xt":"urn:btih:ccf3ff060e920ba170e98dd1f1b6ecf58f8e4394","amp;dn":"The+Mentalist+S1+E7+%282008%29nl.subs.NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccf3ff060e920ba170e98dd1f1b6ecf58f8e4394","infoHashBuffer":{"type":"Buffer","data":[204,243,255,6,14,146,11,161,112,233,141,209,241,182,236,245,143,142,67,148]},"announce":[],"urlList":[]}}