{"title":"Deathmole","uid":4760071,"size":286547736,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd8da0cd52df7dbad5ab916f73afab337ea79cc5&amp;dn=Deathmole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tssman","files":33,"time":1236658363,"description":"Welcome to the QC music page, where I post all the songs I've recorded over the years that I think are good enough to share. These are all done in Apple's Logic software (older stuff was done in Garageband), using just my guitars and computer and Line 6 PODx3. The drums are all (obviously, in most cases) sequenced. The &quot;Deathmole&quot; stuff is all melodic metal, whereas the stuff under my own name tends to be more indie-rock influenced. They all sound like me, though, since I wrote 'em all.\n\nI don't claim that these are in any way &quot;finished&quot; songs from a production standpoint- the fake drums, in some cases bad mixing, and overall dashed-off nature of these tracks (most were recorded in the space of a single afternoon or evening) qualifies them as &quot;demos&quot; at best. Still, it is my hope that you will enjoy them for what they are.\n\nThe mp3s are free! Spread them around! Put 'em on your website, on BitTorrent, send copies to your friends, do whatever you want with the files. But please, PLEASE bear in mind that I'm hosting them myself. If this page turns into too much of a bandwidth hog I'll have to pull the mp3s. With that in mind, mirror or use the BitTorrent files wherever possible, and please consider donating whatever you feel is appropriate to help pay my bills. \n\n&gt;&gt;If you like please leave a donation at questionablecontent.net/mp3","torrent":{"xt":"urn:btih:cd8da0cd52df7dbad5ab916f73afab337ea79cc5","amp;dn":"Deathmole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd8da0cd52df7dbad5ab916f73afab337ea79cc5","infoHashBuffer":{"type":"Buffer","data":[205,141,160,205,82,223,125,186,213,171,145,111,115,175,171,51,126,167,156,197]},"announce":[],"urlList":[]}}