{"title":"Dawn of the Dead *1978* [FULL HD 1080p] [XviD] [Subtitles PL] [2","uid":6211847,"size":8043616888,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:ce2790fdde8aa242202371902d3b190280d5826b&amp;dn=Dawn+of+the+Dead+%2A1978%2A+%5BFULL+HD+1080p%5D+%5BXviD%5D+%5BSubtitles+PL%5D+%5B2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SajberG","files":4,"time":1299012953,"description":"Country: United States, Italy\nSpecies: Horror\nRelease date(s): September 2, 1979\nRunning time: 126 Minutes\nDirected by: George A. Romero\nWritten by: George A. Romero\nCinematography:\tMichael Gornick\nDistributed by: United Film Distribution Company\n\nProduced by: \nRichard P. Rubinstein\nClaudio Argento\nAlfredo Cuomo\n\nStarring:\nDavid Emge\nKen Foree\nScott Reiniger\nGaylen Ross\n\nMusic by:\nDario Argento\nGoblin\nPretty Things\nHerbert Chappell\nPaul Lemel\nEric Towren\nSimon Park\nJack Trombey\nDerek Scott\nBarry Stoller\nReg Tilsley\nPierre Arvay\n\nEditing by:\nGeorge A. Romero\nStudio\tLaurel Group Inc.\n\n***\nFollowing the scenario set up in Night of the Living Dead, the United States (and possibly the entire world) has been devastated by a phenomenon which reanimates recently deceased human beings and turns them into flesh-eating zombies. The cause of this phenomenon is unknown. Despite desperate efforts by the US Government and local civil authorities to control the situation, society has effectively collapsed and the remaining survivors seek refuge. Some rural citizens and the military have been effective in fighting the zombies out in open country, but cities, with their high populations and close quarters, are essentially deathtraps. The chaos has apparently spread throughout the country, evident by infrequent television and radio broadcasts.\n\nConfusion reigns at the WGON television studio in Philadelphia. Staff member Stephen, the pilot of the station's traffic helicopter, and his girlfriend Francine are planning to steal the helicopter to escape the zombie threat. Meanwhile, Roger and his SWAT team raid an apartment building where the residents are ignoring the martial law imposition of delivering the dead over to National Guardsmen. Some residents attack with rifles, and are slaughtered by the SWAT operatives, and by their own reanimated dead. During the raid, Roger meets Peter, part of another SWAT team. They find the basement is packed with zombies, placed there by the living residents, and kill them. Roger, who knows of Stephen's plan, suggests they desert their SWAT teams and flee the city.\n\nLate that night, Roger and Peter escape Philadelphia with Francine and Stephen. Following some close calls while stopping for fuel, the group comes across a shopping mall, which becomes their private sanctuary. To make the mall safe for habitation, they kill the mall's zombie population and block the large glass doors with trucks to keep the undead gathered outside from entering. During the operation, the impulsive Roger becomes reckless and is bitten, dooming him to death. After clearing the mall of its zombie inhabitants, the four settle in, each indulging their every material desire.\n\nTime passes as the undead paw at the mall entrances and society beyond those doors continues to collapse. As the novelty of their materialistic utopia wears thin, they begin to realize their refuge has become their prison. It is revealed that Francine is about four months pregnant. Roger eventually succumbs to his wounds, reanimates and is shot by Peter as his last dying request. All emergency broadcast transmissions have ceased, suggesting that most, if not all, of civilization around them has collapsed.\n\nA gang of bikers break into the mall, which also allows hundreds of the zombies inside. Stephen foolishly initiates a gun battle with the bikers; he is shot in the arm and then attacked by zombies. The ravenous zombies feast upon many of the bikers, and the surviving bikers make a hasty retreat from the mall, having paid a hefty price for what little loot they managed to gain from it. Stephen dies from his wounds and reanimates as a zombie, leading a group of the creatures to Francine and Peter's hideout. Peter kills Stephen while Francine escapes to the roof. Peter decides to stay and contemplates suicide before heading to the roof to join Francine, and the two fly away in the partially fueled helicopter to an uncertain future.\n***\n\nLanguage: English\nSubtitles: Polish\n\nCodec: XviD\nVideo Size: 1920x1080\nFrameRate: 23.976 FPS\nAspect ratio: 16:9\nBitRate: 4500 kb/s\nFrame Quality: 0.091 bits/pixel\nAudio: 448 kb/s (6 ch) CBR 48000 Hz [WAVE_FORMAT_AC3]","torrent":{"xt":"urn:btih:ce2790fdde8aa242202371902d3b190280d5826b","amp;dn":"Dawn+of+the+Dead+%2A1978%2A+%5BFULL+HD+1080p%5D+%5BXviD%5D+%5BSubtitles+PL%5D+%5B2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce2790fdde8aa242202371902d3b190280d5826b","infoHashBuffer":{"type":"Buffer","data":[206,39,144,253,222,138,162,66,32,35,113,144,45,59,25,2,128,213,130,107]},"announce":[],"urlList":[]}}