{"title":"Jetico Personal Firewall v2.0.0.35-EDGE","uid":3814152,"size":3393999,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d3192e71a6539f40db3f40d9124a3ef2ef84a893&amp;dn=Jetico+Personal+Firewall+v2.0.0.35-EDGE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Antje14","files":1,"time":1190385205,"description":"ZoneAlarm? Outpost? Who needs them when you Jetico?s Personal Firewall. Well, thats what they would have you believe. Anyway, Personal Firewall is another firewall application for your home PC, and claims to be able to outperform ZoneAlarm and Outpost. I would probably stick with the tried and tested, but this might float your boat!\n\nJetico Personal Firewall software provides you with security against hackers who try to access your PC when you are connected to the Internet. Having inherited the Open architecture principles from BestCrypt, Jetico Personal Firewall allows you to construct a strong yet accurate security policy and provides clear control over your network connections.\n\nProgram Features:\n\n    * Jetico Personal Firewall v2 runs as privileged Windows service. It can protect computer before user logon.\n    * Native support for Windows XP Fast User Switching and Terminal Services.\n    * Jetico Personal Firewall supports Access Control Lists for all main functions. Administrator can configure ACL to grant access to particular firewall functions for any user or group.\n    * Windows XP Service Pack 2 Security Center support.\n","torrent":{"xt":"urn:btih:d3192e71a6539f40db3f40d9124a3ef2ef84a893","amp;dn":"Jetico+Personal+Firewall+v2.0.0.35-EDGE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3192e71a6539f40db3f40d9124a3ef2ef84a893","infoHashBuffer":{"type":"Buffer","data":[211,25,46,113,166,83,159,64,219,63,64,217,18,74,62,242,239,132,168,147]},"announce":[],"urlList":[]}}