{"title":"Niels Diffrient: Rethinking the way we sit down","uid":4878599,"size":57684998,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d37bb744d48e97dc3842c0010093dc67320541a2&amp;dn=Niels+Diffrient%3A+Rethinking+the+way+we+sit+down&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241263487,"description":"Niels Diffrient: Rethinking the way we sit down\n\nDesign legend Niels Diffrient talks about his life in industrial design (and the reason he became a designer instead of a jet pilot). He details his quest to completely rethink the office chair starting from one fundamental data set: the human body.\n\nNiels Diffrient is a pioneer of ergonomic design -- taking the radical approach of examining the human body as it interacts with furniture, and asking, Is there a better way to sit? His three-volume reference work, Humanscale, explores the relationship of spine to chair and other &quot;human engineering&quot; data necessary for highly specialized workplaces such as a cockpit or a truck cab, as well as aiding in the search for the perfectly comfortable place to sit down.\n\nIn the 1990s, Diffrient turned his attention to the office task chair. Working with the company Humanscale, he drew up the Freedom chair, a self-adjusting chair that mixed advanced materials (such as a gel seat pad) with good old-fashioned sketchbook design. The Freedom chair was part of a late-'90s revolution in design that turned expensive ergonomic office chairs into dot-com covetables. In 2004, Diffrient and Humanscale released the lighter and lower-priced Liberty task chair.\n\n    &quot;Back in 1955, Diffrient (now a hale and hearty 71) was one of the first guys to x-ray a human spine in a chair, discovering and documenting what chairs do to people in real life. Before that, he reminisces when we meet, &quot;We knew nothing, except what you'd see from a skeleton.&quot; Skeletons don't purchase much office seating.&quot;\n\nBruce Sterling, Wired\n","torrent":{"xt":"urn:btih:d37bb744d48e97dc3842c0010093dc67320541a2","amp;dn":"Niels+Diffrient%3A+Rethinking+the+way+we+sit+down","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37bb744d48e97dc3842c0010093dc67320541a2","infoHashBuffer":{"type":"Buffer","data":[211,123,183,68,212,142,151,220,56,66,192,1,0,147,220,103,50,5,65,162]},"announce":[],"urlList":[]}}