{"title":"Paul MacCready: Flying on solar wings","uid":4682759,"size":75205927,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d74b89f98096691d0dca0b540b0429a9464c0675&amp;dn=Paul+MacCready%3A+Flying+on+solar+wings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1233132402,"description":"Paul MacCready -- aircraft designer, environmentalist, and lifelong lover of flight -- talks about his long career.\n\nThrough his life, Paul MacCready turned his mind, energy and heart toward his two passions: flight and the Earth. His early training as a fighter and glider pilot (glider pilots still use the &quot;MacCready speed ring&quot; he developed after World War II) led him to explore nontraditional flight and nontraditional energy sources.\n\nIn the 1970s, he and his company, AeroVironment, designed and built two record-breaking human-powered planes: the Gossamer Condor, the first human-powered aircraft to complete a one-mile course set by the Kremer Prize, and the Gossamer Albatross, the first to cross the English Channel. The planes' avian names reveal the deep insight that MacCready brought to the challenge -- that large birds, in their wing shape and flying style, possess an elegant secret of flight.\n\nHe then turned his wide-ranging mind toward environmentally responsible design, informed by his belief that human expansion poses a grave threat to the natural world. His team at AeroVironment prototyped an electric car that became General Motors' pioneering EV-1. They explored alternative energy sources, including building-top wind turbines. And they developed a fleet of fascinating aircraft -- including his Helios solar-powered glider, built to fly in the very top 2 percent of Earth's atmosphere, and the 2005 Global Observer, the first unmanned plane powered by hydrogen cells. \n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:d74b89f98096691d0dca0b540b0429a9464c0675","amp;dn":"Paul+MacCready%3A+Flying+on+solar+wings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d74b89f98096691d0dca0b540b0429a9464c0675","infoHashBuffer":{"type":"Buffer","data":[215,75,137,249,128,150,105,29,13,202,11,84,11,4,41,169,70,76,6,117]},"announce":[],"urlList":[]}}