{"title":"Tribute To Albert Ayler - Live At The Dynamo (2009)","uid":6729220,"size":515583729,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da8ab63a081e0229028ee5f327fd05dbc65bf491&amp;dn=Tribute+To+Albert+Ayler+-+Live+At+The+Dynamo+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mariorg","files":-1,"time":1318067877,"description":"Marge 45 &lt;a href=&quot;\nhttp://futuramarge.free.fr/fr/listemarge.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://futuramarge.free.fr/fr/listemarge.php&lt;/a&gt;\n\n* Roy Campbell: trompette, trompette de poche, flÃƒÂ»te de bambou, effets sonores et voix\n* Joe McPhee: saxophone tÃƒÂ©nor, trompette de poche et voix\n* William Parker: contrebasse et voix\n* Warren Smith: batterie, percussions et voix\n\nHomepage:\n~~~~~~~~ &lt;a href=&quot;\nhttp://www.roycampbellmusic.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.roycampbellmusic.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.joemcphee.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.joemcphee.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.williamparker.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.williamparker.net/&lt;/a&gt;\n\nReviews\n~~~~~~~\nBy Stef\n\nAlbert Ayler was one of the truly great musicians of the early free jazz period,\nmixing ferocious heart-wrenching wailing with sensitivity and spirituality, all\nbuilt over a backbone of traditional music, gospel and military marches. His\nlife and his music did not differ much : all intensity, restless searching,\nlooking for true musical authenticity, travelling, practicing, playing, dying\nbefore he reached the age of 35, probably by suicide.\n\nMany modern jazz musicians feel indebted to him, and played tributes to him, but\nno band is more fit to play a tribute to him than the band called this\nway. Tenor saxophonist and pocket trumpetist Joe McPhee is possibly the true\nheir of Ayler, and he finds soulmates in Roy Campbell on trumpet, pocket\ntrumpet, bamboo flutes, recorder, voice, William Parker on bass, Warren Smith on\ndrums and percussion. The album was recorded live at the &quot;Dynamo&quot; in Paris,\nFrance in November 2008, a month after I saw them perform in Antwerp, also a\nmemorable performance.\n\nThe four musicians really play tribute to Ayler's essence, yet in their own way,\nwithout trying to copy him or even emulate them. The performance starts with the\nrecitation of &quot;Music Is The Healing Force Of The Universe&quot;, which slowly evolves\ninto Miriam Makeba's &quot;Muntu&quot;, a slow, hypnotic and intense improvisation, that\ndemonstrates the skills of these four musicians: it is powerful, spiritual,\nemotional, gradually gaining tension and force without losing control.\n\n&quot;Obama Victory Shoutout&quot; says what it is : a celebration of Obama's victory,\nwithout violence, without bloodshed, as a turning point in American history,\nhere a joyous political declamation and shout-out by all four musicians moving\ninto Ayler's &quot;The Truth Is Marching In&quot;.\n\nThe fourth track starts with &quot;DC&quot;, a Don Cherry tune, that also appeared on\nAyler's &quot;Spirits Rejoice&quot; and that evolves into &quot;Vibrations&quot;. McPhee plays an\nincredibly piercing part on this, shouting through his horn while playing at the\nsame time, with Parker's arco offering dark contrast to his sound.\n\nThe fifth track is Don Ayler's &quot;Prophet John&quot;, and starts with Campbell's\nwonderful trumpet playing, first joyfully, then expanding the theme into a\nfifteen minute long wild improvisation, with Smith's great polyrhythmics\nsupporting a long powerful arco bass solo by Parker, then taking the piece to\nthe outro himself, soft and inventive.\n\nThe record ends with &quot;Universal Indians&quot;, the shortest piece on the album, and\npossibly an encore.\n\nIf you like free jazz, which I assume, don't miss this album. It brings a\nwonderful overview of fourty years of musical history by four masters, who as a\ntight unit manage to demonstrate the value of Ayler's music, but even stronger,\nhow beautiful, how uplifting, how spiritual and how emotionally moving great\nmusic can be. They are not going back in time, quite to the contrary, they bring\nAyler's music back to life, but then in today's context, with all the skills and\nperforming experience Ayler never got the chance to achieve. And it must be said\n: all four musicians are stellar. They understand the power of\nmusic. Deeply.Warmly. Truly.\n\nCredits to the record company too : the quality of the sound is excellent, so\nare the liner notes, with interesting interviews with the musicians, and - even\nrarer these days - they keep the applause at the end of the tracks, showing the\nwarm appreciation of the audience, even for a full two minutes after the last\ntrack, as if you were there.\n\n--\n\nBy Tim Niland\n\nBy Lyn Horton &lt;a href=&quot;\nhttp://jazztimes.com/articles/25591-tribute-to-albert-ayler-live-at-the-dynamo-joe-mcphee-roy-campbell-william-parker-warren-smith&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jazztimes.com/articles/25591-tribute-to-albert-ayler-live-at-the-dynamo-joe-mcphee-roy-campbell-william-parker-warren-smith&lt;/a&gt;\n\nBy Gian Paolo Galasi\n\nBy Jean Buzelin (fr) &lt;a href=&quot;\nhttp://culturejazz2.free.fr/spip.php?article1527&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://culturejazz2.free.fr/spip.php?article1527&lt;/a&gt;\n","torrent":{"xt":"urn:btih:da8ab63a081e0229028ee5f327fd05dbc65bf491","amp;dn":"Tribute+To+Albert+Ayler+-+Live+At+The+Dynamo+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da8ab63a081e0229028ee5f327fd05dbc65bf491","infoHashBuffer":{"type":"Buffer","data":[218,138,182,58,8,30,2,41,2,142,229,243,39,253,5,219,198,91,244,145]},"announce":[],"urlList":[]}}