{"title":"Depeche Mode - Everything Counts (2nafish)","uid":6049027,"size":145000452,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dcf2c238bf4c790845c172f08eff57874f5a4207&amp;dn=Depeche+Mode+-+Everything+Counts+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1292661444,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Everything Counts&quot; was Depeche Mode's eighth UK single (released on 11 July 1983) and third US single (released on 2 November 1983), from the then upcoming album Construction Time Again. It was the first in a long line of industrial-inspired singles released by the band, and has been referred to as &quot;arguably...the first English-language industrial pop hit.&quot; The single was re-released (in live format) on 13 February 1989 (25 March 1989 in the US) to support the live album 101.\n\nThe music video for &quot;Everything Counts&quot; was directed by Clive Richardson in and around Berlin. The band returned to Richardson after not being satisfied with the work of Julien Temple for the A Broken Frame singles. Richardson had previously directed the video to &quot;Just Can't Get Enough&quot; two years earlier. According to Wilder, &quot;It was felt that after the Julien Temple years, we needed to harden up not only our sound but also our image. Clive had lots of new ideas which didn't involve stupid storyboards where we were required to act.&quot; In the original music video, the xylophone, the melodica, and the shawm are played by Alan Wilder, Martin Gore, and Andrew Fletcher, respectively. The shawm, however, is produced by a synthesizer on the studio recording, but the band used the real shawm in the music video and television performances for show.\n\nThe song would quickly catch on as a fan favorite at the band's concerts, and was used as the opening song for the Construction Time Again tour. The first live version of the song to appear on a commercial release came from the Some Great Reward tour in 1984, when a recording from a show in Liverpool appeared on the double A-sided &quot;Blasphemous Rumours/Somebody&quot; single. During the Music for the Masses Tour, the band used &quot;Everything Counts&quot; as the final encore and in 1989, the song would be re-released as a single in live form, to promote the live album 101. All live tracks from the release were recorded on 18 June 1988 at the Pasadena Rose Bowl during the final performance of the aforementioned Music for the Masses Tour. This version of the song is famous for the recording of the crowd continuing to sing the chorus long after the music had stopped.\n\nIt also appears in Devotional as the closer. It was played during the first two legs of Touring the Angel in the first encore, and also appears on the Touring the Angel: Live in Milan-DVD.\n\nEverything Counts was also remixed and re-released in 2006. Everything Counts - Oliver Huntemann &amp; Stephan Bodzin Dub features on the limited edition release of the single Martyr. There's also an unreleased Oliver Huntemann &amp; Stephan Bodzin remix that floats on the internet, which contains more vocal parts from the original version.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:dcf2c238bf4c790845c172f08eff57874f5a4207","amp;dn":"Depeche+Mode+-+Everything+Counts+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf2c238bf4c790845c172f08eff57874f5a4207","infoHashBuffer":{"type":"Buffer","data":[220,242,194,56,191,76,121,8,69,193,114,240,142,255,87,135,79,90,66,7]},"announce":[],"urlList":[]}}