{"title":"Egeo.El legado de la Atlantida.(civilizaciones perdidas).DVDRIP.","uid":5800197,"size":478169826,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e380d5bb0537b7b831efb5c7a9fc62f00bd0bce2&amp;dn=Egeo.El+legado+de+la+Atlantida.%28civilizaciones+perdidas%29.DVDRIP.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":-1,"time":1283239504,"description":"10. Egeo: El legado de la AtlÃƒÂ¡ntida\nLa historia de la AtlÃƒÂ¡ntida resuena, todavÃƒÂ­a hoy, como la mÃƒÂ­tica leyenda de la que fuera una poderosa y mÃƒÂ­tica isla derrotada por el mar. Pero, Ã‚Â¿quÃƒÂ© pasarÃƒÂ­a si el relato que nos hubiera contado PlatÃƒÂ³n no fuera una fantasÃƒÂ­a y sucediera en una civilizaciÃƒÂ³n actual? Ã‚Â¿Una civilizaciÃƒÂ³n que dejÃƒÂ³ una prueba indiscutible de su existencia entre las culturas mÃƒÂ¡s importantes y prÃƒÂ³speras que persistieron despuÃƒÂ©s de que la AtlÃƒÂ¡ntida desapareciera y se convirtiera en leyenda?\n\nÃƒÅ¡nase a los arqueÃƒÂ³logos que descubren nueva y sorprendente informaciÃƒÂ³n de la historia de las primeras civilizaciones de tan fascinante regiÃƒÂ³n. Visite el posible emplazamiento de la AtlÃƒÂ¡ntida en la isla griega de Tera donde, hace 3.000 aÃƒÂ±os, la erupciÃƒÂ³n volcÃƒÂ¡nica mÃƒÂ¡s violenta de la historia de la humanidad destruyÃƒÂ³ una de las culturas mÃƒÂ¡s importantes y avanzadas de la regiÃƒÂ³n. Luego navegue a Creta, TurquÃƒÂ­a y a la penÃƒÂ­nsula de Grecia en busca de las raÃƒÂ­ces histÃƒÂ³ricas de la Batalla de Troya, del asesinato del Rey AgamenÃƒÂ³n y conozca relatos mitolÃƒÂ³gicos como los orÃƒÂ­genes del Minotauro. Desde las minuciosas reconstrucciones de los pueblos que vivieron durante la edad de oro de los hÃƒÂ©roes de Homero, hasta las asombrosas revelaciones de sacrificios humanos y animales, ÃƒÂ©ste es un deslumbrante viaje para descubrir los orÃƒÂ­genes de la cultura occidental. Un viaje que lo llevarÃƒÂ¡ a las sombras donde la leyenda y la historia se mezclan para revelar el sorprendente &quot;Legado de la AtlÃƒÂ¡ntida&quot;.\n","torrent":{"xt":"urn:btih:e380d5bb0537b7b831efb5c7a9fc62f00bd0bce2","amp;dn":"Egeo.El+legado+de+la+Atlantida.%28civilizaciones+perdidas%29.DVDRIP.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e380d5bb0537b7b831efb5c7a9fc62f00bd0bce2","infoHashBuffer":{"type":"Buffer","data":[227,128,213,187,5,55,183,184,49,239,181,199,169,252,98,240,11,208,188,226]},"announce":[],"urlList":[]}}