{"title":"Indiana Jones and the Temple of Doom: The InfoDroid Edit","uid":4284675,"size":4223218613,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e466de2bbacfee1fca15946c40b33b1afd781985&amp;dn=Indiana+Jones+and+the+Temple+of+Doom%3A+The+InfoDroid+Edit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"A.v.P","files":15,"time":1215616595,"description":"by Infodroid\nWhat is it about? This fanedit brings ToD to a way more consistent feel with Raiders Of The Lost Ark. Superfluous or annoying dialogue was removed as well as misplaced shots and cutting scenes thoughout. The slapstick comedic aspects were considerably toned down.\n\n\ntagline: All the Adventure! Without the Same Old Song and Dance?\n\noriginal film name: Indiana Jones and the Temple of Doom\nnew film name : Indiana Jones and the Temple of Doom: The InfoDroid Edit\nfilm studio name : Paramount Pictures / Lucasfilm, Ltd.\nedit crew name : InfoDroid\nDate Original Film Was Released : 1984\nDate Edit Was Released : June 19, 2008\nOriginal Runtime : 118 minutes\nNew Runtime : 100 minutes\nAmount of time Cut/Added : 18 minutes cut\n\nCuts removed/added/extended : For full list: http://www.faneditforum.com/viewtopic.php?f=17&amp;t=4313 (you need to be registered for the forum)\n\nFanedit details : Features Full Motion Menus &amp; Scene Selection Widescreen Version Enhanced for 16:9 TV?s, Dolby Digital: English 5.1 Surround Sound, No Subtitles\n\nYour intention for this fanedit: My intention was to bring Temple of Doom, which, prior to the release of Kingdom of the Crystal Skull, was the most derided of the Indy Trilogy to a level that was more consistent with the feel of Raiders.\n\nYour way to achieve your intention: I tried to acheive it by:\n\n* -Replacing Kate Capshaw?s song and dance number with a much more mysterious jungle sequence taken from the middle of the film.\n* -Changing the opening credits font to match the other three films\n* -Removing superfluous or annoying dialogue, removing or rearranging misplaced shots and cutting unnecessary scenes thoughout.\n* -And finally, by toning down or eliminating the more slapstick comedic aspects of the story.\n\nThe more controversial changes for this edit include the elimination of the gross-out parts of the cartoon-like ?monkey brains? dinner scene, and the complete erasure of the (in my opinion) way over the top heart-ripping Human sacrifice scene.\n\nHardware and software information : Mainly Sony Vegas 7.0, Cinema Craft Encoder &amp; DVD Lab Pro?in addition to a tangle of various smaller programs for ripping, encoding,\nre-encoding, demuxing, you name it.\n\nAdditional Comment: I included this on the DVD, but I just want to say again publicly that this edit nor any subsequent edit I release would?ve ever been possible had it not been for the technical knowledge and support of forum member TJDavis1138. For the past three years, he has been my teacher and guide in all matters relating to computers and editing and more importantly, he?s become one of my greatest friends during this process. I just can?t thank him enough from the bottom of my heart. You?re the best, Tom!\nI also want to thank both Boon23 and Throwgncpr for their generous and friendly support while I was trying to figure out how to get this thing released. The wealth of knowledge contained within this site has been extremely helpful to me as a first-time faneditor, especially the excellent DVD motion menu tutorial Boon created and the treasure trove of DVD cover resources?great, great stuff and it is very appreciated. This is quite a site you?ve got here?pioneering a new art form. Good job, Guys!\n\nAnd lastly, to everyone who helped distribute this in any small way, whether it be through a torrent, a PIF chain or just word of mouth?I appreciate your contribution and hope you enjoyed my edit as much as I enjoyed making it.\n\nTime needed for the edition: 1 week to edit and 1 week to create the DVD\npersons involved: 1\n\nAdditional information links: http://www.faneditforum.com/viewtopic.php?f=17&amp;t=4313\n\n\nFanedit Community:\n &lt;a href=&quot;\nhttp://www.avpsgallery.fanedit.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.avpsgallery.fanedit.org/index.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.fanedit.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fanedit.org&lt;/a&gt; &lt;a href=&quot;\nhttp://WWW.forum.fanedit.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://WWW.forum.fanedit.org/index.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.originaltrilogy.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.originaltrilogy.com&lt;/a&gt;","torrent":{"xt":"urn:btih:e466de2bbacfee1fca15946c40b33b1afd781985","amp;dn":"Indiana+Jones+and+the+Temple+of+Doom%3A+The+InfoDroid+Edit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e466de2bbacfee1fca15946c40b33b1afd781985","infoHashBuffer":{"type":"Buffer","data":[228,102,222,43,186,207,238,31,202,21,148,108,64,179,59,26,253,120,25,133]},"announce":[],"urlList":[]}}