{"title":"Xandros Desktop V4.1 Home Premium","uid":4846595,"size":1675416823,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:e4c73ba79e6984eb55857db3a3daf04b1f7fd099&amp;dn=Xandros+Desktop+V4.1+Home+Premium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"3ziz","files":119,"time":1239667999,"description":"Xandros Desktop Home Premium is a complete, full-featured Linux desktop operating system and application suite for your Home use. Enjoy the ease of use, security, stability and maintainability that Linux brings to your PCs.\nEasy to use\n\nIt's a familiar Windows-like desktop and application suite that's easy to install, use and maintain-even in mixed Windows/Xandros Linux environments. Many excellent applications are included to support your digital lifestyle at work and play.\nEasy to connect\n\nConnect to your digital camera, MP3 player and other devices. Join wired and wireless networks. Access broadband networks with 3G, GSM and UMTS support. Use PPTP VPN to connect to your office remotely. Authenticate to Windows PDC and Active Directory domains.\nWorks with Microsoft\n\nCreate, open and edit Microsoft Office documents with OpenOffice.org. Dual-boot into either Xandros or Windows on the same PC, and read and write to the same files from either operating system.\nSecure\n\nXandros Security Suite reinforces the already secure Linux platform against threats like viruses, worms, spyware and rootkits and helps prevent the spread of malware to other computers. The included firewall, anti-virus, file-system protector and Xandros Networks Update assess your vulnerabilities and ensure that you have the best and most current protection.","torrent":{"xt":"urn:btih:e4c73ba79e6984eb55857db3a3daf04b1f7fd099","amp;dn":"Xandros+Desktop+V4.1+Home+Premium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c73ba79e6984eb55857db3a3daf04b1f7fd099","infoHashBuffer":{"type":"Buffer","data":[228,199,59,167,158,105,132,235,85,133,125,179,163,218,240,75,31,127,208,153]},"announce":[],"urlList":[]}}