{"title":"Hackers (1995) (PSP, iPod, Zune)","uid":5253380,"size":647648012,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:e62d02e274d916d66c25596e9657ec90edc91392&amp;dn=Hackers+%281995%29+%28PSP%2C+iPod%2C+Zune%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dark_Wrath","files":-1,"time":1262450232,"description":"Summary\n\nIn 1988, Seattle youth Dade &quot;Zero Cool&quot; Murphy (Jonny Lee Miller) is arrested and charged, at the age of 11, with crashing 1,507 systems in one day and causing a single-day 7-point drop in the New York Stock Exchange. Upon conviction, he is banned from owning or operating computers or touch-tone telephones until his 18th birthday.\nShortly before Dade turns 18, his mother (now divorced) takes a new job in New York City. Upon turning 18, Dade calls a local television station, dupes the security guard into giving him the modem's phone number (using a tactic known as social engineering) and successfully hacks into the station's computer network, changing the current tv program to an episode of The Outer Limits. However, Dade is &quot;attacked&quot; by a hacker on the same network, (who goes by the handle &quot;Acid Burn&quot;) and is eventually kicked off. During the conversation, Dade identifies himself by the new alias, Crash Override.\nDade enrolls Stanton High School, where he meets the beautiful Kate Libby (Angelina Jolie), who is responsible for taking him on a tour of the school. After being told of a &quot;pool on the roof&quot; (which results in Dade and several other students being locked on the roof during a rainstorm) and learning that Kate is &quot;Acid Burn&quot; a feud erupts between Dade and Kate. Their eventual hacking duel, which spans most of the film, is judged by Kate and Dade's mutual friends in the hacking community, The Phantom Phreak, Cereal Killer and Lord Nikon.\nThe real trouble erupts when Joey Pardella (Jesse Bradford), the younger, novice hacker of the group, successfully breaks into an oil company supercomputer to prove to the rest of the group that he is an elite hacker. In order to validate this feat, he downloads part of a garbage file. Unfortunately, the company's IT employee Hal (Penn Jillette) detects this unauthorized entry into their systems and summons computer security officer Eugene &quot;The Plague&quot; Belford (Fisher Stevens) to deal with the problem. He realizes that the file that is being downloaded can prove that The Plague is stealing money from the company via salami slicing. The Plague enlists the US Secret Service to recover the file by claiming that it is the code to a computer virus that will capsize the company's oil tanker fleet.\nWhat follows is a frantic race against The Plague and the Secret Service to exonerate the hackers before Belford can unleash the virus causing a worldwide ecological disaster.\n\n\nCAST\n\nHackers was the first major film to star future Academy Award winner Angelina Jolie, and also helped to launch the career of Matthew Lillard. The cast included:\nJonny Lee Miller as Dade Murphy alias Crash Override aka Zero Cool\nAngelina Jolie as Kate Libby alias Acid Burn\nRenoly Santiago as Ram?n SÃƒÂ¡nchez alias The Phantom Phreak\nMatthew Lillard as Emmanuel Goldstein* alias Cereal Killer\nLaurence Mason as Paul Cook alias Lord Nikon*\nJesse Bradford as Joey Pardella\nFisher Stevens as Eugene Belford* alias The Plague\nLorraine Bracco as Margo\nPenn Jillette as Hal\nWendell Pierce as Special Agent Richard Gill, U.S. Secret Service\nMarc Anthony as Special Agent Ray, U.S. Secret Service\nMichael Gaston as Special Agent Bob, U.S. Secret Service\nFelicity Huffman as Prosecuting Attorney\nMax Ligosh as Young Dade Murphy\n\nSorry guys! I'd uploaded the incorrect torrent in Hackers (PSP, iPod, Zune) This is the real one. I'm sorry again that I wasted your time.\n\nP.S.- The video IS a bit distorted in full screen, but if you're gonna view it on your handheld device it's gonna be fine. Enjoy!","torrent":{"xt":"urn:btih:e62d02e274d916d66c25596e9657ec90edc91392","amp;dn":"Hackers+%281995%29+%28PSP%2C+iPod%2C+Zune%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e62d02e274d916d66c25596e9657ec90edc91392","infoHashBuffer":{"type":"Buffer","data":[230,45,2,226,116,217,22,214,108,37,89,110,150,87,236,144,237,201,19,146]},"announce":[],"urlList":[]}}