{"title":"Kellie Pickler - Best Days Of Your Life (Live)","uid":4987910,"size":127778820,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8382757182b23733250a3996287975cbcb0cd29&amp;dn=Kellie+Pickler+-+Best+Days+Of+Your+Life+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1246863336,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nA live performance by Kellie Pickler - Best Days Of Your Life from the 2009 CMT Music Awards Show.\n\n\n&quot;Best Days of Your Life&quot; is the title of a song written and performed by American country artist Kellie Pickler, and co-written by Taylor Swift. It was released on December 1, 2008 as the second single from her self-titled second album.\n\nPickler debuted the song with a performance on November 12, 2008 on the 2008 CMA Awards. Since then she has also performed the song on American Idol, The Ellen DeGeneres Show, and the 2009 CMT Music Awards.\n\n&quot;Best Days of Your Life&quot; is an up-tempo country pop song mostly backed by electric guitar, played by Taylor Swift. Its narrator tells about a former boyfriend who cheated on her and is going to get married and build a family with the lover. Although, she wishes them to be happy and have a nice life, she says that he's already had the best days of his life with her (the narrator), and the new partner can never top it.\n\nShe also feels sorry for his new girlfriend, because she has the concept that a cheater will always be a cheater, and while she is getting the prizes of her future, all the lover gets is the cheater boyfriend.\n\n    'Cause I'll be there, in the back of your mind\n    From the day we met to the very last night\n    And it's just too bad, you've already had the best days\n    The best days of your life\n\nIn an interview, Pickler has said that the circumstances portrayed in the song are based on a real-life experience that she herself went through. Pickler stated that when she was on Brad Paisley's Bonfires &amp; Amplifiers Tour, she discovered her boyfriend cheating, and told it to her friend and fellow country singer Taylor Swift, who had the idea of writing a song about the experience.\n\nKellie Pickler is the self-titled second album of country music artist Kellie Pickler. It was released on September 30, 2008 on BNA Records. The lead-off single, &quot;Don't You Know You're Beautiful&quot;, reached #21 on the Hot Country Songs charts. &quot;Best Days of Your Life&quot; (a song she co-wrote with fellow country singer and best friend Taylor Swift) was released December 1, 2008 as the album's second single.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e8382757182b23733250a3996287975cbcb0cd29","amp;dn":"Kellie+Pickler+-+Best+Days+Of+Your+Life+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8382757182b23733250a3996287975cbcb0cd29","infoHashBuffer":{"type":"Buffer","data":[232,56,39,87,24,43,35,115,50,80,163,153,98,135,151,92,188,176,205,41]},"announce":[],"urlList":[]}}