{"title":"FFCoder 1.1.0.5 Portable","uid":6428931,"size":51909337,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e95f0206380c9f4dc0f7ea65ae9a57d76c801c1f&amp;dn=FFCoder+1.1.0.5+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1306574711,"description":"FFCoder 1.1.0.5 Portable\n\n\nFFCoder is a .NET based audio/video converter, which is capable of transcoding audio and video files to various formats. It is a unified frontend for many freeware utilities such as FFmpeg, MPlayer and MEncoder.\n\nFeatures:\nSupports 16 encoders - ffmpeg, mencoder, ffmpeg2theora, x264, xvid_encraw, avs2avi, lame, faac, NeroAAC, OggEnc, FLAC, OptimFROG, Speex, MusePack and WavPack.\nBatch processing.\nParallel processing (multiple files can be transcoded at same time).\nAdvanced configuration options for all codecs.\nSupports 2-pass encoding with automated first pass.\nEncode video using vfw codecs such as VP6, VP7 and FFDShow (by using avs2avi).\nMeGUI presets can be imported for x264 and xvid encoding.\nSupport for video filters provided by the encoder (such as mencoder's filters)\nInput files can be avisynth scripts or any format supported by ffmpeg.\nFor encoders such as x264_cli which support very few input formats, the video is decoded with ffmpeg and then piped to the encoder.\nTools: Dump audio/video stream to file, create images in JPEG/BMP/PNG/TIFF format, rebuild/cut/join video files, quant matrix editor, etc.\n\nChanges since v0.99\nWebM encoding via FFmpeg\nTarget size encoding mode. It is available for all video codecs that supports 2pass encoding.\nDirectory watch for fully automated encoding. In this mode the program will monitor a set of pre-defined folders for files matching a filename pattern. Files will be automatically picked-up and encoded with pre-defined settings. The encoding will be done in the background with low-priority so that the user can continue with other tasks.\nx264: Options updated, Fixed issues with 2pass encoding, Menu for x264's in-built presets\nAvisynth: New and improved avisynth options\nAvisynth: New editor with syntax highlighting, code folding, GScript support\nAvisynth: Options for testing and comparing avisynth scripts\nBetter support for subtitles, SRT files can be embedded into MKV files using MKVMerge\nProgress window: Improved layout\nProgress window: New option for minimizing FFCoder to the system tray. FFCoder will run in a low-priority mode so that the user can continue doing other tasks while the files are being converted. User will be notified when the jobs are complete.\nProgress window: Progress % will be displayed while encoding audio from AVS input files (it was not displayed in previous version)\nProgress window: More info will be displayed while encoding\nAudio/Video filters: Presets, options for no-upscaling and fit-to-box\nAudio/Video filters: Warnings will be displayed if the codec supports limited frame sizes or frame rates\nTurn off visual styles for the FFCoder gui\nTested on 32-bit versions of XP, Vista and Win7\n\nChanges since v 1.1.0.3\n[New]\nJobs can be added while the encoding is going on, by dragging and dropping files on the progress window\nNew option for reporting errors. Right-click on the failed file and select 'Create Error Report'\nDVD VOBs can be encoded using the &quot;Add DVD&quot; option in the 'File' menu. This option requires avisynth.\nAdded options to the tools menu for configuring FFDShow\n\n[Changes]\nAdded H261, H263, H263p codecs to 3GP and 3G2 file formats\nAdded MJPEG codec to MOV file format\nAdded AMR codec to 3GP and 3G2 file formats\n\n[Fixes]\nFFmpeg: Encoding fails if the Aspect option is set in the video filters window\nMencoder: If input file has fractional fps then output fps must be explicitly set, otherwise the encoding will fail. The output fps will be set automatically in order to avoid this issue.\nTrack order was incorrectly detected in some VOB files causing the encoding to fail.\nThe temp folder was always deleted on application exit irrespective of whether the 'DeleteFiles' option was checked on the options window.\nThe NoUpscaling checkbox on the video filters windows was disabled for some presets, and displayed incorrect tooltip messages in some cases\nThe following presets were selecting the wrong audio/video codecs\nCreative_Zen_2_16GB_avi\nCreative_Zen_Vision_W_avi\nHumax_Icord_hd+\nHyundai_M121_3gp\nMotorola_Moto_Q_9h_3gp\nMotorola_Moto_Q_gsm_3gp\nNintendo_Wii_avi\nNintendo_Wii_mov\nNokia_3230_3gp\nSamsung_Mobil_S3550_3gp\nSamsung_Mobil_S5350_3gp\nSamsung_Mobil_S5550_3gp\nSamsung_TV_Series_6_ts\nSamsung_TV_Series_7_ts\nSony_TV_Bravia_H264\nSony_TV_Bravia_mpeg2\nSony_Ericsson_W910i_3gp\nHyundai_M121_3gp\nMotorola_V547\nMotorola_V635\nMotorola_V710\nNokia_6230_3gp\nNokia_6620_3gp\nNokia_6630_3gp\nNokia_E70_3gp\nNokia_N70_3gp\nNokia_N71_3gp\nNokia_N72_3gp\nNokia_N80_3gp\nSamsung_Mobil_D500_3gp\nSamsung_Mobil_SGH_D500_3gp\nSony_Ericsson_F305_3gp\nSony_Ericsson_K700i_3gp\nSony_Ericsson_V630i_3gp\nSony_Ericsson_W20i_3gp\nSony_Ericsson_W580i_3gp\n\nNote: Latest XviD, x264, Nero AAC Encoder and AviSynth are embedded in this portable.\n\nHome Page - http://www.videohelp.com/tools/FFCoder\n\n\n","torrent":{"xt":"urn:btih:e95f0206380c9f4dc0f7ea65ae9a57d76c801c1f","amp;dn":"FFCoder+1.1.0.5+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e95f0206380c9f4dc0f7ea65ae9a57d76c801c1f","infoHashBuffer":{"type":"Buffer","data":[233,95,2,6,56,12,159,77,192,247,234,101,174,154,87,215,108,128,28,31]},"announce":[],"urlList":[]}}