{"title":"Tears of the Sun (2003) (Multi Subs) TBS","uid":6471939,"size":4660151572,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ebf1440b25154ee4e1474be96983a95a420b6ad2&amp;dn=Tears+of+the+Sun+%282003%29+%28Multi+Subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Marjanb","files":-1,"time":1308172084,"description":"Tears of the Sun (2003) \n\n\nVerenigde Staten\nDrama / Oorlog\n121 minuten / 142 minuten (director's cut)\n\ngeregisseerd door Antoine Fuqua\nmet Bruce Willis, Monica Bellucci en Cole Hauser\n\nSpecial Navy Commander Waters (Bruce Willis) heeft met zijn team een uiterst riskante missie te volbrengen in de jungle van Nigeria. Het lot van de Amerikaanse dokter Lena Kendricks, werkzaam bij Artsen Zonder Grenzen, aldaar ligt in hun handen wanneer het land verstrikt raakt in een bloederige burgeroorlog. De mooie Dr. Kendricks weigert echter de vluchtelingen achter te laten en is alleen bereid het gebied te verlaten wanneer Waters en zijn mannen &quot;haar mensen&quot; naar een veilige plaats dichtbij de grens brengen. Ondanks de orders om zich niet te mengen in het conflict, besluit hij toch het leven van hem en zijn team te riskeren om de vluchtelingen in veiligheid te brengen. Dit leidt tot een lange en gevaarlijke tocht door de dichte jungle.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/8078&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/8078&lt;/a&gt;\n\n\n\nStoryline\n\nNavy SEAL Lieutenant A.K. Waters and his elite squadron of tactical specialists are forced to choose between their duty and their humanity, between following orders by ignoring the conflict that surrounds them, or finding the courage to follow their conscience and protect a group of innocent refugees. When the democratic government of Nigeria collapses and the country is taken over by a ruthless military dictator, Waters, a fiercely loyal and hardened veteran is dispatched on a routine mission to retrieve a Doctors Without Borders physician, Dr. Lena Kendricks. Dr. Kendricks, an American citizen by marriage, is tending to the victims of the ongoing civil war at a Catholic mission in a remote village. When Waters arrives, however, Dr. Kendricks refuses to leave unless he promises to help deliver the villagers to political asylum at the nearby border. If they are left behind, they will be at the mercy of the enormous rebel army...\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0314353/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0314353/&lt;/a&gt;\n\n\nFile Format: Video ISO bestand Pal\nFile size: 4 .35 GB\nLanguage:  English  5.1\nSubtitles; English  French  Dutch  Arabic  Polish  Greek Romanian Spanish  (selectable)\nCategory : Movie\nDVD5 : DVD \nSource : Retail\nMenu: Yes \nExtra: Yes\nCover Yes\nGenre : Drama / Oorlog\n\nEnjoy The Movie[/center]\n\n\n","torrent":{"xt":"urn:btih:ebf1440b25154ee4e1474be96983a95a420b6ad2","amp;dn":"Tears+of+the+Sun+%282003%29+%28Multi+Subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf1440b25154ee4e1474be96983a95a420b6ad2","infoHashBuffer":{"type":"Buffer","data":[235,241,68,11,37,21,78,228,225,71,75,233,105,131,169,90,66,11,106,210]},"announce":[],"urlList":[]}}