{"title":"Ninos con sexto sentido.(DSRip.Divx.Spanish).","uid":4789255,"size":365682688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ec5a7c168d3a2f1daaa718fd72449a95358a8e91&amp;dn=Ninos+con+sexto+sentido.%28DSRip.Divx.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cholo24","files":1,"time":1237657740,"description":"NiÃƒÂ±os con sexto sentido\n\n      En este apasionante espacio nos introduciremos de lleno en el mundo de los ninyos con poderes psiquicos y de los gemelos que tambien comparten ese don. La medium Debbie Martin de Phoenix no es el unico miembro de su familia que ve a los muertos. Su hijo Brad de 15 anyos a menudo ve los mismos espiritus que ella. Incluso su hija Alison, de tan solo 3 anyos de edad, ve imagenes y habla con personas que no existen, pero que, segun ella, se encuentran en la habitacion. Por su parte, Linda y Terry Jamison, ya adultos, son la unica pareja de gemelos identicos del mundo con poderes psiquicos. Linda y Terry predijeron la muerte en accidente de avion de John F. Kennedy Jr., dos anyos antes de que ocurriera. Asimismo, predijeron los sucesos del 11 de septiembre con escalofriante exactitud en un programa de radio nacional el 2 de noviembre de 1999. Los dos estan tan sintonizados entre ellos que, segun se dice, son &quot;un solo espiritu en dos cuerpos&quot;. Han tenido las mismas enfermedades desde que nacieron: cuando uno tiene dolor de muelas, el otro tambien. Durante el programa contaremos con la experta opinion de la Dra. Athena Drewes, una psicologa infantil que trabaja habitualmente con ninyos con poderes psiquicos. Asimismo, visitaremos uno de los numerosos talleres donde se trabaja con esta clase de ninyos y se les ensenya a desarrollar su don. En definitiva, el espacio ofrece una nueva perspectiva del fenomeno de las personas con poderes psiquicos, profundizando en el poco conocido mundo de los ninyos con un sexto sentido.\n","torrent":{"xt":"urn:btih:ec5a7c168d3a2f1daaa718fd72449a95358a8e91","amp;dn":"Ninos+con+sexto+sentido.%28DSRip.Divx.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec5a7c168d3a2f1daaa718fd72449a95358a8e91","infoHashBuffer":{"type":"Buffer","data":[236,90,124,22,141,58,47,29,170,167,24,253,114,68,154,149,53,138,142,145]},"announce":[],"urlList":[]}}