{"title":"U2 - 1981-12-13, Malibu, Lido Beach, NY US (FM - M Reel-To-Reel)","uid":9344264,"size":451609453,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ee97c3e216254c97ca697a76fea4ee25f384e5dd&amp;dn=U2+-+1981-12-13%2C+Malibu%2C+Lido+Beach%2C+NY+US+%28FM+-+M+Reel-To-Reel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thewaymouth","files":-1,"time":1386999725,"description":"U2\nOctober Tour\n\nWLIR-FM\nMalibu Night Club\nLido Beach, NY, US\n1981-12-13\n(Complete Show)\n[partially booted as &quot;I8B4IFlew&quot;]\n\nLineage: FM - &gt; Reel to Reel -&gt; Sound Forge -&gt; CD Architect -&gt; Cdr -&gt; Nero 6.6 track splitup and FLAC encoding\n\n- files as found @ DIME c/o Doinker\n\n- text, dedication &amp; cover images incl\n_______________________________________\n\nSetlist\n\n01 Gloria\n02 Another Time, Another Place\n03 I Threw A Brick Through A Window\n04 Rejoice\n05 With A Shout\n06 The Cry/ The Electric Co./ Send In The Clowns\n07 I Fall Down\n08 October\n09 I Will Follow\n10 An Cat Dubh/ Into The Heart\n11 Out Of Control\n[Encores]\n12 Twilight\n13 11 O'Clock Tick Tock\n14 The Ocean\n_________________\n\nSTOP RIGHT THERE! \n\nBefore you glance and move on, I need to tell you something: \n\nThis is one of the *FINEST* U2 shows ever performed, period! \n\nI say that with absolutely no fear of contradiction. I am SO glad that the U2 ban has been lifted, so I can bring you this great show. When this show was recorded, U2 was a little-known import band from Ireland. They had recently performed in front of an audience of only 12 people, if that means anything. They were announced previously on another night as being from England. They were young, hot, and ready to go, and it shows in the performance they gave. I am dumbfounded that no one has ever put this concert out commercially. It tops &quot;Live at Red Rocks&quot; by a mile. \n\nBy the time this show was recorded, the band had lost their early hysterics and had settled down to a high-intensity, shimmering groove. They had started the &quot;October&quot; tour in October, and already had several shows under their belts before performing at the Malibu Night Club in December. The show was picked up by WLIR-FM and was widely broadcast as part of their home-grown &quot;In Concert&quot; series. \n\nEnjoy!\nA DoinkerTape\n_____________\n\n_________________________________________________________________\n\nToday's share out there from this day in pop history...Celebrate!\n\n2013-12-13, thewaymouth dedicates this day to The Pirate Bay\n\nFrozen loggers, bloggers and floggers are everywhere up in can't get there from here this time of year in New England. So how cold is it up in Boston today? It's so cold I can hear my dead dad crying on the wind for a blanket. But all he's gonna get for cover this early X-mas is a blanket of snow. ...Yeah, like there is a God the Father; if so, then he can get in line behind Winter and Death to kiss my hot gas ass.\n\nDECEMBER 13\n\nST. LUCY'S DAY: In Scandinavia, a day for boisterous winter fun, first sleigh rides of the season. Singing must be loud enough to frighten off the gnomes.\nLoaves of ceremonial bread are baked in shape of cats (echo of pre-Christian sacrifices to earth powers) formerly a procession followed a cow with candles on her horns. In Hungary, witches ride broomsticks &amp; boys &amp; girls pull all the pranks they can get away with.\n\n1916 -- Avalanche kills 10,000 Austrian &amp; Italian troops in 24 hrs in Tyrol.\n1971 -- US: White Panther Party founder, author &amp; music critic, John Sinclair (sentenced to 10 years in jail for selling two marijuana joints) is freed.\n1975 -- Richard Pryor hosts new TV show, &quot;Saturday Night Live.&quot;\n1982 -- United Nations adopts Nuclear Freeze resolution.\n2010 -- BodyBag?: WikiLeaks reveals US diplomats broke laws by sending uranium on a commercial flight. The State Department Foreign Affairs Manual explicitly forbids radioactive substances from being sent in a diplomatic bag.\n1509 -- TODAY'S FLASHBAG... England: The first book in Roman type in Britain is published, 'Ship of Fools'\n1981 -- U2 in Malibu (with you in FM reel-to-real)\n\n&quot;If I had anything, anything at all I give it 2U&quot;","torrent":{"xt":"urn:btih:ee97c3e216254c97ca697a76fea4ee25f384e5dd","amp;dn":"U2+-+1981-12-13%2C+Malibu%2C+Lido+Beach%2C+NY+US+%28FM+-+M+Reel-To-Reel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee97c3e216254c97ca697a76fea4ee25f384e5dd","infoHashBuffer":{"type":"Buffer","data":[238,151,195,226,22,37,76,151,202,105,122,118,254,164,238,37,243,132,229,221]},"announce":[],"urlList":[]}}