{"title":"HISTORY OF POP AND ROCK MUSIC - part 396","uid":7428868,"size":434112374,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f2bb8e827acac72f2a2fc2197d7c714f016bb0f9&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+396&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1341884022,"description":"      \n\n\n                      PART  396\n\n\n\n\n           PINK FLOYD  - Comfortably Numb  (2005)\n           THE SCISSOR SISTERS  - Comfortably Numb  (2004) \n\n\n\n\n\n      &quot;Comfortably Numb&quot; is a song by Pink Floyd, which first appears on the 1979 double album, &quot;The Wall&quot;. It was also released as a single in the same year with &quot;Hey You&quot; as the B-side. It is one of only three songs on the album for which writing credits are shared between Roger Waters and David Gilmour. The melody and most of the music was written by Gilmour while Waters contributed the lyrics and some additional notes. The song had the working title of &quot;The Doctor&quot; The song is one of the most famous Pink Floyd songs and renowned especially for its guitar solos. In 2004, the song was ranked number 314 on Rolling Stone magazine's list of the 500 Greatest Songs of All Time. In 2005, it was the last song ever to be performed by Waters, Gilmour, Wright, and Mason together. In 2011, the song was ranked 5th in the BBC Radio 4's listeners' Desert Island Discs choices.\n      \n      The Scissor Sisters recorded a radically re-arranged disco-oriented version released in January 2004. This release reached number 10 in the UK Singles Chart, becoming the most successful cover of a Pink Floyd song to date in the UK. David Gilmour and Nick Mason expressed a liking for the group's version and Roger Waters is said to have congratulated the Scissor Sisters on the version, although a lyric was changed, from &quot;a distant ship's smoke on the horizon&quot; to &quot;a distant ship floats on the horizon&quot;. Jake Shears, the band's lead singer, was invited by Gilmour to sing &quot;Comfortably Numb&quot; with him in some 2006 shows, but the idea was dropped at the last moment to Shears' public disappointment. This cover received a Grammy nomination for Best Dance Recording, but lost to &quot;Toxic&quot; by Britney Spears.","torrent":{"xt":"urn:btih:f2bb8e827acac72f2a2fc2197d7c714f016bb0f9","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+396","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bb8e827acac72f2a2fc2197d7c714f016bb0f9","infoHashBuffer":{"type":"Buffer","data":[242,187,142,130,122,202,199,47,42,47,194,25,125,124,113,79,1,107,176,249]},"announce":[],"urlList":[]}}