{"title":"Windows.XP.SP2.x86.Hotfix.Updater.December.2007","uid":3954694,"size":217293239,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f37c9dee61b5b83e6018b9037a0b9bbfc29e8177&amp;dn=Windows.XP.SP2.x86.Hotfix.Updater.December.2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eqphate","files":5,"time":1199073771,"description":"Windows XP Post SP2 Updater (x86) - by eXPerience\n\nWith this &quot;Windows XP Post SP2 Updater&quot; you can update Windows XP SP2\nHome Edition, Professional Edition or Media Center Edition (x86 only)\nwithout the need to visit Windows Update.\n\n-=REQUIREMENTS=-\n\n*Windows XP SP2*\nYou must be using Windows XP with SP2. DO NOT RUN THIS PACKAGE FOR ANY OTHER\nVERSION OF WINDOWS! Home/Professional/MCE are all fine as long as it is\nWindows XP with Service Pack 2 installed.\n\n*32-Bit (x86) ONLY*\nWindows XP must be the 32-Bit (also known as the &quot;x86&quot; version) NOT FOR x64!\n\n*ENGLISH ONLY*\nWindows XP must be the ENGLISH Version! Only English Hotfixes are supported!\n\n-=YOU HAVE TWO BASIC CHOICES=-\n\n*DOWNLOAD*\nRun the DOWNLOAD.bat file to *JUST* download all hotfixes, without actually\ninstalling any of them. This DOWNLOAD file downloads every hotfix that could\npossibly be needed, regardless of whether your system needs them or not. This\nis so you can have a fully updated package of hotfixes (if you are running\nWindows XP: see the &quot;XPHF&quot; folder. If you are running Windows Server 2003:\nsee the &quot;S2003HF&quot; folder) for future use on other systems that might be offline.\nIf you want to burn this package to a CD-R or DVD-R, please make certain that\nyou have run the DOWNLOAD.bat file first! Otherwise the INSTALL file will not\nwork from a CD/DVD because it would be trying to download missing hotfixes\n(if any) to a read only environment (the CD/DVD).\n\n*INSTALL*\nRun the INSTALL.bat file to download AND install only the hotfixes your system\nneeds. Remember, this will NOT download every single hotfix like the DOWNLOAD.bat\nfile does. Only the other file (DOWNLOAD.bat) can download all the hotfixes.\n\n-=AUTOMATICALLY CHECKS FOR CORRUPTED DOWNLOADS=-\n\nWhen you run the DOWNLOAD.bat file and it has completely downloadd all the files,\na small program will run to check the file integrity (in case there is a corrupt\nor incomplete download).\n\nThis check is done automatically at the end of the download process (DOWNLOAD.bat)\n\nIf you see any messages at the bottom of the SFV Checker Window saying:\n\n&quot;MISSING&quot; = Re-run the DOWNLOAD.bat file to re-download the missing file(s)\n\n&quot;BAD&quot; = This means you have the file, but it is corrupted or incomplete, if\nthis happens - delete that &quot;BAD&quot; file and run DOWNLOAD.bat again.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nRemember - you cannot just run the INSTALL.bat file from a CD unless you have\nfirst ran the DOWNLOAD.bat file on a hard drive to actually get all the hotfixes\nyou need. Its no use wasting a CD-R and burning these hotfixes unless you know you\nhave a complete set of fully completed downloaded hotfixes. Be warned, WGET does\nsometimes fail to completely download files - this is why I have included the\nfile checker, but that runs on its own at the end of the DOWNLOAD.bat file\nautomatically, so you do not need to do anything with that SFV Checker, apart\nfrom just to make sure there are no &quot;MISSING&quot; or &quot;BAD&quot; files when it has checked\nthe files for you.\n\nOnce you have downloaded all hotfixes and verified that they are all good files,\nyou can run the INSTALL.bat file on any system, whether it is online or offline,\nor you can even burn the package to a CD-R and use the INSTALL.bat file that way.\n\nNOTE: You cannot run the Windows XP bat files on Windows Server 2003 and you cannot\nrun the Windows Server 2003 bat files on Windows XP!\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nThis package is especially useful if you have a system that you absolutely do not\nwant to connect to the internet before Windows is fully patched, or maybe you have\na system with Windows on it that you simply never connect to the internet with, or\nperhaps you can&amp;#039;t connect to the internet and never need to. There are many\nsituations where an &quot;offline&quot; updater package such as this will save you a lot\nof manually installing all the hotfixes, of course thats after you have also\nspent hours finding out which ones you need and downloading them all, link\nafter link after link...\n\nWhat this package includes:\n\nThis package is purposely kept as minimalistic as possible.\n\nThe only things this package contains are:\n\n1) cSFV.exe ----------&gt; (to check the integrity of your downloaded hotfixes)\n2) taskkill.exe ------&gt; (required for Windows XP Home Edition)\n3) WGET.exe ----------&gt; (used by the bat files for downloading on the command line).\n4) Two batch files ---&gt; (DOWNLOAD.bat, INSTALL.bat)\n5) This ReadMe.txt file.\n\nThe only files you ever need to run are &quot;INSTALL.bat&quot; or &quot;DOWNLOAD.bat&quot;\n\nThe way this works is, you can install Windows that does not have any hotfixes\ninstalled (the only hotfix would be Service Pack 2 itself of course), you don&amp;#039;t\nneed to have Internet Explorer 7 either, just run the &quot;INSTALL.bat&quot; file and\nthats it - the bat file will check which hotfixes you need and download and\ninstall only those that you need. If you need Internet Explorer 7 installing,\nit will even check for Internet Explorer 7 and download and install it if you\nneed it.\n\nThe INSTALL.bat file will always install IE7 first if you need it installing,\n(also Windows Media Player 11 if you&amp;#039;re running Windows XP) then all the other\nhotfixes will install, including checks for if you have installed any of the\ncomponents from &quot;Add/Remove Windows Components&quot; and also if you have installed\nthe &quot;Microsoft .NET Framework&quot; (all versions). Those items may also need\nhotfixes of their own.\n\nNOTE: If you do need Internet Explorer 7, on the first run of the INSTALL.bat\nfile it will download IE7 hotfixes but it will not install them, you will need\nto reboot Windows so that Internet Explorer 7 is fully working, then run the\nINSTALL.bat file again and it will install the already downloaded IE7 hotfixes.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nIf your firewall asks to allow wget.exe to connect - allow it.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\n-=HERE IS A HELP GUIDE OF FREQUENTLY ASKED QUESTIONS=-\n\nQuestion: I ran &quot;INSTALL.bat&quot; but it just scrolled\nthrough really fast and nothing seemed to install?\n\nAnswer: Thats because you already have everything\ndownloaded and your system is totally up to date!\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: I ran &quot;DOWNLOAD.bat&quot; but it just scrolled\nthrough really fast and nothing seemed to download?\n\nAnswer: Thats because you already have everything downloaded!\nYou will know this if the SFV check runs at the end of the\ndownload process and you do not see any &quot;MISSING&quot; or &quot;BAD&quot;\nerror messages at the bottom of the SFV Checker window.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: I already have a lot of Windows hotfixes, can I just dump\nthem all inside the hotfix folder to save having to download them all?\n\nAnswer: You sure can! If you already have Windows hotfixes just copy\nthem to the folder where all the hotfixes are and then run DOWNLOAD.bat,\nonly the missing hotfixes will be downloaded and whatever hotfixes you\nput there will be ignored by the DOWNLOAD.bat file.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: What is WGET?\n\nAnswer: Its the Windows version of a Linux based app called &quot;wget.exe&quot; that\ndownloads all the hotfixes on the command line. Allow it in your firewall\nif your firewall asks! MD5 for wget.exe = 4bf24777ec95dcb3e03769def6816518\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: When I ran INSTALL.bat, I got an error saying the hotfix is &quot;not a\nvalid Win32 application&quot; and it wouldn&amp;#039;t install?\n\nAnswer: This happens if your connection drops whilst the hotfix is downloading,\nor if you close DOWNLOAD.bat or INSTALL.bat whilst they are still downloading\nfiles. Please read this guide again where it has the heading:\n-=AUTOMATICALLY CHECKS FOR CORRUPTED DOWNLOADS=-\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: I ran the INSTALL.bat file after downloading all hotfixes with the\nother file (DOWNLOAD.bat) and it did the SFV check, everything is all OK, but\nthe INSTALL.bat file did not install any Internet Explorer 7 hotfixes?\n\nAnswer: This is because you need to reboot for IE7 itself to be fully working\nif you have gone from IE6 to IE7. So if you have a system that only has IE6\non it, just run the INSTALL.bat file (or the DOWNLOAD.bat file if you need\nto get the hotfixes downloaded first), then reboot, then run the INSTALL.bat\nfile again and the IE7 hotfixes will install.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: I ran the INSTALL.bat file, downloaded and installed all updates. Now\na few hours/days later I visit Windows Update and it says I require the hotfix\nKB917537 even though this hotfix is in the folder of hotfixes and also, I have\nrun the INSTALL.bat file again, but Windows Update says I still need KB917537,\nwhats going on?\n\nAnswer: This happens if you install KB917537 then after that, you install the\noptional component &quot;Internet Information Services (IIS)&quot; from: Control Panel &gt;\nAdd/Remove Programs &gt; Add/Remove Windows Components. You should always make\nsure to install any of those optional components from &quot;Add/Remove Windows\nComponents&quot; BEFORE updating Windows with these bat files. The only solution\nto this problem is to manually re-install the KB917537 hotfix from the hotfix\nfolder *IF* you have installed Internet Information Services (IIS).\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: I am running a non-genuine version of Windows XP?\n\nAnswer: Naughty. You do realise this package TOTALLY 100% patches XP? Yes that\nincludes the dreaded tray notifications (only dreaded if you&amp;#039;re running a non\ngenuine copy) and all the WGA stuff! If you&amp;#039;re running a non genuine copy of\nWindows, sorry I can&amp;#039;t help you. I suggest if you have to use a pirated copy\nof XP then look for the one called &quot;Student Edition&quot; which has a generic\nproduct key thousands of people use but it is meant for students so there\nis no activation and it passes all the Windows Genuine Advantage checks.\nNOTE: If you are running Windows Server 2003 then there are no WGA checks\nor hotfixes to worry about.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nQuestion: What about the future?\n\nAnswer: When it gets to the next month (Microsoft releases hotfixes on one\ncertain day only, each month - this is informally called &quot;Patch Tuesday&quot;\nand is the second Tuesday of each month.\n\nSo, I will always provide an updated package each month ASAP after Patch\nTuesday. This will be made so you simply unzip the new package into the\nsame folder as your old package - this way, you will get brand new updated\nfiles - &quot;DOWNLOAD.bat&quot; and &quot;INSTALL.bat&quot;.\n\n---------------------------------------------------------------------------------------------------------------------------------\n\nUPDATING WINDOWS HAS NEVER BEEN SO EASY!\n\nDOWNLOAD.bat and INSTALL.bat written by eXPerience:\nindex.php\n\nWGET.exe for Windows distributed under the GNU agreement: &lt;a href=&quot;\nhttp://pages.interlog.com/~tcharron/wgetwin.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pages.interlog.com/~tcharron/wgetwin.html&lt;/a&gt;\n\ncSFV by Cruzer: &lt;a href=&quot;\nhttp://cruzer.antispam.dk/csfv/download.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cruzer.antispam.dk/csfv/download.php&lt;/a&gt;","torrent":{"xt":"urn:btih:f37c9dee61b5b83e6018b9037a0b9bbfc29e8177","amp;dn":"Windows.XP.SP2.x86.Hotfix.Updater.December.2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37c9dee61b5b83e6018b9037a0b9bbfc29e8177","infoHashBuffer":{"type":"Buffer","data":[243,124,157,238,97,181,184,62,96,24,185,3,122,11,155,191,194,158,129,119]},"announce":[],"urlList":[]}}