{"title":"Transporter3 DvDRip {romanian xsubs]","uid":4945413,"size":736368050,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f47ef665f13925c6427eedadf8d0c35fc416c498&amp;dn=Transporter3+DvDRip+%7Bromanian+xsubs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"novactavy","files":1,"time":1244595235,"description":"Frank Martin (Jason Statham) and Inspector Tarconi (FranÃƒÂ§ois BerlÃƒÂ©and) enjoy a boring day of fishing in the ocean. They are at the spot that Tarconi used to fish with his father, and is surprised that they havent had any bites yet. Eventually, Tarconi gets a bite and Frank gets all excited, telling him to fight for the fish. Elsewhere, Malcolm gets to another police checkpoint and shows his papers to a cop. However, the cop tells Malcolm to get out of the car and bring his papers inside so that they can inspect it. He also tells him that the woman in the back needs to come inside as well. Malcolm looks nervous, and then he winds up speeding past the checkpoint. The cops chase Malcolm through the streets, but wind up crashing into a van. Tarconi, after losing the fish, gets the call about the chase and is surprised that Frank was not the driver. He tells Frank that hes going to have to cut their fishing day short, and they depart just as Frank gets a bite. At the airport, Johnson (Robert Knepper) and his men arrive in a private jet. When asked what his purpose is in the country, Johnson says that hes there for environmental protection. During this time we see Minister Leonid Vasilev (Jeroen Krabbe) talking with reporters about his plan to help save the environment. Vasilev goes into his office and finds a confidential envelope waiting on his desk. The envelope starts to ring, and he finds a cell phone inside. Johnson is on the other end of the line, and is watching Vasilev from across the street. Johnson works for a company that Vasilev refused to do business with, since they would cause harm to the environment. Johnson has been hired to convince him to reconsider, and tells him to look at the picture inside the envelope. Vasilev is shocked by what he sees, and Johnson tells him that hell be in contact with him.","torrent":{"xt":"urn:btih:f47ef665f13925c6427eedadf8d0c35fc416c498","amp;dn":"Transporter3+DvDRip+%7Bromanian+xsubs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f47ef665f13925c6427eedadf8d0c35fc416c498","infoHashBuffer":{"type":"Buffer","data":[244,126,246,101,241,57,37,198,66,126,237,173,248,208,195,95,196,22,196,152]},"announce":[],"urlList":[]}}