{"title":"THE_BEACH_BOYS_AND_SATAN_DVDRip.avi","uid":4704003,"size":745019818,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5e1eb99acdef0733581f0a73e9b7e4949aaa0a5&amp;dn=THE_BEACH_BOYS_AND_SATAN_DVDRip.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"st2580smile","files":1,"time":1233804450,"description":"The Beach Boys and Satan is a documentary film made as part of the Pop Odyssee series and directed by music documentary specialist Christoph Dreher. This documentary, in addition to placing The Beach Boys rise to success into context with rarely seen footage of the band, exposes California's darker side and investigates the connections between some of the most controversial characters of that period (Anton La Vey, Kenneth Anger, and Brian Wilson) and their connection to the Manson Family. The film includes interviews with Kim Fowley, Don Was and the creative force behind the Beach Boys, Brian Wilson. There are also archive clips surrounding the trial of Charles Manson and various members of The Family The film which was originally released in 1997 has been unavailable for some time and this release on DVD will be highly anticipated.\n\nGerman Christoph Dreher, decided to give this 57 minute documentary this title - or why the video company chose the packaging., but this is a hidden gem of a documentary on Brian Wilson and his music and a must for Wilson fans. \n\nIncludes the deleted An American Band &quot;Surf's Up&quot; performance of Brian solo at the piano circa 1966.\n","torrent":{"xt":"urn:btih:f5e1eb99acdef0733581f0a73e9b7e4949aaa0a5","amp;dn":"THE_BEACH_BOYS_AND_SATAN_DVDRip.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e1eb99acdef0733581f0a73e9b7e4949aaa0a5","infoHashBuffer":{"type":"Buffer","data":[245,225,235,153,172,222,240,115,53,129,240,167,62,155,126,73,73,170,160,165]},"announce":[],"urlList":[]}}