{"title":"OpoSoft All To iPad Converter v5.0","uid":5632005,"size":15802006,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f6e0a7859afd2be7668a599d162411c969c294da&amp;dn=OpoSoft+All+To+iPad+Converter+v5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lemming229","files":2,"time":1276721415,"description":"All To iPad Converter is professional iPad video Converter which helps you convert almost all popular video formats to iPad and watch them wherever and whenever you want. All To iPad Converter is very easy to use without any special setting, only a few clicks complete the task of video conversion.\nAll To iPad Converter offers a powerful way to converting almost all popular video such as AVI, DivX, XviD, MPEG, MPG, MPE, M1V, M2V, DAT, WMV, ASF, RM, RMVB, OGM, MP4, FLV, 3GP, MKV, VOB ,MOV to iPad video format (MP4, H.264 AVC) .\n\nAll To iPad Converter provides you a wide variety of video editing functions such as video crop, movie trimming and video effect adjustment. It also lets you set encoding parameters including resolution, bit rate, frame rate, aspect ratio, brightness, contrast, saturation to get the best video quality. The interface of All To iPad Converter has been designed to be user-friendly and can be easily operated by anyone. All a user needs to do is click on the menu and all the options of the program are available to you. All conversions can be done easily and smoothly.\n\nFeatures\n\nProfessional iPad Video Converter\nConvert video to iPad\nConvert all kinds of video formats, including MOV, M2TS, OGM, RMVB, RM, WMV, QT, FLV, MOD, TS, TP, Divx, AVI, WMV, ASF, VOB, MP4, MPEG-1, MPEG-2, FLV, SWF, MOV, 3GP, 3G2 etc. to iPad, iPod, iPhone, Apple TV and other portable video device, MP4 players.\n\nHigh-Definition video converter\nServed as a high-definition video converter, allows you to convert AVCHD (*.M2TS, *.MTS, *.TOD), HD MKV, HD H.264/MPEG-4 AVC, HD MPEG-2, HD MPEG Transport Stream (*.TS, *.TP, *.M2T) and other high-definition video formats.\n\nConvert video to video or audio formats\nConvert video including high definition video, and extract audio from video to audio formats.\n\nBatch video adding and converting\nBatch add video files in different folders easily with a folder selection dialog. Batch convert video files to output profile you specified and auto shutdown after encoding is also available.\n\nPreview and Snapshot\nTake snapshot from playing video and save as .PNG picture format, create your own picture collections from movies.\n\nPowerful Video Editing functions and Settings\nTrim movie length\nTrim your favorite video segment by setting the Start time and End time to convert.\n\nCrop video region\nCrop frame size simply and fast to remove any unwanted area in the frame.\n\nAdjust video effects\nWant to make your movie special? Just adjust the frame brightness, saturation and contrast.\n\nAspect ratio\nFill the margin of the video with black(automatically by the converter or operate by yourself) or stretch aspect ratio of video pane. Support various output aspect ratios such as 16:9, 4:3, and full screen.\n\nCustomize Output Audio and Video Formats\nAfter choosing output file formats, you can also choose audio quality, video quality and other file parameters before converting.\n\nEasier operation and better quality\nEasy-to-use\nJust a few clicks to convert video.\n\nFast speed and high video quality\nWith professional video encoding and decoding technique, brings you the advanced and high speed converting process. ","torrent":{"xt":"urn:btih:f6e0a7859afd2be7668a599d162411c969c294da","amp;dn":"OpoSoft+All+To+iPad+Converter+v5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6e0a7859afd2be7668a599d162411c969c294da","infoHashBuffer":{"type":"Buffer","data":[246,224,167,133,154,253,43,231,102,138,89,157,22,36,17,201,105,194,148,218]},"announce":[],"urlList":[]}}