{"title":"Portable GOTSent - MKV/h264 to 360 Converter","uid":6135301,"size":17386377,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:f765ec62f8bf542ab3a21da4e28b3f8464c8c019&amp;dn=Portable+GOTSent+-+MKV%2Fh264+to+360+Converter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"charincol","files":2,"time":1296287698,"description":"Are you sick and tired of trying to figure out how to convert .mkv files with h264 video into a file compatible with your XBOX 360, or getting a 3rd party streaming video application to work? If you want to watch 720p or 1080p HD h264 videos in an MKV container on your 360 then this is probably for you.\n\nI have created a ThinApp package that includes all the software needed for GOTSent to convert it painlessly - AC3Filter, Haali Media Splitter (for mkv support), and NERO AAC encoders.\n\nThis package has only one function: To convert an mkv container file with h264 video and ac3/mp3 audio, into an mp4 container file with h264 video and aac audio which is compatible with the XBOX 360.\n\nThere is no actual video re-encoding, only audio re-encoding, because the h264 video codec only needs to be transferred to an mp4 container. Conversion is extremely fast. I have a Core2Duo 3.0 GHz E8400 with 4 GBs of RAM, and conversion of a 558 MB video file takes 1:23 on my machine (that's 1 minute and 23 seconds).\n\nThe use of the application is about as easy as it gets. Choose the file to convert, choose the output directory, and click Convert. None of the other options are necessary. During the process, if you see the application title bar show (Not Responding), ignore it, nothing is wrong, let it finish.\n\nI built this in a Windows XP SP2 virtual machine and tested it on Windows 7 x64. Sorry if it doesn't work for you.\n\nThe file is in 7z format so you will need 7-zip to extract it.","torrent":{"xt":"urn:btih:f765ec62f8bf542ab3a21da4e28b3f8464c8c019","amp;dn":"Portable+GOTSent+-+MKV%2Fh264+to+360+Converter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f765ec62f8bf542ab3a21da4e28b3f8464c8c019","infoHashBuffer":{"type":"Buffer","data":[247,101,236,98,248,191,84,42,179,162,29,164,226,139,63,132,100,200,192,25]},"announce":[],"urlList":[]}}