{"title":"Earth, Wind &amp; Fire - Heritage","uid":4921352,"size":142983172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f76c83e09349b62ff8a779dc6a725a342d86a384&amp;dn=Earth%2C+Wind+%26+Fire+-+Heritage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1243677087,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nHeritage is an album by Earth, Wind &amp; Fire released on Columbia Records. It was produced by the band's leader Maurice White was released in January of 1990. Heritage went to number 19 on the Top R&amp;B/Hip-Hop Albums charts and the single Heritage peaked at number 5 on the Hot R&amp;B/Hip-Hop Singles &amp; Tracks chart. The album also featured an appearance by Sly Stone of Sly and the Family Stone on the track Good Time.\n\nEarth, Wind &amp; Fire is an American R&amp;B band formed in Chicago, Illinois, in 1969 and led by founder Maurice White. Also known as EWF or the Elements of the Universe, the band has won six Grammy Awards and four American Music Awards. They have been inducted into the Rock and Roll Hall of Fame and the Vocal Group Hall of Fame. They have sold over 90 million albums worldwide earning them a place on the list of best-selling music artists where they are ranked as the seventh best selling American band of all time. Rolling Stone Magazine has described Earth, Wind &amp; Fire as &quot;innovative, precise yet sensual, calculated yet galvanizing&quot; and has also declared that the band &quot;changed the sound of black pop&quot;. Earth, Wind &amp; Fire were also ranked at number 60 on VH1's list of the 100 Greatest Artists of Rock &amp; Roll.\n\nThe band's music contains elements of African music, Latin music, funk, soul, jazz, pop, rock, and other genres. The band is known for the dynamic sound of their horn section and the interplay between the contrasting vocals of Philip Bailey's falsetto and Maurice White's tenor. The kalimba (African thumb piano) is played on all of the band's albums.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f76c83e09349b62ff8a779dc6a725a342d86a384","amp;dn":"Earth%2C+Wind+%26+Fire+-+Heritage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f76c83e09349b62ff8a779dc6a725a342d86a384","infoHashBuffer":{"type":"Buffer","data":[247,108,131,224,147,73,182,47,248,167,121,220,106,114,90,52,45,134,163,132]},"announce":[],"urlList":[]}}