{"title":"Inno Setup Compiler 5.1.10 (By ang3l2006)","uid":3625735,"size":1394272,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f88bcb15542310643c2500c8277d272bcef6412c&amp;dn=Inno+Setup+Compiler+5.1.10+%28By+ang3l2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ang3l2006","files":1,"time":1172338257,"description":"Inno Setup is a free, feature-packed installation builder. The application&amp;#039;s features include a Windows 2000-style wizard interface; the ability to create a single EXE for easy, online distribution; support for disk spanning; and full uninstall capabilities. The program also includes customizable setup types, integrated file compression, support for installing shared files and OCXs, and the creation of Start menu icons, INI entries, and registry entries. Full Delphi source code is available on the author&amp;#039;s Web site.\n\n    * Changes in 5.1.10:Added two new [Run]/[UninstallRun] section flags: 32bit and 64bit. Similar to the [Files] section flags of the same name, these override the install mode and affect which System directory the {sys} constant maps to on 64-bit Windows.\n    * Pascal Scripting:\n          o Added new EnableFsRedirection support function.\n          o On the Exec function, you can now pass &amp;#039;&gt;&amp;#039; in the Filename parameter and it will use the value of the Params parameter as the full command line. This feature can come in handy when executing command lines obtained from UninstallString registry values; no longer is it necessary to separate strings into filename and parameter components manually.\n          o Fix: IsComponentSelected and IsTaskSelected didn&amp;#039;t accept forward slashes.\n    * Improved Setup&amp;#039;s folder tree view control (seen when a Browse button is clicked):\n          o On Windows Vista, it now uses the same theme as Windows Explorer.\n          o On Windows Vista, for consistency with Explorer, single-clicking in a node&amp;#039;s text area no longer causes the node to expand.\n          o Like Windows Explorer, folder nodes now use the shell&amp;#039;s &quot;display names&quot;, as opposed to the actual directory names. This matters on localized versions of Windows Vista, where the on-disk names of system folders are always in English.\n          o The system &quot;icon&quot; font is now used instead of the default dialog font. This font defaults to Segoe UI on Windows Vista, and typically Tahoma or MS Sans Serif on earlier versions of Windows.\n          o Disconnected network drives are now listed; expanding one will restore the connection (on Windows 2000, Me, and later).\n    * On the Select Destination Location wizard page (as well as custom directory selection pages created using the CreateInputDirPage support function), if the letter of a disconnected network drive is entered, and the user is running Windows XP or later, it will now attempt to restore the connection automatically when Next is clicked. (It also does this on silent installs.)\n    * On Windows Vista, eliminated the flickering on Setup&amp;#039;s progress bar (purely a cosmetic issue).\n    * On Windows Vista, Setup now calls SetProcessDPIAware to avoid bitmap scaling when Windows is configured to use Large Fonts and the &quot;Use Windows XP style DPI scaling&quot; option is unchecked (not the default setting).\n    * Compiler IDE changes:\n          o Added new option: Always launch Setup/Uninstall as different user. This forces the IDE to display a &quot;Run as&quot; dialog when launching Setup/Uninstall.\n          o The Stop Compile command now displays a confirmation message box.\n    * Added a &quot;Vista-aware&quot; manifest resource to ISCC so it doesn&amp;#039;t request elevation on Windows Vista.\n    * Fix: ISCC didn&amp;#039;t always print error messages when standard output was redirected to a file.\n    * When Setup fails to set the permissions on files, directories, or registry keys, the error code is now included in the log output.\n    * When Setup fails to expand a shell folder constant, a warning message containing the error code is now logged.\n    * Changed the way version information is read from VXD files to be more compliant with the MSDN docs.\n    * The uninstall program&amp;#039;s version is now 51.45.0.0.\n    * Minor tweaks","torrent":{"xt":"urn:btih:f88bcb15542310643c2500c8277d272bcef6412c","amp;dn":"Inno+Setup+Compiler+5.1.10+%28By+ang3l2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f88bcb15542310643c2500c8277d272bcef6412c","infoHashBuffer":{"type":"Buffer","data":[248,139,203,21,84,35,16,100,60,37,0,200,39,125,39,43,206,246,65,44]},"announce":[],"urlList":[]}}