{"title":"Philip Roth - The Counterlife (pdf)","uid":8419077,"size":3664857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f960c6d7d604ba104ca4da3cf850183ee1bea49d&amp;dn=Philip+Roth+-+The+Counterlife+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pharmakate","files":-1,"time":1367126557,"description":"Philip Roth - The Counterlife (Vintage, 1986). 324 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate metadata and pagination, etc.\n\n\ngenre: Literary fiction\n\n\ndescription:\n\nThe Counterlife is about people enacting their dreams of renewal and escape, some of them going so far as to risk their lives to alter seemingly irreversible destinies. Wherever they may find themselves, the characters of The Counterlife are tempted unceasingly by the prospect of an alternative existence that can reverse their fate.\n\nIlluminating these lives in transition and guiding us through the book's evocative landscapes, familiar and foreign, is the mind of the novelist Nathan Zuckerman. His is the skeptical, enveloping intelligence that calculates the price that's paid in the struggle to change personal fortune and reshape history, whether in a dentist's office in suburban New Jersey, or in a tradition-bound English Village in Gloucestershire, or in a church in London's West End, or in a tiny desert settlement in Israel's occupied West Bank.\n\nReview\n\nThe saga of Henry and Nathan Zuckerman continues, 13 years after novelist Nathan Zuckerman first appeared in Roth's 1974 effort, My Life as a Man. In The Counterlife, the dentist Henry suffers an unsettling--and for Roth, a predictable--side effect to his heart medication: impotence, which leads him to undergo an ill-fated operation. The multi-layered plot line travels from New York to London to Israel, while the characters undergo a series of surprising transformations. In the words of Nathan, a change in one's life causes &quot;a counterlife that is one's own anti-myth.&quot; It's vintage Roth.\n\nFrom Library Journal\n\nOne of Roth's &quot;Zuckerman&quot; books, The Counterlife follows protagonist Nathan Zuckerman from New York to Israel to London. &quot;Along the way, monologues, eulogies, letters, interviews, and conversations ponder Judaism and Zionism, the nature of personality, the competing claims of imagination and life, and sex.&quot;","torrent":{"xt":"urn:btih:f960c6d7d604ba104ca4da3cf850183ee1bea49d","amp;dn":"Philip+Roth+-+The+Counterlife+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f960c6d7d604ba104ca4da3cf850183ee1bea49d","infoHashBuffer":{"type":"Buffer","data":[249,96,198,215,214,4,186,16,76,164,218,60,248,80,24,62,225,190,164,157]},"announce":[],"urlList":[]}}