{"title":"Ozzy Osbourne - Lightning Strikes","uid":4591367,"size":183859204,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fafb115a96f5d1e6f82ac8d7617dd481cfdb817d&amp;dn=Ozzy+Osbourne+-+Lightning+Strikes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":1,"time":1229847596,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nJohn Michael &quot;Ozzy&quot; Osbourne (born 3 December 1948) is an English singer-songwriter, whose career has now spanned for four decades. Osbourne rose to prominence as lead vocalist of pioneering English heavy metal band Black Sabbath, and eventually achieved a multi-platinum solo career which revolutionized the heavy metal genre. As a result he is known as the &quot;Godfather of Heavy Metal&quot;, and, because of some of his material, the &quot;Prince of Darkness&quot;. In the early 2000s, his career as a celebrity hit a new zenith when he became a star in his own reality show, The Osbournes alongside wife/manager Sharon and two of their three children, Kelly and Jack. In August 2008, Osbourne stated in USA Today that he intends to retire from his music career after two more albums.\n\nThe Ultimate Sin is an album by Ozzy Osbourne. It was released on February 22, 1986, and it was remastered and re-issued on August 22, 1995. This album was certified double platinum on October 26, 1994. This album features guitarist Jake E. Lee (formerly of Mickey Ratt, Rough Cutt and Dio). This is the only Ozzy album to feature bassist Phil Soussan - who wrote the album's U.S. hit single &quot;Shot in the Dark&quot; - and the first to feature drummer Randy Castillo, who has since died due to cancer. Lyrics were largely written by long-time Ozzy bass player Bob Daisley, who was also present during the initial writing sessions. Daisley left after having a disagreement with Ozzy, which led to the hiring of Soussan. He was also not credited as a co-writer on the initial 1986 pressing of the album. This was corrected for each pressing after that.\n\nThe Ultimate Sin was Ozzy's highest charting studio album. The RIAA awarded the album Platinum status on May 14 1986, soon after its release; it was awarded Double Platinum status on October 26, 1994.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fafb115a96f5d1e6f82ac8d7617dd481cfdb817d","amp;dn":"Ozzy+Osbourne+-+Lightning+Strikes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fafb115a96f5d1e6f82ac8d7617dd481cfdb817d","infoHashBuffer":{"type":"Buffer","data":[250,251,17,90,150,245,209,230,248,42,200,215,97,125,212,129,207,219,129,125]},"announce":[],"urlList":[]}}