{"title":"NOT WITHOUT MY DAUGHTER-1991 (GR SUBS)","uid":9368838,"size":728972534,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc4ada53e2b668185ebd105a63487202d3dcef79&amp;dn=NOT+WITHOUT+MY+DAUGHTER-1991+%28GR+SUBS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dgk1961","files":2,"time":1387482772,"description":"Not Without My Daughter (1991)\n116 min - Drama | Thriller - 11 January 1991 (USA)\n\nNot Without My Daughter is a film released in 1991 depicting the escape of American citizen Betty Mahmoody and her daughter from her husband in Iran. The film was shot in the United States and Israel, and the main characters Betty Mahmoody and Sayed Bozorg &quot;Moody&quot; Mahmoody are played by Sally Field and Alfred Molina, respectively. Sheila Rosenthal and Roshan Seth star as Mahtob Mahmoody and Houssein the smuggler, respectively.\n\nPlot : In 1984, Betty Mahmoody's husband took his wife and daughter to meet his family in Iran. He swore they would be safe. They would be happy. They would be free to leave. He lied.[1]\n\nAn Iranian physician, Sayed Bozorg &quot;Moody&quot; Mahmoody desires to move to Iran with his American family. He claims that his Iranian family want to meet his wife Betty and daughter Mahtob, and asks them to come with him for a two week visit. Despite her deep fears about visiting Iran, Betty reluctantly agrees.\n\nWhen in Tehran, Moody announces his wife that he wishes for them to stay in Iran. Betty has been deceived by her husband, even though Moody took an oath that they would return to America, swearing &quot;on the sacred Koran&quot;. Moody becomes hostile and abusive, preventing her from leaving the house or using the telephone. Betty briefly manages to visit the American Interests Section of the Swiss Embassy, but is told that she is now an Iranian citizen for being married to an Iranian. In Iran she has no parental rights on her daughter.\n\nKnowing that her chances of escape are minimal, Betty conforms to her husband's wishes, to gain the trust of Moody and his family. By chance she contacts a humanitarian Iranian, Hossein (Seth), who helps Betty and Mahtob in their passage back to America. Moody approves of Betty returning to see her dying father, but will not let Mahtob go with her.\n\nFinally, Hossein manages to send Betty and Mahtob off with some Iranian smugglers, and using fake identity documents, they make their way past the checkpoints. Despite the difficult and very dangerous journey, Betty and Mahtob are dropped off in Turkey, where they can reach the US Embassy.\nDirector: Brian Gilbert\nWriters: Betty Mahmoody (book), William Hoffer (book)\nStars: Sally Field, Alfred Molina, Sheila Rosenthal ","torrent":{"xt":"urn:btih:fc4ada53e2b668185ebd105a63487202d3dcef79","amp;dn":"NOT+WITHOUT+MY+DAUGHTER-1991+%28GR+SUBS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc4ada53e2b668185ebd105a63487202d3dcef79","infoHashBuffer":{"type":"Buffer","data":[252,74,218,83,226,182,104,24,94,189,16,90,99,72,114,2,211,220,239,121]},"announce":[],"urlList":[]}}